{"data": {"id": "USCIS-2006-0044-0771", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0771"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "As an immigration paralegal I can well appreciate the need for improvement of<br/>service across the board; assuming an increase in finance is the best way to<br/>implement these changes, a fee increase would seem a reasonable step.<br/><br/>However, the new fee structure, while laudably making humanitarian concessions<br/>such as removing the fee for sexual trafficking victims, is clearly an attempt<br/>to reduce the backlog of Permanent Resident cases simply by RAISING FEES for<br/>these applications as a DETERRENT to adjustment.<br/><br/>Further, a focused effort to allocate the new funds toward specific EDUCATION<br/>would have long-reaching impact towards more efficient processing and<br/>distribution of resources in the future.<br/><br/>--------------<br/><br/>ADJUSTMENT FEES<br/><br/>As resolution of a target - reducing or eliminating the backlog - this fee<br/>increase does make some sense, in PURELY NUMERICAL terms.<br/><br/>However:<br/><br/>1) Unlike legislation for the H1B visa, there is no legislation in place stating<br/>that employers must pay any part of the fee for employment-based adjustment. <br/>Thus the burden will very likely fall on the individuals - and these are in many<br/>situations not individuals who will be a &quot;burden on the state&quot; but people who<br/>have already been working and contributing to American society for years.<br/><br/>2) You will find that these individuals WILL in fact pay the new fees - they are<br/>in general desperately worried about losing their jobs as they will have (in<br/>many cases) a matter of only days in which to pack up their entire lives.  They<br/>will be that much more indignant when they have to wait years for review of<br/>their cases.  You will get a larger volume of (angrier!) calls - costing you<br/>additional dollars.<br/><br/>3) Why not increase INITIAL fees for H1B employment MORE and adjustment fees<br/>LESS?  You may well find fewer frivolous petitions being filed as a result.<br/><br/>4) Similarly, why not increase PREMIUM PROCESSING fees?  I know this issue was<br/>specifically dismissed in the docket, but I don&#39;t see why.  Especially now that<br/>I-140s are being processed Premium, you should presumably see a jump (and given<br/>DOL&#39;s proposed backlog elimination and the success of the PERM program you are<br/>not doubt already experiencing an increased number of filings.<br/><br/>5) There is a HUGE increase in fees for removing conditions / adjusting from<br/>temporary to permanent residence.  Again, people whose status has already been<br/>evaluated and approved to some degree - why punish them now?  The justification<br/>for this is not entirely clear - the motivation per the docket seems to be<br/>&quot;security&quot; - and while security is of course of great importance, one must<br/>necessarily take the word with a grain of salt these days given the extent to<br/>which it has been abused by the current Administration.<br/><br/>EDUCATION<br/><br/>Working with immigrants and nonimmigrants every day it is crystal-clear that<br/>many people get into difficult situations merely because they do not understand<br/>the law.  <br/><br/>Your proposal describes creating informational pamphlets for newly naturalized<br/>citizens--<br/><br/>WHY?  They&#39;ve already &quot;made it&quot;.  <br/><br/>The people who NEED educating are here in various other immigrant or<br/>nonimmigrant status.  A HUGE number of status violations occur with no intent<br/>whatsoever because people are incorrectly advised by various public<br/>&quot;facilities&quot;, their employers, friends, etc. - they do not know where to go for<br/>help.  <br/><br/>Educating people from the time of initial authorized entry in ANY status would<br/>prevent, in the long run, expenditures of time, money, and resources from<br/>adjudication right through to deportation.<br/><br/>Ignorance of the law may be no excuse - but isn&#39;t it better to attack ignorance<br/>than the ignorant?<br/><br/>Thanks for reading.<br/><br/>JB<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020a3f4", "lastName": null, "legacyId": null, "modifyDate": "2007-02-21T20:18:10Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-21T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-21T17:11:47Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Joshua R. Boyer", "trackingNbr": "8020a3f4", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0771/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0771/attachments"}}}}}