{"data": {"id": "USCIS-2006-0044-2700", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2700"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "NOTE:  I transmitted this Comment as an Attachment, prior, and was given a <br/>Tracking Number 8021d7a9, but it has not posted.  This is the same Comment, <br/>but this is lacking footnotes.  Thank you.<br/><br/>March 30, 2007<br/><br/>TO:<span style='padding-left: 30px'></span>Via E-Mail Transmission<br/>Director, Regulatory Management Division<br/>U.S. Citizenship &amp; Immigration Services<br/>United States Department of Homeland Security<br/>111 Massachusetts Avenue, N.W., 3rd Floor<br/>Washington, D.C. 20529<br/>202-272-8377<br/>OSComments@dhs.gov<br/><br/>FROM:<br/>CENTRO ROMERO, a BIA Recognized and Accredited Not-For-Profit<br/>6216 North Clark Street<br/>Chicago, IL 60660<br/>773-508-5300 x 19<br/>FAX 773-508-5399<br/>f.melone@centroromero.org<br/><br/>RE:<span style='padding-left: 30px'></span>DHS Docket Number USCIS-2006-0044.<br/><br/>COMMENT on Proposed Rule to Adjust the Immigration and Naturalization Benefit <br/>Application and Petition Fee Schedule, Published at 72 Fed. Reg. 4888 (02-01-<br/>2007). <br/><br/><span style='padding-left: 30px'></span>This Comment is submitted in accordance with those guidelines <br/>provided at 72 Fed. Reg. 4888 (February 1, 2007).  This Comment is due on or <br/>before April 2, 2007.  Thank you for this opportunity and for taking our Comment <br/>under your careful consideration.<br/><br/>CONCLUSIONS.<br/>?<span style='padding-left: 30px'></span>The Proposed Rule exceeds the relevant statutory authority and may <br/>not be legally promulgated as a Final Rule in its current form.<br/>?<span style='padding-left: 30px'></span>The position advanced by United States Citizenship &amp; Immigration <br/>Services (USCIS) leadership and adopted in the Proposed Rule as if it were a <br/>mandate, that Congressional appropriation for USCIS operations is not an option, <br/>is erroneous and can find no support in law or fact.  Not only is Congressional <br/>appropriation allowed for all public and governmental activities, but also it is <br/>absolutely vital.  <br/>o<span style='padding-left: 30px'></span>It is the job of USCIS leadership to lobby for and obtain necessary <br/>appropriations to run its agency and execute its mission.  <br/>o<span style='padding-left: 30px'></span>It is the role of Congress to adequately fund the public and <br/>governmental activities of executive branch agencies, including the USCIS, that <br/>are created by Congressional action.<br/>?<span style='padding-left: 30px'></span>The Proposed Rule fundamentally departs from Federal methodologies <br/>and guidelines for establishing user fees for special benefits, as established by the <br/>Office of Management and Budget (OMB) and the Federal Accounting Standards <br/>Advisory Board (FASAB), and instead creates an unconscionable fee schedule, <br/>not to support the Immigration Examinations Fees Account (IEFA), but to carry an <br/>entire Federal executive branch agency into the 21st Century.<br/>?<span style='padding-left: 30px'></span>The Proposed Rule incorrectly and improperly determines ?full cost? of <br/>immigration adjudication and naturalization services, and purports to include many <br/>public and governmental activities and objectives that are not lawfully covered by <br/>the Immigration Examinations Fee Account (IEFA).   <br/>?<span style='padding-left: 30px'></span>The arguments advanced by the Proposed Rule for automatically <br/>including interim benefits into adjustment of status applications are circular and <br/>unpersuasive.  Interim benefits should remain the Applicant?s choice.<br/>?<span style='padding-left: 30px'></span>The proposal to include VAWA and T-visa costs into the surcharge pool <br/>is acceptable and desirable.<br/><br/>I.<span style='padding-left: 30px'></span>THE PROPOSED RULE EXCEEDS AND VIOLATES THE <br/>APPLICABLE STATUTORY AUTHORITY.<br/>The Proposed Rule exceeds and violates the applicable statutory authority that <br/>allows the Department of Homeland Security (USDHS)  to establish an account for <br/>Immigration Examinations Fees (the Immigration Examinations Fees Account <br/>or ?IEFA?).  8 U.S.C. 1356(m) (2006).  This provision is the exclusive statutory <br/>authority given to the appropriate federal agency, presumably the USCIS, to <br/>charge user fees, and the Proposed Rule purports to cite no other authority. <br/><br/>a.<span style='padding-left: 30px'></span>The IEFA Authority Granted in 8 U.S.C. ? 1356 is Not a Congressional <br/>Mandate.<br/><span style='padding-left: 30px'></span>The authority granted to the USCIS to charge fees to fund the IEFA is <br/>discretionary, and does not constitute a congressional mandate for USCIS to <br/>become a ?fee-based agency? or to charge user-fees at all.   Fees may be <br/>established and charged exclusively to provide special benefits applied for by <br/>identifiable individual recipients, specifically, ?immigration adjudication and <br/>naturalization services.?  See 8 U.S.C. 1356(n) (2006).<br/><span style='padding-left: 30px'></span>Section 1356(m) states, ?fees for providing adjudication and naturalization <br/>services may be set at a level that will ensure recovery of the full costs of providing <br/>all such services ? .?  Clearly, USCIS has Congressional permission to charge <br/>fees, and then, specifically to recover the full costs of ?providing adjudication and <br/>naturalization services,? not to run an entire federal agency. <br/><span style='padding-left: 30px'></span>The only mandate stated in Section 1356(m) has to do with the disposition of <br/>any such IEFA funds that may have been charged and collected:  they ?shall be <br/>deposited as offsetting receipts into a separate account entitled ?Immigration <br/>Examinations Fee Account? in the Treasury of the United States ? .?  As well, the <br/>disposition of any IEFA fees that may be collected in the Virgin Islands or in <br/>Guam ?shall be paid over to the treasury of the Virgin Islands and to the treasury of <br/>Guam, ? .?<br/><span style='padding-left: 30px'></span>The USCIS has not been mandated, at any time, to become a user-fee <br/>supported federal agency.  Such an assertion is simply not true.  The USCIS <br/>interpretation or allegation that the Congressionally-allowed establishment of the <br/>IEFA is a Congressional mandate to convert the USCIS into a user-fee run <br/>agency, with no appropriation options available, is not supportable, but is, <br/>nevertheless, unmistakably articulated by the USDHS / USCIS.  See, for example, <br/>USCIS Office of Communications, Questions and Answers, # 18 (January 31, <br/>2007) [?Congress created a user fee account for the former INS in 1988, <br/>transforming it into a fee-based agency.  As a fee-based agency, USCIS uses <br/>revenue from application fees [IEFA] rather than appropriated funds to pay for the <br/>administration of the nation?s immigration laws, processing of applications, and the <br/>infrastructure needed to support these activities.?] Emphasis added.  See also the <br/>remarks of Dr. Emilio T. Gonzalez, USCIS Director, in the January 31, 2007 <br/>USCIS Press Conference:<br/><span style='padding-left: 30px'></span>&quot;MS MONTENEGRO:<span style='padding-left: 30px'></span>Is there any possibility that Congress could <br/>create a budget?  Have you addressed that issue?<br/><span style='padding-left: 30px'></span>MR. GONZALEZ:<span style='padding-left: 30px'></span><span style='padding-left: 30px'></span>I do not, because, you know, we have a mandate <br/>that we are a self-sustaining, fee-based agency, and I have not in my conversation <br/>with Congress ever gone and asked for an appropriation.  At this point, I have no <br/>intention of doing so.&quot;<br/>TAPE TRANSCRIPTION, Press Conference on a USCIS Proposed Fee <br/>Restructure, Building an Immigration Service for the 21st Century, pp. 14-15 <br/>(USDHS / USCIS January 31, 2007).<span style='padding-left: 30px'></span><br/><span style='padding-left: 30px'></span>Congress itself has questioned this assertion.  In a February 13, 2007 letter to <br/>USDHS Secretary Chertoff, Representative Zoe Lofgren (D-CA) expressed concern <br/>over some of the Secretary?s testimony during a Homeland Security Committee <br/>hearing.  Representative Lofgren?s letter states:<br/>    &quot;During the hearing, I asked you if you would be prepared to move toward a <br/>request for appropriation for appropriate needs if the recent proposed fee increase <br/>for immigration applications fails.  You answered, ?That would be a problem.  My <br/>understanding is that Congress has always mandated this fee.?<br/><span style='padding-left: 30px'></span>I would greatly appreciate clarification of your statement as Congress has <br/>simply authorized, not mandated, the collection of fees to cover costs of <br/>immigration application processing. [Footnote citing Section 1356(m) is omitted].  <br/>In fact, as you know, DHS has received appropriations in the past for this program, <br/>most recently $182 million in FY07.  Such appropriations belie your explanation of <br/>a mandated fee recovery.<br/><span style='padding-left: 30px'></span>I am also concerned about your response to my question about the significant <br/>drop in funding you requested for FY08.  You stated that the drop in the USCIS <br/>budget was due to the proposed fee increase of 66% for processing naturalization <br/>and immigration applications.  You stated, ?If the fee were blocked, then we would <br/>have a big hole in the budget.  That would be a big problem for this Congress <br/>because you would have to find a significant chunk of money.  Either we would <br/>have to go back to the days of backlog, or we would have to decide to hire fewer <br/>Border Patrols or have less technology.?<br/><span style='padding-left: 30px'></span>I would appreciate a clarification of your statement.  USCIS immigration <br/>application fees cannot be used for enforcement purposes.  [Footnote citing <br/>Section 1356(n) is omitted].  Yet you suggested that without a fee increase, <br/>USCIS may not be able to fund additional Border Patrol agents, despite the fact <br/>that Congress has been steadily funding this for the past several years without a <br/>fee increase.<br/><span style='padding-left: 30px'></span>Please provide me with clarification on your understanding of fee collection by <br/>USCIS, why the USCIS budget was cut and for what purpose the increased fees <br/>amounts will be used.&quot;<br/>   <br/>Letter to Secretary Chertoff from Representative Zoe Lofgren, Chair of the House <br/>Judiciary Subcommittee on Immigration, Citizenship, Refugees, Border Security <br/>and International Law (February 13, 2007), published as a Press Release at, <br/>http://www.house.gov/apps/list/press/cal_16lofgren.<br/><span style='padding-left: 30px'></span>The USCIS assertion that Congress has somehow prohibited the USDHS / <br/>USCIS from seeking appropriations because Congress has allowed the IEFA fund <br/>is indeed strange, especially in light of Section 1356(n) which explicitly states, ?All <br/>deposits into the ?Immigration Examinations Fee Account? shall remain available <br/>until expended to the Attorney General to reimburse any appropriation the amount <br/>paid out of such appropriation for expenses in providing immigration adjudication <br/>and naturalization services ? .?  Emphasis added.  Not only does subsection (n) <br/>explicitly indicate that Congressional appropriations are possible and expected, <br/>but it also indicates that such Congressional appropriations remain available, not <br/>only to meet public and governmental goals, but also for ?providing immigration <br/>adjudication and naturalization services.?<br/><span style='padding-left: 30px'></span><br/>b.<span style='padding-left: 30px'></span>Revenue Streams Available to the USCIS.<br/><span style='padding-left: 30px'></span>The USCIS has, its assertions to the contrary notwithstanding, at least two <br/>revenue streams available:  (1) Congressional appropriations must be requested <br/>and provided to sustain the agency?s public service mission and its governmental <br/>operating requirements. Congressional appropriations, in fact, as evidenced by the <br/>language of Section 1356(n), may even be requested for immigration and <br/>naturalization adjudications and processing (with provisions for reimbursement).   <br/>(2) IEFA may be funded with user fees but only for immigration and naturalization <br/>adjudications and processing.<br/><span style='padding-left: 30px'></span>What is more troubling, however, is the fact that USDHS / USCIS has <br/>deliberately asked Congress for less money based upon this fictitious assertion.  <br/>The Lofgren Letter indicates that USDHS had asked for $30 million for 2008, in <br/>stark contrast to $182 million for 2007 and $114 million for 2006. <br/><span style='padding-left: 30px'></span>USDHS / USCIS articulates a real ?problem? for Congress if the ?problem? is <br/>not borne on the shoulders of immigration and naturalization applicants.  It then <br/>threatens backlogs, dangerous understaffing, and an operational inability to move <br/>the USCIS into the 21st Century.  What USDHS / USCIS does not state, however, <br/>is that the ?problem? is one which is self-created by the agency?s failure to notify <br/>Congress of its operational and mission requirements and ask for the required <br/>appropriations to meet its mission and mandate.  <br/><span style='padding-left: 30px'></span>The USCIS failure to proactively seek adequate Congressional appropriations <br/>to bring the USCIS into the 21st Century is, in fact, not mandated, is certainly <br/>troubling, and may actually impair its ability to meet its national security <br/>mandates.  This is a governmental problem that must be solved by the Agency <br/>and the Congress.  It most certainly has nothing to do with processing immigration <br/>and naturalization benefits applications.  <br/><span style='padding-left: 30px'></span>A Federal Executive Branch Agency created by legislation, such as the <br/>USCIS, must be sustained by Congressional funding.  It is the Agency?s <br/>responsibility to notify Congress of its operating requirements and mission goals, <br/>and it is the responsibility of Congress to fund the mission and operations of the <br/>Agency that it has mandated.  <br/><span style='padding-left: 30px'></span>It is unacceptable for an agency to fail to identify and ask Congress for all <br/>required funding, as USDHS / USCIS has apparently done.  It is statutorily <br/>impermissible for the USCIS to build funding for public and governmental mandates <br/>and objectives from the IEFA (specifically for processing special benefits for <br/>identifiable individual applicants).<br/><br/>c.<span style='padding-left: 30px'></span>The Scope of the IEFA.<br/><span style='padding-left: 30px'></span>The IEFA is explicitly specific in its scope.  Fees from individual recipients of <br/>special benefits may be collected:<br/>?<span style='padding-left: 30px'></span>To recover the full costs of providing ?adjudication and naturalization <br/>services;? <br/>?<span style='padding-left: 30px'></span>To recover ?the costs of similar services provided without charge to <br/>asylum applicants or other immigrants? (surcharges); and<br/>?<span style='padding-left: 30px'></span>To recover ?any additional costs associated with the administration of <br/>the fees collected.? <br/><span style='padding-left: 30px'></span>The IEFA is confined exclusively to recovering the full costs of <br/>providing ?special benefits? to identifiable individual recipients, and the costs of <br/>handling the IEFA itself.  Such fees, or charges, should not be made ?for a service <br/>when the identification of the specific beneficiary is obscure, and the service can <br/>be considered primarily as benefiting broadly the general public.?  See Office of <br/>Management and Budget, Circular No. A-25,  6 and 6(a)(4) [OMB Cir. A-25].  <br/>Applications for visas, in fact, are explicitly included in the OMB definition <br/>of ?special benefits.?  OMB Cir. A-25,  6(a)(1)(c).<br/><span style='padding-left: 30px'></span>Running an executive branch agency, executing an agency mission, general <br/>agency overhead and operation costs, executing the laws of the United States, <br/>or ?Building an Immigration Service for the 21st Century,? are governmental and <br/>public goals that may not and cannot be financed from the IEFA.  Contra USCIS <br/>Office of Communications, Questions and Answers (January 31, 2007).   <br/><br/>II.<span style='padding-left: 30px'></span>THE PROPOSED RULE FAILS TO PROPERLY IMPLEMENT THE <br/>APPLICABLE FEDERAL ACCOUNTING GUILDELINES.<br/><span style='padding-left: 30px'></span>The Proposed Rule purports to comply with guidelines outlined by the Office of <br/>Management and Budget (OMB) and of the Federal Accounting Standards <br/>Advisory Board (FASAB).  72. Fed. Reg. 4888, at 4889.<br/><br/>d.<span style='padding-left: 30px'></span>OMB and FASAB Guidelines: Special Benefits Activities.<br/><span style='padding-left: 30px'></span>The Proposed Rule correctly states that OMB Circular A-25 (OMB A-<br/>25) ?establishes Federal policy regarding fees assessed for Government services <br/>and the basis upon which federal agencies set user charges sufficient to recover <br/>the full cost to the Federal Government.?  72 Fed. Reg. 4887, 4889.  However, the <br/>Proposed Rule neglects to state for which Federal activities it is allowed to recover <br/>the full costs via user fees.   <br/><span style='padding-left: 30px'></span>OMB A-25 states its purpose to establish Federal policy for fees assessed for <br/>government services, and it ?provides information on the scope and type of <br/>activities subject to user charges.? OMB A-25 1.  It may be applied only to <br/>those ?Federal activities that convey special benefits to recipients beyond those <br/>accruing to the general public.?  OMB A-25 3(a).  This clearly indicates that any <br/>analysis about costs must begin with an analysis of which activities are involved.  <br/>An Agency cannot, therefore, lump its entire operation into user fees, simply <br/>because some of its activities may involve special benefits.  <br/><span style='padding-left: 30px'></span>OMB A-25  6 defines the fundamental concept of ?special benefits,? which <br/>are ?derived from Federal activities beyond those received by the general public.?  <br/>The Guidelines also state, ?No charge should be made for a service when the <br/>identification of the specific beneficiary is obscure, and the service can be <br/>considered primarily as benefiting broadly the general public.?  OMB A-25 6(a)(4).<br/>OMB A-25 goes on to describe how to calculate the ?full cost? of providing special <br/>benefits to identifiable recipients.  OMB A-25  6(d).  The Proposed Rule, however, <br/>jumps directly to this concept, without first applying the OMB threshold concepts <br/>of ?special benefits? to an analysis of which of the many USCIS activities are:<br/>?<span style='padding-left: 30px'></span>Public service activities (no fees can be charged), <br/>?<span style='padding-left: 30px'></span>Governmental objectives (can be considered primarily as benefiting <br/>broadly the general public, and any identification of any specific beneficiary is <br/>obscure, at best ? no fees can be charged), and <br/>?<span style='padding-left: 30px'></span>Special benefits for an identifiable recipient (a user charge may be <br/>imposed, here pursuant to Section 1356(m)).<br/><br/>e.<span style='padding-left: 30px'></span>The Fundamental Flaw in the Proposed Rule.<br/><span style='padding-left: 30px'></span>The USCIS Proposed Rule muddles two very distinct accounting issues:<br/>?<span style='padding-left: 30px'></span>Calculating the ?full cost? of the ?activities;? and <br/>?<span style='padding-left: 30px'></span>Determining which USCIS ?activities? are covered by the IEFA. <br/>The fundamental flaw in the Proposed Rule is the USCIS failure to make these two <br/>determinations separately, and its failure to make the latter determination first.<span style='padding-left: 30px'></span><br/>USCIS, instead, calculates the full cost of activities to be recovered by the IEFA <br/>by including in the calculation many component agency activities, objectives, and <br/>goals, that are not covered and may not properly be covered by IEFA.  <br/><span style='padding-left: 30px'></span>This skewed analysis results in an artificial and impermissible inflation of <br/>the ?full costs? of ?immigration adjudication and naturalization services? to include <br/>the costs for governmental and public activities, which dramatically higher than the <br/>costs associated exclusively with the special benefits delivered to identifiable <br/>individual recipients of ?immigration adjudication and naturalization services.?  <br/>IEFA, the USCIS? exclusive statutory authority to charge any fees, clearly and <br/>without doubt has to do only with special benefits applied for by identifiable <br/>individuals.<br/><span style='padding-left: 30px'></span>A narrow group of USCIS activities identified in the Proposed Rule are, in fact, <br/>related to ?special benefits? to ?identifiable recipients,? pursuant to the <br/>requirements of OMB Circular A-25.  Unfortunately, USCIS has failed to separate <br/>out these Agency activities in its Proposed Rule, and has instead muddled them <br/>together all the activities involved in running the agency (for example, recruiting <br/>and training activities) with a distinct and limited group of activities, which actually <br/>confer special benefits on identifiable users (for example, sending John Q. Public?s <br/>immigration documents by mail to John Q. Public).  <br/><span style='padding-left: 30px'></span>In addition to OMB Circular A-25, USCIS cites FASAB Statement No. 4 on the <br/>issue of the ?full costs.?  In the section of the Executive Summary entitled ?Full <br/>Costs,? FASAB states, ?Reporting entities should report the full costs of outputs in <br/>general purpose financial reports.  The full cost of an output produced by a <br/>responsibility segment is the sum of (1) the costs of resources consumed by the <br/>segment that directly or indirectly contribute to the output, and (2) the costs of <br/>identifiable supporting services provided by other responsibility segments within <br/>the reporting entity.?<br/><span style='padding-left: 30px'></span>This FASAB guideline establishes that both direct costs (for example, the <br/>cost of the plastic upon which John Q. Public?s immigration card is printed) and <br/>indirect costs (for example, the cost of the labor of the USCIS contractor that <br/>operates the press while Mr. Public?s card is being made) are components of <br/>the ?full cost? of Mr. Public?s card.<br/><span style='padding-left: 30px'></span>However, the FASAB guideline must be read in conjunction with OMB Circular <br/>A-25, which makes clear that the ?full cost? which may be passed along to the <br/>user is the cost involved in providing that particular special benefit to that particular <br/>identifiable user.  In other words, the cost of printing an immigration card for John <br/>Q. Public is correctly passed along to John Q. Public.  However, the cost of <br/>establishing, for example, an Individual Learning Account (see 72 Fed. Reg. at <br/>4901) for the operator of the printing press so that he/she will be more invested in <br/>his/her job cannot properly be passed along to John Q. Public, as the Proposed <br/>Rule purports to do.  The Individual Learning Account has nothing to do with Mr. <br/>Public?s card, nor his application for the card, nor with any other aspect of Mr. <br/>Public?s special benefit process.<br/><br/>f.<span style='padding-left: 30px'></span>OMB and FASAB Guidelines: Direct and Indirect Costs.<br/><span style='padding-left: 30px'></span>It is true that ?indirect costs? as well as ?direct costs? may be included into the <br/>calculation to determine the ?full cost.?  This Comment does not dispute OMB and <br/>FASAB guidelines that permit the inclusion of indirect costs of special benefits <br/>activities into the calculations of special benefits fees necessary to recover the full <br/>costs of administering the special benefits to identifiable individuals.<br/><span style='padding-left: 30px'></span>??Full cost? includes all direct and indirect costs to any part of the Federal <br/>Government of providing a good, resource, or service.?  OMB Circular A25,  6(d).  <br/>The emphasis is added to indicate what part of this definition the Proposed Rule <br/>does not take into account.  The Proposed Rule mistakenly reads this definition <br/>of ?full cost? to mean that ?full cost? of every activity it undertakes, including <br/>governmental and public activities, as well as special benefits activities.<br/><span style='padding-left: 30px'></span>As noted above, however, the USCIS improperly ignores OMB and FASAB <br/>guidelines regarding which activities may be included into the analysis.  This <br/>fundamental flaw, again, skews the USCIS analysis of indirect costs.  The <br/>Proposed Rule correctly identifies ?processing activities? that must be undertaken <br/>to adjudicate ?immigration and naturalization applications? [Inform Public / Capture <br/>Biometrics / Intake / Conduct IBIS / Review Records / Make Determination / Fraud <br/>Detection  / Issue Document].  72 Fed. Reg. 4897.<br/><span style='padding-left: 30px'></span>The Proposed Rule then purports to construe the ?indirect costs? of <br/>processing ?immigration adjudication and naturalization services? rendered to <br/>individuals and covered by IEFA, to include both the direct and indirect costs of <br/>executing and implementing governmental operations and public services.  72 Fed. <br/>Reg. 4898-4902.  This skewed logic would purport to run the entire agency on the <br/>IEFA fees, which is statutorily impermissible. <br/><span style='padding-left: 30px'></span>The only indirect costs that may be properly recovered by the IEFA are, again, <br/>those costs that can be related to a special benefit processed for an identifiable <br/>individual.  OMB A-25  4(a), 6(a).  An example of this is the cost of the FBI <br/>background check.  Clearly this is an indirect cost (the USCIS does not bear this <br/>cost directly), but the activity (the FBI background check) is clearly traceable to <br/>an identifiable individual who is applying with the USCIS for a special benefit.  <br/>OMB Circular A25,  6.  The inclusion of this indirect cost as a cost that can be <br/>recovered by the IEFA is permissible, and such a determination complies with the <br/>OMB and the FASAB guidelines.<br/><span style='padding-left: 30px'></span>On the other end of the spectrum, the direct and indirect costs associated with <br/>maintaining and improving the physical plants and computer and information <br/>structures of the USCIS Service Centers and District Offices cannot be properly <br/>identified with an individual who is applying for a special benefit.  It is not <br/>statutorily permissible for the USCIS to recover such infrastructure costs from the <br/>IEFA simply by asserting that such costs are ?indirect.?  See OMB A-25  6(a).  <br/><br/>g.<span style='padding-left: 30px'></span>The Activities Identified by the USCIS Proposed Rule.<br/><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span>As stated above, it is not enough for the USCIS simply to assert, as it <br/>is doing in the Proposed Rule, that everything that it does is a direct or indirect <br/>cost of ?immigration and naturalization applications processing.?  In this section of <br/>the Comment, the activities identified in the Proposed Rule we first classify <br/>as ?public? or ?governmental? or as ?special benefits for identifiable recipients,? a <br/>necessary operation not clearly undertaken by the Proposed Rule.<br/><span style='padding-left: 30px'></span>If an activity is classified ?special benefits,? then the full costs of that <br/>activity, including both the direct and indirect costs of that activity, may be <br/>recovered from the IEFA.  If, however, the activity is ?public? or ?governmental,? <br/>may not be properly funded from the IEFA.  Those activities must be funded by <br/>Congress, which mandated those activities.  This is the proper analysis indicated <br/>both by the OMB and the FASAB, and we classify the activities using those <br/>guidelines in OMB A-25  6(a).  Once the Agency activities are properly identified <br/>and classified, the full cost of the ?special benefits? activities may be calculated <br/>according to guidelines.  FASAB 4,  89-91.<span style='padding-left: 30px'></span><br/><span style='padding-left: 30px'></span>USCIS identifies 27 activities, which it proposes to fund through the <br/>dramatically increased IEFA fees.  72 Fed. Reg. 4888, 4898-4902.  Of these 27 <br/>activities, only four may be legitimately funded through IEFA because they are, in <br/>fact, related to special benefits for identifiable users:  <br/>?<span style='padding-left: 30px'></span>Providing change of address data entry services, a $1.2 million cost <br/>item (p. 4898) ;<br/>?<span style='padding-left: 30px'></span>Enhancing mail and file room support for the AAO, a $129,000 cost <br/>item (p. 4899);<br/>?<span style='padding-left: 30px'></span>Paying increased costs to the FBI for background checks, a $12.4 <br/>million cost item (p. 4899); and <br/>?<span style='padding-left: 30px'></span>Enhancing delivery of secure documents, a $31.6 million cost item (p. <br/>4899).<br/><span style='padding-left: 30px'></span>The remaining 23 activities in the Proposed Rule?s list of <br/>purported ?processing activities? do not contribute to special benefits for identifiable <br/>users, as outlined in OMB Circular A-25  6(a).  Rather, these 23 activities <br/>represent USCIS governmental and public service objectives to bring the USCIS <br/>into the 21st Century.  These activities are legitimate, necessary and laudable, but <br/>they may not be funded from IEFA, because they do not relate to special benefits <br/>provided to identifiable recipients.  Nowhere in Section 1356(m) of the INA, nor in <br/>OMB A-25, does the USCIS receive authority to refashion itself into a 21st Century <br/>federal agency funded on the IEFA fees.  Improving the USCIS must be <br/>accomplished, it is true, but it must be done via Congressional appropriation.<br/><span style='padding-left: 30px'></span>The following is a list of the 23 items listed by the Proposed Rule <br/>as ?processing activities,? which do not, in fact, confer ?special benefits? on <br/>identifiable users.  These activities are therefore not subject to user fees, and may <br/>not be legally funded from the IEFA:<br/><span style='padding-left: 30px'></span>(1)  Enhance adjudications and support staff (p. 4898):  A staffing <br/>model ?designed to align resources with the need to prevent future backlogs? <br/>cannot be related to providing special benefits for identifiable users.  The notion <br/>that users of immigration and naturalization services should provide a funding <br/>cushion for unidentifiable future users of such services directly contravenes the <br/>meaning of the OMB A-25  6(a).  The USCIS, itself, has characterized the backlog <br/>problem as one involving national security (4892-93), and is clearly a public or <br/>governmental objective. <br/><span style='padding-left: 30px'></span>(2)  Process FOIA requests (4898):  FOIA requests do not constitute <br/>special benefits for identifiable users that would be contributing to the IEFA.  FOIA <br/>requests originate from persons other than applicants for immigration and <br/>naturalization benefits.  It may also be problematic if the FOIA law prohibits or <br/>limits charges made.  In any event, even if FOIA is considered a special benefit, it <br/>is not one that is included within the scope of the IEFA.<br/><span style='padding-left: 30px'></span>(3)  Print and distribute guidebooks for new naturalized citizens (4898-<br/>99):  A Citizen?s Almanac containing ?America?s most cherished founding <br/>documents, [and] Presidential quotes on citizenship? does nothing to advance or <br/>process an identifiable recipient?s application and is therefore not within the IEFA.  <br/>By definition, the recipient would only receive this unsolicited ?gift? from USCIS <br/>after his/her application has been fully processed and adjudicated.  This cost <br/>could be included only if it is upon order of the applicant.<br/><span style='padding-left: 30px'></span>(4)  Establish a second full service card production facility (4899):  <br/>Building a second production facility for use if the original facility ever <br/>experiences ?catastrophic failure? is another cost item related only to a <br/>governmental objective, not to special services for identifiable users.  It is an <br/>infrastructure cost related to a contingency, and it is a sensible governmental <br/>objective; not one that can be related to a special benefit for an identifiable <br/>recipient, and it may not be funded from the IEFA.<br/><span style='padding-left: 30px'></span>(5)  Enhance fraud protection and detection efforts (4899):  The <br/>activities of the Fraud Detection and National Security Division (described at 4894) <br/>benefit the general public and is commensurate with the USCIS public service <br/>mission, as opposed to identifiable recipients of special benefits.  It is an activity <br/>related to executing the Agency?s mission, and as such, is a governmental and <br/>public service objective that may not be funded from the IEFA.  <br/><span style='padding-left: 30px'></span>(6)  Enhance national security systems and processes (4899):  See <br/>item 5 above with respect to fraud detection efforts.<br/><span style='padding-left: 30px'></span>(7)  Enhance internal security and investigative operations (4899):  This <br/>so-called ?processing activity? would purport to use the IEFA to fund investigations <br/>of misconduct of contractors.  It is difficult to conceive of an activity less related to <br/>special benefits for identifiable users of immigration services.<br/><span style='padding-left: 30px'></span>(8)  Establish an administrative site inspection program (4900):  See <br/>items 5 above with respect to fraud detection efforts.<br/><span style='padding-left: 30px'></span>(9)  Enhance protective security operations (4900):   Hiring security <br/>guards for USCIS facilities does not confer a special benefit on an identifiable <br/>recipient of immigration services.<br/><span style='padding-left: 30px'></span>(10)  Enhance existing card production program (4900):  Improving <br/>general efficiency of contractor services does not provide a special benefit for an <br/>identifiable user of immigration services.<br/><span style='padding-left: 30px'></span>(11)  Enhance emergency preparedness operations (4900):  <br/>Establishing ?full time, real-time mission coordination? is wholly unrelated to <br/>providing a special benefit for an identifiable user.<br/><span style='padding-left: 30px'></span>(12)  Enhance personnel security operations (4900):  Obtaining security <br/>clearances for USCIS employees and contractors does not provide a special <br/>benefit for an identifiable user.<br/><span style='padding-left: 30px'></span>(13)  Fully fund the Cuban Haitian Entrant Program (4900):  This activity <br/>is laudable and may arguably be included within the surcharge authority of the <br/>IEFA.  However, on closer examination it appears to involve more a governmental <br/>resettlement initiative than individuals applying for special benefits covered by the <br/>IEFA.  These expenditures appear to be grants to NGO groups, rather than <br/>application fee waiver cases.  Our understanding of the surcharge authority does <br/>not include this type of expenditure, laudable as it is.  Surcharges may be <br/>collected for the IEFA for the processing of asylum applications and other fee <br/>waiver cases.  This important resettlement activity appears to be a governmental <br/>and public service that must be adequately funded by Congress.<br/><span style='padding-left: 30px'></span>Another objection is the irregular and unpredictable expenditures <br/>involved (clearly admitted by the Proposed Rule).  The Proposed Rule has, in <br/>another place, declined inclusion of revenues derived from the TPS, the NACARA <br/>203, and the Section 245(i) programs because their collection cannot any longer <br/>be counted upon. (4897).  Here, the Proposed Rule purports to include an <br/>expenditure that is, at once $14 million but also ?unpredictable? and ?irregular.? <br/>(4900).<br/><span style='padding-left: 30px'></span>(14)  Upgrade and maintain the USCIS information technology program <br/>(4900-01):  Pricing this item at a staggering $124.3 million, the Proposed Rule <br/>seeks to have applicants fund USCIS efforts to bring its IT systems into the 21st <br/>Century.  It is difficult to conceive of a governmental objective more suitable for <br/>Congressional appropriation.<br/><span style='padding-left: 30px'></span>(15)  Acquire resources for rent and lease acquisition (4901):  Rent <br/>does not  provide a special benefit for an identifiable recipient, and may not be <br/>funded from the IEFA.<br/><span style='padding-left: 30px'></span>(16)  Enhance training program for all USCIS employees to foster <br/>individual achievement (4901):  Online training opportunities and ?individual learning <br/>accounts? do not provide special benefits for identifiable users.<br/><span style='padding-left: 30px'></span>(17)  Enhance resources for the Office of Chief Counsel (4901):  This <br/>item would not provide special benefits for identifiable users.<br/><span style='padding-left: 30px'></span>(18)  Transfer records to the National Archives and Records <br/>Administration (4901):  Inventorying and managing records do not provide special <br/>benefits for identifiable users.  On the other hand, the cost of retrieving and moving <br/>an applicant?s file in the processing of his/her case may be included in the <br/>calculation of the full cost of adjudicating that applicant?s special benefit case.  <br/>That cost, to be sure, is not $3.4 million dollars, but with handling and postage, <br/>probably is more in the neighborhood of $15.00 or less.  Moreover, this records <br/>management improvement may be mandated, as NARA asserts (4901), and <br/>certainly could not be funded by IEFA, but would have to find appropriation.  <br/><span style='padding-left: 30px'></span>(19)  Fully fund the H.R. and OSHS Programs (4901):  Providing every <br/>supervisor in the agency with occupational health and safety training may benefit <br/>agency employees but does not provide special benefits for identifiable users.<br/><span style='padding-left: 30px'></span>(20)  Conduct policy evaluation and research (4901-02):  Conducting <br/>policy evaluation and research is an excellent example of an activity which <br/>benefits the general public, but it does not provide special benefits for identifiable <br/>users.<br/><span style='padding-left: 30px'></span>(21)  Enhance resources for Office of CFO (4902):  See comment for <br/>Item 17 above. <br/><span style='padding-left: 30px'></span>(22)  Establish a national recruitment program for federal employees <br/>(4902):  Recruiting individuals to work for USCIS is a general business cost and <br/>does not provide special benefits for identifiable users.<br/><span style='padding-left: 30px'></span>(23)  Enhance procurement operations (4902):  Another necessary <br/>governmental function, but it does not provide special benefits for identifiable users.<br/><br/>III.<span style='padding-left: 30px'></span>IEFA SURCHARGE AUTHORITY, VAWA AND RELATED CRIME-<br/>VICTIM VISAS.<br/><span style='padding-left: 30px'></span>The USCIS authority to calculate surcharges and add them to other <br/>special benefits application fees to cover costs of Asylum and other fee-waiver <br/>cases is clearly provided in the IEFA.  8 U.S.C. 1356(m).  <br/><span style='padding-left: 30px'></span>The Proposed Rule ?assumes no revenues from applications for T <br/>nonimmigrant status [Form I-914], or self-petitions [Form I-360] under the Violence <br/>Against Women Act of 1994 (VAWA), ? .?  72 Fed. Reg. 4897.  The Proposed <br/>Rule would change the fee for filing Form I-914, for trafficking victims, from $270.00 <br/>to no fee.  It would also change the fee for filing Form I-360, for victims of domestic <br/>violence and Amerasians, from $190.00 to no fee.  Other I-360 filers would have to <br/>pay an application fee.<br/><span style='padding-left: 30px'></span>This Comment supports these particular innovations.  Most, if not all, T-<br/>visa applicants and VAWA self-petitioners are in circumstances that would allow <br/>for fee waivers, and by making these proposed changes, the USCIS would <br/>ultimately save time and resources that would otherwise be expended in <br/>adjudicating these fee waiver requests.  <br/><span style='padding-left: 30px'></span>Similar logic, it would seem, may apply to widows and at least some special <br/>immigrants.  Widowers and Special Immigrants who file Form I-360 will <br/>presumably be subject to paying the filing fee, and should be able to continue to <br/>apply for fee waivers, if qualified.  This Comment therefore urges that 8 C.F.R. <br/>103.7(c)(5) continue to list Form I-360 filers as being eligible to file for a waiver of <br/>fees.    <br/><br/>IV.<span style='padding-left: 30px'></span>ADJUSTMENT OF STATUS AND INTERIM BENEFITS.<br/><span style='padding-left: 30px'></span>The Proposed Rule seeks to ?merge the fees for certain applications so <br/>applicants will pay a single fee rather than paying several fees for related <br/>services.?  72 Fed. Reg. 4888.  For example, applicants for Adjustment of Status <br/>(Form I-485, current fee $325) may currently apply for interim benefits, such as <br/>employment authorization (Form I-765, current fee $180) and permission to travel <br/>abroad (Form I-131, current fee $170), while their main application is pending.  <br/>USCIS ?estimates that the current application fees paid by an applicant for <br/>adjustment of status with interim benefits over a multi-year time period are <br/>approximately $800.?  72 Fed. Reg. 4894.<br/><span style='padding-left: 30px'></span>This proposal should not be implemented for three reasons: (1) many <br/>applicants will not need these interim benefits and should not be forced to pay a <br/>built-in charge for benefits they either do not need or want;  (2) some applicants, <br/>especially pro se applicants, may become confused by automatically obtaining a <br/>travel benefit, when in fact they may be subjecting themselves to a statutory bar <br/>by traveling; and (3) assuming that EAD cards and travel documents must be <br/>issued upon payment of the blanket fee (the Applicant should get what s/he pays <br/>for) this implies a production cost incurred and a diversion of production output, <br/>whether the benefit has been actually requested by the Applicant or not.  <br/>The proposal attempts to justify the fee increase by asserting, ?when comparing <br/>the fees applicants pay today for adjustment of status and interim benefits versus <br/>the proposed single fee for adjustment of status [$905], the difference is far less <br/>significant.? 72 Fed. Reg. 4911-12.  In other words, USCIS claims that the <br/>elimination of fees for interim benefits mitigates the severity of the overall fee <br/>increase.  The claim that applicants will benefit from the consolidation of fees <br/>relies, however, on several invalid assumptions.  <br/><span style='padding-left: 30px'></span>First, numerous Adjustment of Status Applicants, including minor children, <br/>pregnant mothers, and elderly applicants, neither want nor need employment <br/>authorization and / or permission to travel.  Under the Proposed Rule, these <br/>applicants will be required to pay for interim benefits they will never use.  This calls <br/>into question the validity of USCIS?s claim that the merging of fees makes the <br/>increase less severe.  Indeed, fees for these applicants will increase by nearly <br/>300%, forcing them to pay for unnecessary or unwanted benefits, or precluding <br/>their access to USCIS services entirely.  <br/><span style='padding-left: 30px'></span>The USCIS also applies a somewhat circular argument to justify its proposed <br/>$905.00 price tag for Adjustment of Status.  If it charges the higher fee, it argues, <br/>the agency will be able to adjudicate more efficiently and faster.  However, the <br/>USCIS is already, to its credit, adjudicating most Adjustment cases within six <br/>months or less of filing.  This improved service, which can and should be <br/>maintained through appropriations, actually eliminates the need for interim benefits <br/>for most applicants.  But now, the Proposed Rule wants to build in a blanket <br/>charge, purportedly to cover interim benefits no longer needed by most applicants <br/>because of increased efficiency.<br/><span style='padding-left: 30px'></span>Whether to apply for interim benefits should remain a decision made by <br/>applicants, based on the current circumstances and needs of the applicants, not <br/>according to an automatic determination made by USCIS.  <br/>Another reason the Proposed Rule presents for merging interim benefits fees with <br/>the Adjustment of Status fee is to counteract ?perceptions of impediments to <br/>efficiency.?  72 Fed. Reg. 4894.  The Proposed Rule argues that because ?the <br/>longer cases take to adjudicate, the more total revenue is collected,? there may <br/>exist a ?perception that USCIS gains by processing cases slowly.?  Id.  The <br/>existence of alleged perceptions that the agency intentionally delays processing <br/>hardly seems a material rationale justifying such drastic and unconscionable <br/>changes.  <br/><span style='padding-left: 30px'></span>In any event, this entire rationale must fail because it is premised, again, on a <br/>flawed premise.  The Proposed Rule states, ?This change [imbedding interim <br/>benefits into the Adjustment of Status fee automatically] addresses the historic <br/>perception that because of the Congressional requirement that USCIS be self-<br/>funded from fees, USCIS may make decisions that compromise operational <br/>efficiency to ensure revenue flow.?  72 Fed. Reg. 4894.<br/><span style='padding-left: 30px'></span>As clearly established above, the USCIS has never, at any time, been under <br/>any such Congressional ?mandate? or ?requirement.?  Indeed, as established <br/>above, operational efficiency is a governmental and public objective that is <br/>exclusively amenable to Congressional appropriation.  <br/><br/>V.<span style='padding-left: 30px'></span>CONCLUSIONS.<br/><span style='padding-left: 30px'></span>Because the Proposed Rule exceeds and violates the statutory authority <br/>provided in 8 U.S.C. ? 1356 for setting and collecting IEFA special benefits fees, <br/>and misapplies OMB and FASAB guidelines, it cannot be legally adopted as a <br/>Final Rule and must be abandoned.<br/><span style='padding-left: 30px'></span>Under IEFA, the USCIS must calculate the full costs of immigration <br/>adjudication and naturalization services, surcharges, and IEFA handling costs <br/>exclusively, and may not introduce the direct and indirect costs of its <br/>governmental and public service activities in calculating these specific special <br/>benefits costs.  <br/><span style='padding-left: 30px'></span>USCIS must proactively seek and acquire Congressional appropriations to <br/>excellently sustain and upgrade its governmental operations and public service <br/>mission and mandates.<br/><span style='padding-left: 30px'></span>Congress, for its part, must fund the governmental operations and public <br/>service provisions of any federal agency it creates, including the USCIS, and must <br/>fund all needful infrastructure and operations upgrades, and public service <br/>enhancements, that it directly or indirectly mandates. <br/><span style='padding-left: 30px'></span>IEFA may properly support all VAWA self-petitions and T-visa applications <br/>through IEFA surcharges.  <br/><span style='padding-left: 30px'></span>Whether to apply for interim benefits should remain the exclusive choice of the <br/>individual Adjustment of Status Applicant and should not be automatically <br/>embedded into an inflated blanket Adjustment fee.<br/><br/>Thank you for taking this Comment under your careful consideration.<br/><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span>Respectfully submitted,<br/><br/><span style='padding-left: 30px'></span>CENTRO ROMERO, a BIA Recognized and Accredited Not-For-Profit<br/><span style='padding-left: 30px'></span>6216 North Clark Street<br/><span style='padding-left: 30px'></span>Chicago, IL 60660<br/><span style='padding-left: 30px'></span>773-508-5300<br/><span style='padding-left: 30px'></span>FAX 773-508-5399<br/><span style='padding-left: 30px'></span>f.melone@centroromero.org<br/><br/>_________________________<span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><br/>Barbara Rakley<span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><br/>Attorney at law<span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><br/>Pro Bono for CENTRO ROMERO<span style='padding-left: 30px'></span><br/><br/>_________________________<br/>Frank Melone<br/>Attorney at law, Director of Legal Services<br/>CENTRO ROMERO<br/><br/>_________________________<br/>Francisco Cardona<br/>Loyola University Student Extern<br/><br/>_________________________<br/>Christopher Street<br/>Volunteer Legal Department Intern<br/><br/>_________________________<br/>Nina Elliott<br/>Volunteer Law Student Intern<br/>John Marshall Law School<br/><br/>COPIES TO via E-Mail or Regular Mail:<br/><br/>Rep. John Conyers, Jr.<br/>Chair, House Judiciary Committee<br/>2426 Rayburn House Office Building<br/>Washington, D.C. 20515-2214<br/>john.conyers@mail.house.gov<br/><br/>Rep. Zoe Lofgren<br/>Chair, House Judiciary Subcommittee on Immigration and Border Security<br/>102 Cannon House Office Building<br/>Washington, D.C. 20515-0516<br/>www.zoelofgren.house.gov <br/> <br/>Sen. Patrick Leahy<br/>Chair, Senate Judiciary Committee<br/>433 Russell Senate Office Building<br/>Washington, D.C. 20510<br/><br/>Sen. Edward M. Kennedy<br/>Chair, Senate Judiciary Subcommittee on Immigration and Border Security<br/>317 Russell Senate Office Building<br/>Washington, D.C. 20510-2101<br/>www.kennedy.senate.gov<br/><br/>Sen. Richard J. Durbin<br/>309 Hart Senate Office Building<br/>Washington, D.C. 20510-1304<br/>www.durbin.senate.gov <br/><br/>Sen. Barack Obama<br/>713 Hart Senate Office Building<br/>Washington, D.C. 20510-1305<br/>www.obama.senate.gov <br/><br/>Rep. Janice D. Schakowsky<br/>5533 Broadway Street<br/>Chicago, IL 60640<br/><br/>Fred Tsao <br/>Attorney at law, Policy Director<br/>Illinois Coalition for Immigrant &amp; Refugee Rights<br/>ftsao@icirr.org<br/> <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021e654", "lastName": null, "legacyId": null, "modifyDate": "2007-04-03T13:39:29Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T00:38:04Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Frank Melone", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Frank Melone", "trackingNbr": "8021e654", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2700/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2700/attachments"}}}}}