{"data": {"id": "USCIS-2006-0044-0358", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0358"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "In regards to the proposed fee increase, I have to oppose to it for the following <br/>reasons; 1) the increase is not resonable, 2) the proposed amount is not affordable <br/>for most applicants, and 3) a plan can be developed to increase customer <br/>satisfaction and decrease processing time without the proposed increase. <br/><br/>First, the increase in not reasonable because it is based on the notion that <br/>applications will be processed more efficiently once more money is poured into the <br/>agency. This tactic has been employed before and it has demostrated that it was <br/>not the proper response to the problem. Therefore, the premise on which this <br/>increase <br/>is based is not resonable and therefore not a valid justification. Sencondly, in <br/>regards to applications to renew &quot;green cards&quot; and Citizenship applications, the <br/>proposed fee increases would render a vast number of individuals unable to afford <br/>to pay the amount required to process said applications. Most individuals who <br/>apply for citizenship are from a low socio-economic background, a fee such as the <br/>one proposed would place a great strain on their day-to-day budgets. While at the <br/>same time these individuals would not qualify for a fee waiver, under the current fee <br/>waiver guidelines, even though they clearly cannot afford to afront the cost involved <br/>with renewing their &quot;green cards&quot; or apply for citizenship. Lastly, an efficient <br/>system can and should be developed without placing a greater burden on <br/>applicants. I personally believe that the inefficiency of the Department of Homelad <br/>Security is due to lack of training of staff, overcompensation of certain personnel, <br/>and greater responsibility as a result of the September 11, 2001 attacks (9/11). <br/>The solutions for these problems would be to provide adequate training to ALL <br/>personnel and instill a genuine desire to provide GREAT customer service, <br/>cutbacks on salaries which are not justified, and application for bonds or grants, <br/>etc. that can be applied to specific duties that need to be carried out because of <br/>9/11. <br/><br/>These fees are not justified by cogent reasons, they are unaffordable, and <br/>unnecessary. It is my desire to see this agency truly serve the people it claims to <br/>serve, the first step would be by not alienating applicants with these proposed fee <br/>increases.    <br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020583e", "lastName": null, "legacyId": null, "modifyDate": "2007-02-14T18:45:59Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-14T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-14T00:51:44Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Sandra F. Celedon", "trackingNbr": "8020583e", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0358/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0358/attachments"}}}}}