{"data": {"id": "USCIS-2006-0044-0836", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0836"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am writing to strongly oppose the increase to immigration and naturalization<br/>fees that US Citizenship and Immigration Services (USCIS) proposed on February<br/>1, 2007.<br/><br/>The proposed fee for naturalization is very frustrating.  As recently as 1998,<br/>the cost to apply for citizenship was $95.  In 2002, after the Bush<br/>Administration took office, the costs (including biometric fees) went up from<br/>$250 to $310.  The total fees are now $400, a fourfold increase in the past<br/>eight years.  Now USCIS is proposing a further increase of 70%, to $675.  An<br/>immigrant working at a minimum-wage job would need to work for more than three<br/>weeks and save all of his earnings in order to pay this fee.<br/><br/>Even more startling is the proposed cost of filing for adjustment of status,<br/>which for many immigrants is the first step on the road leading to US<br/>citizenship.  That application has risen from $130 in 1998 to $325 today, plus<br/>$75 for biometrics.   Under the proposed rule, the price will rise to $905 plus<br/>$80 for biometrics.  In other words, it will cost nearly $1,000 for an immigrant<br/>to get a green card and start the five-year countdown to citizenship.  A<br/>minimum-wage immigrant worker would need to save a full month?s pay to afford<br/>the proposed fee.<br/>.<br/>USCIS claims that the fee increase is necessary to improve service.  USCIS<br/>definitely needs to improve service, as shown by the continuing backlogs in<br/>application processing and the months-long (even years-long) delays caused by<br/>security checks.  Last October, the Government Accountability Office reported<br/>that the agency had lost track of 110,000 files needed to process citizenship<br/>cases.  [add local service horror stories here]  We applaud USCIS?s efforts to<br/>improve service.  We nevertheless believe that the burden of paying for such<br/>improvements should not rest solely with immigrants who are already struggling<br/>to pay agency costs and receiving poor service.  <br/><br/>USCIS also argues that it has no other option than raising fees if it wants to<br/>cover its costs.  In fact, there are no laws that require USCIS to fund all of<br/>its operations through fees.  Nothing prevents USCIS from pursuing other sources<br/>of revenue, including asking Congress for appropriations.  Indeed, USCIS has<br/>sought and received Congressional funding several times in the past<br/><br/>Most basically, immigration and citizenship are public goods that benefit our<br/>entire country and that we as a nation should help pay for.  Immigrants bring<br/>their talent and hard work to our economy.  They pay taxes and help revitalize<br/>our communities.  In becoming citizens, immigrants demonstrate their strong<br/>commitment to their new home country by learning English, gaining knowledge<br/>about American history and government, and swearing allegiance to the United<br/>States.  It is little wonder that newly naturalized citizens, eager to<br/>participate in our democracy, consistently vote at higher rates than other<br/>citizens.  We should be encouraging immigrants to become part of our community<br/>by gaining legal status and becoming citizens, not setting up barriers that<br/>block their path and keep them out.  <br/><br/>For all these reasons, the proposal to increase immigration fees is misguided<br/>and counterproductive.  We urge USCIS to reconsider this proposal, and to seek<br/>other sources of funding for its operations, rather than add more burdens on<br/>immigrants.  Thank you for your consideration.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020a992", "lastName": null, "legacyId": null, "modifyDate": "2007-02-23T19:05:57Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-23T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-22T20:20:38Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Juan J. Gonzalez, Illinois Coalition for Immigrant and Refugee Rights", "trackingNbr": "8020a992", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0836/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0836/attachments"}}}}}