{"data": {"id": "USCIS-2006-0044-2489", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2489"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Dear Sir/Madam,<br/><br/>I am writing to strongly oppose the increase to immigration and naturalization fees <br/>that US Citizenship and Immigration Services (USCIS) proposed on February 1, <br/>2007.  The proposed increase in the Form I-485 filing fee will be financially <br/>burdensome to me and many others like me.  This is an increase from $325 to <br/>$905 that is almost 3 times!!!<br/><br/>Reading your notes I understand that I-485 would include both the I-765 and I-131 <br/>Forms.  I think that this is not needed for many people who are, like me, already <br/>inside the USA with a valid work visa that allows them both to travel abroad and <br/>work.    Therefore I strongly oppose this increase and the amalgamation of the 3 <br/>forms into one form.<br/><br/>USCIS argues that it has no other option than raising fees if it wants to cover its <br/>costs.  In fact, there are no laws that require USCIS to fund all of its operations <br/>through fees.  Nothing prevents USCIS from pursuing other sources of revenue, <br/>including asking Congress for appropriations.  Indeed, USCIS has sought and <br/>received Congressional funding several times in the past.  In such case the burden <br/>of paying for these improvements would not rest solely with immigrants who are <br/>already struggling to pay agency costs and receiving poor service.  <br/><br/>Most basically, immigration and citizenship are public goods that benefit our <br/>entire country and that we as a nation should help pay for.  Immigrants bring their <br/>talent and hard work to our economy.  They pay taxes and help revitalize our <br/>communities.  In becoming citizens, immigrants demonstrate their strong <br/>commitment to their new home country by learning English, gaining knowledge <br/>about American history and government, and swearing allegiance to the United <br/>States.  It is little wonder that newly naturalized citizens, eager to participate in <br/>our democracy, consistently vote at higher rates than other citizens.  We should <br/>be encouraging immigrants to become part of our community by gaining legal <br/>status and becoming citizens, not setting up barriers that block their path and <br/>keep them out.  <br/><br/>For all these reasons, the proposal to increase immigration fees is misguided and <br/>counterproductive.  I urge USCIS to reconsider this proposal, and to seek other <br/>sources of funding for its operations, rather than add more burdens on immigrants. <br/><br/>I am grateful for the opportunity to comment on this proposed fee increase.   <br/><br/>Thank you for your consideration.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021d9dc", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:17:47Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T06:36:13Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Anonymous", "trackingNbr": "8021d9dc", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2489/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2489/attachments"}}}}}