{"data": {"id": "USCIS-2006-0044-0979", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0979"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "The size of the increase proposed by USCIS is both unreasonable and <br/>unwarranted by the performance of the Service.  The Service claims repeatedly <br/>that they have eliminated their backlog, and achieved six month processing times <br/>on most cases - both of these claims are demonstrably false.  To use either of <br/>these claims to justify higher fees perpetrates a lie to Congress and to the <br/>petitioners and applicants who must go to the Service to obtain benefits.<br/><br/>The Service &quot;eliminated&quot; several million pending I-130 applications from their <br/>backlog not by adjudicating these files, but by removing any I-130 that was not <br/>current from their backlog count.  These I-130s all must still be adjudicated, but <br/>the Service conveninently pretends that this day will never come - meanwhile, <br/>more I-130s continue to be filed, and the size of this phantom backlog climbs <br/>higher.  In addition, the Service removes from their backlog count any petition or <br/>application that is on hold due to security checks or background checks.  <br/>Thousands of cases have delayed background checks, and this number only gets <br/>larger over time.  The Service should be required to include all pending cases in <br/>their backlog count, and not manipulate this data to justify the fee increases.<br/><br/>The Service claims that it is processing cases in 6 months, yet thousands of <br/>applicants for green cards and for naturalization know that their real processing <br/>time for cases is 2, 3, 4 years or more.  There is no sanction on the Service if it <br/>does not meet its promised 6 month processing &quot;goal&quot;, and only those applicants <br/>who have had the resources and the courage to sue the Service for action have <br/>been able to find any meaningful way out of long-delayed background check <br/>limbo.  Before demanding more fees from new applications, the Service should be <br/>required to clear all pending applications that have been on hold for one year <br/>solely due to a delayed background check from the Federal Bureau of <br/>Investigations (FBI).  If the background check cannot be cleared, the Service <br/>should be required to explicitly advise the applicants when this will be resolved.  <br/><br/>More importantly, the Service&#39;s justification that higher fees are necessary to <br/>cover the costs of security and background checks is unfair and unreasonable to <br/>pass on to applicants.  While security issues are understandably greater now, <br/>these are not part of the benefit that applicants are requesting.  To the contrary, <br/>the background checks are a national concern and an administrative cost that <br/>must be covered by Congress.  The Service requires cases to pend for years while <br/>their background checks languish at the Service and the FBI, yet we allow most of <br/>these applicants and beneficiaries to live and work in the U.S. while their cases <br/>are in process - either these individuals are not a threat to security, or the Service <br/>and the FBI are willing to gamble that they are a threat, but they won&#39;t do any <br/>damage while they wait for the cases to be processed.<br/><br/>Appropriate inflationary increases in fees are one thing, but the size of this <br/>increase is ecessive and in appropriate - the Service will lock out millions of <br/>applicants for naturalization and other benefits who cannot afford the new fees.  <br/>We will have to revise Emma Lazarus&#39;s words accordingly:  &quot;Give me your tired, <br/>your rich, your huddled masses yearning to breathe free.&quot;  The Service&#39;s new fee <br/>schedule is a perversion of the long-standing tradition of welcoming the immigrant, <br/>and not using fees and other costs to lock out the poor who would come to the <br/>U.S. to find their fortune and their future.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020c698", "lastName": null, "legacyId": null, "modifyDate": "2007-03-01T21:13:12Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-01T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-28T20:26:05Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Grace Hoppin", "trackingNbr": "8020c698", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0979/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0979/attachments"}}}}}