{"data": {"id": "USCIS-2006-0044-2514", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2514"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "In the United States we are given certain rights. One of those rights is the right to <br/>choose how our families will be started. There are many of us who do not have the <br/>privilege of giving birth to children. For those of us in this category, we are given <br/>the opportunity to give a home to a child who does not have one. It is our right to <br/>choose where we adopt a child from. Many of us, my husband and I included, <br/>have chosen to give a home to children of other countries. Our decision to do this <br/>was because we believe children in the U.S. (even those from poorer homes) have <br/>so many more opportunities than children in other countries. Currently, a <br/>proposed law is being considered that would make this adoption process more <br/>costly and difficult. <br/><br/>Our adoption process has taken much longer than expected. There are many <br/>families in the same situation as we are. Many countries around the world are <br/>receiving more and more applications for adoption, therefore increasing the wait <br/>times. If lawmakers would take the time to do some research, they would see that <br/>the length of time for international adoptions has increased greatly over the last <br/>two years. My husband and I began our adoption process in 2005, but because of <br/>my husband&#39;s unemployment, our process was halted for several months. We <br/>filed our Petition (I-600A) form in October of 2005. Our fingerprints were completed <br/>in April of 2005. Because of the length of time we have been waiting for a referral, <br/>we have already had to renew our fingerprints and refile our Petition. Our current <br/>fingerprints will expire in September. Already, we have spent $1,350 in processing <br/>fees. There is a possibility we will need to be fingerprinted a third time. We are <br/>praying that we do not need to refile our Petition a third time. <br/><br/>It is concerning to me that lawmakers are considering a fee increase. And a large <br/>increase at that. This makes things very difficult for those of us who cannot control <br/>the long wait we are experiencing. There is nothing we can do but wait for these <br/>countries to find the child that is meant to be with our families. The fees <br/>associated with this process are frustrating, especially for those of us who cannot <br/>have biological children. Adoption is the only way we can have children. And we <br/>feel punished for choosing international adoption. But that should not be. We have <br/>the right to choose. That is what freedom is all about. Prospective adoptive <br/>parents everywhere are requesting that these processing fees not be increased. <br/>We already pay enough. If the proposed increase is approved, then I ask that you <br/>please consider extending the length of time that the biometrics and I-600A <br/>petition are valid for. I ask that the lawmakers enlist the help of the necessary <br/>agencies in determining an appropriate length of time to make these valid for. The <br/>research to find out how long (on average) families are waiting on adoptions from <br/>other countries is out there. The length of time that the I-600A and biometrics are <br/>valid for could be based on this average time. Please do not make these decisions <br/>without being informed of the current trends in international adoption. Thank you <br/>for your consideration.<br/><br/>Sincerely,<br/><br/>April <br/>A Waiting Adoptive Parent<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021dbb8", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:19:34Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T13:15:07Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by April", "trackingNbr": "8021dbb8", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2514/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2514/attachments"}}}}}