{"data": {"id": "USCIS-2006-0044-0025", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0025"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I applaud the INS for proposing to raise the permanent resident status and <br/>citzenship fees.    <br/>The INS is an important organization and whatever it takes to do their jobs <br/>properly and efficiently is important.  The cost for these services or improvements <br/>should be passed on to all entering immigrants who make use of this service to <br/>resettle in this country.    No one forced any immigrant to come to this country.  <br/>Theose who come here, make that choice to immigrate here freely of their own will <br/>and desire.    We shouldn&#39;t fool ourselves into thinking that pity should be taken <br/>upon them, because many of these new immigrants were far better off financially <br/>in in their own countries before immigrating than many middle-class Americans <br/>already living here.<span style='padding-left: 30px'></span><br/>The increased fees  for permanent resident fees or citizenship fees should <br/>rightfully be paid by these new immigrants coming to America.    Americans <br/>would face the same types of regulations if they were to immigrate to a foreign <br/>land and resettle elsewhere.   There should be no exceptions to this rule.  <br/>Everyone has to pay their fair share when they immigrate here.  <br/>The increased fees for permanent residence and citizenship must be paid by the <br/>new immigrants, because they are the ones benefiting from these fees.   US born <br/>citizens and taxpayers MUST NOT pay for these services - it would be a terrible <br/>injustice and burden to put on the backs of US born taxpayers.    The new <br/>immigrants must pay for the right and privilege to be here - if that is what they <br/>wish to do.  <br/>Also, our country is becoming increasing over populated.  The increased fees may <br/>also help to act as a deterrant to some &quot;fly by night&quot; illegals or other immigrants <br/>or criminal elements, who are not serious about US citizenship and US laws - and <br/>abuse the US.    I am speaking about those immigrants who fly back and forth <br/>between their native countries (several times a year - they have the money to do <br/>so!!) and only use the resources of this country for their own personal gain .  The <br/>increased immigration fees help to send a serious message to new immigrants <br/>that this land and its laws must be respected and permanent residency and <br/>citizenship status CANNOT be taken for granted.  <br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801f9846", "lastName": null, "legacyId": null, "modifyDate": "2007-02-01T19:20:36Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-01T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-01T18:42:36Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By S. Baldev", "trackingNbr": "801f9846", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0025/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0025/attachments"}}}}}