{"data": {"id": "USCIS-2006-0044-2039", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2039"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "This letter is in opposition to the proposed fee increases for the I-600/600A orphan <br/>petitions required of adoptive families. Fees have already increased substantially <br/>and I do not feel the need for this additional increase is validated. <br/><br/>-cost of an I600/I600A petition has already increased from $75 to $545.<br/>-cost of biometric fingerprinting has already increased from $25 to $70 per <br/>applicant.<br/><br/>For a two-parent family adopting a single child, the USCIS process costs an <br/>upward of $685. <br/><br/>Because of the instability concurrent with international adoption, many families <br/>find that their USCIS approval expires prior to their invitation to travel to their <br/>prospective child?s birth country. As a result, many families find themselves <br/>repeating the entire immigration application two ($1,370), or even three ($2,055) <br/>times. This can increase the cost of an adoption by thousands of dollars ? money <br/>many of us simply do not have. <br/><br/>In this request for an increase in fees, USCIS is not asking for what it needs - it is <br/>asking for what it wants. It claims that this fee increase ?is designed to provide for <br/>an adequate and sustainable level of investment in staff, in infrastructure, and <br/>processes designed to improve the USCIS? ability to administer the nation?s <br/>immigration laws.? The Bureau justifies these increases by asserting that ?this fee <br/>rule would provide the necessary resources to maintain these processing time <br/>standards and fund further improvements to USCIS business operations to <br/>continue to reduce processing times while ensuring the appropriate level of <br/>security.?<br/><br/>There are very few infants infiltrating Al-Qaeda. The idea that adoptive parents are <br/>a threat to national security is laughable. While I agree with the aims of the <br/>Department of Homeland Security, the additional levels of scrutiny on orphaned <br/>children and their prospective parents is absurd. <br/><br/>While the aims of the department are laudable (reducing identity fraud, improving <br/>service, changing benefit applications from paper to electronic means in order to <br/>streamline the process) forcing adoptive parents to bear the burden of these goals <br/>is unconscionable. Worse still, many of USCIS? stated aims do not directly benefit <br/>the orphaned children seeking adoption. <br/><br/>Many adoptive families have been through years of infertility and loss, and have <br/>mortgaged homes and depleted life savings to live the American dream by having <br/>a family, by bring home a child. Increasing the financial burden on adoptive <br/>parents is not simply unfair and potentially detrimental to the lives of waiting <br/>children. The increase in fees is money that is taken away from the families, that <br/>could be better spent on the children ? once they are home.<br/><br/>I ask that you:<br/>?Reject the current fee increase proposal <br/>?Give first priority to I-600/600A applications, <br/>?Consolidate the paperwork required for orphan petitions,<br/>?Extend the expiration of the I-171H from eighteen months to three years.<br/><br/>Thank you<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021b747", "lastName": null, "legacyId": null, "modifyDate": "2007-03-29T19:27:30Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-28T21:51:52Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Anonymous", "trackingNbr": "8021b747", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2039/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2039/attachments"}}}}}