{"data": {"id": "USCIS-2006-0044-2252", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2252"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I disagree with the proposal to increase the fees for international adoption while <br/>not increase how long the I-797 or fingerprints are good for.<br/><br/>My question is who are trying to protect and serve?  Is it the intention of the <br/>federal government to protect me from a 6 month orphaned child?   <br/><br/>I spent many years and alot of money trying to conceive a child, only to have my <br/>dreams end with miscarriage and an increase of insurance.   Now, to complete an <br/>adoption, the government is now telling me that they need to raise the fees so <br/>childless couples have to pay more money to our government to protect us from <br/>identify issues of an infant.   <br/><br/>Do our representative realize that the majority of international adoptive parents are <br/>not famous, rich actors like Angelina Jolie but middle class working couple that <br/>have medicore health insurance, a home mortgage, and small amount of savings  <br/>to fund adoption.   To fund my adoption, I completely stripped the equity in my <br/>home, lost money from missed work, and liquidated my husband&#39;s IRA.   At the <br/>very last minutes, my fingerprints expired (of course the prints expire but not the <br/>approval - this is assinine)   At the very end of the long journey to have to pay <br/>more to our government, is so wrong and unfair to these.<br/><br/>How would each and everyone of our representatives feel if they made less than <br/>$70 thousand per year and have to pay more than $35 thousand to adopt a child <br/>international...and then OUR GOVERNMENT wants us to pay MORE or same fee <br/>multiple times while providing the worst customer service in the United States?<br/><br/>If our government was really working for us, it would place petitions of USA citizen <br/>adoptive parents in a special category.  Reduced fees or scaled based, extended <br/>how long the approval is valid for and eliminate the fee for finger-prints redo.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021c606", "lastName": null, "legacyId": null, "modifyDate": "2007-03-30T16:57:32Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-30T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-30T00:48:58Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Patricia Andrulot", "trackingNbr": "8021c606", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2252/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2252/attachments"}}}}}