{"data": {"id": "USCIS-2006-0044-2783", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2783"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "April 2, 2007<br/><br/>Director, Regulatory Management Division<br/>U.S. Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Avenue, NW., 3rd Floor<br/>Washington, DC 20529<br/><br/>Re: Proposed Adjustment of the Immigration and Naturalization <br/>Benefit Application and Petition Fee Schedule, DHS Docket Number <br/>USCIS?2006?0044<br/><br/>To Whom It May Concern:<br/><br/>This letter is in opposition to the proposed fee increases for the I-<br/>600/600A orphan petitions required of adoptive families. <br/><br/>In 1989, the cost of an I600/I600A petition was $75. Today the exact <br/>same form costs a prospective adoptive parent $545. Biometric <br/>fingerprinting, which began in 1998, has risen in cost from $25 to <br/>$70 per applicant. For a two-parent family adopting a single child, <br/>the USCIS process costs an upward of $685. Because of the <br/>instability concurrent with international adoption, many families <br/>find that their USCIS approval expires prior to their invitation to <br/>travel to their prospective child&#39;s birth country. As a result, many <br/>families (especially those adopting from China and Guatemala) find <br/>themselves repeating the entire immigration application two or three <br/>times. This can increase the cost of an adoption by thousands of <br/>dollars ? money many of us simply do not have. <br/><br/>The department admits that it has a dismal track record in <br/>processing applications and with its customer service. Processing <br/>throughout the regional offices is erratic ? some I-600A <br/>applications take months to process, while individuals in other <br/>districts received approval of the exact same form within ten days. <br/>The refusal of officials to give adoptive parents priority results <br/>in children languishing in orphanages or foster care overseas for <br/>months and months at a time. Most egregious is that the processing <br/>time for immigrant workers (I-140) and employment authorization (I-<br/>765) are less (average of 3.31 and 1.97 months, respectively) than <br/>that to bring home an orphaned child (3.39 months). There is no <br/>explanation for why USCIS finds it possible to process the projected <br/>859,543 I-765 and 129,743 I-140 applicants faster than the 29,260 I-<br/>600/600A applicants. <br/><br/>Why are children seeking to immigrate to the U.S. given greater <br/>scrutiny than adult foreign workers?<br/><br/>Adoptive parents attempting to learn the status of their petition <br/>are met with deaf ears and directed to a &quot;status&quot; website which is <br/>not updated. As a result of USCIS&#39; refusal to prioritize orphan <br/>petitions, thousands of children suffer needlessly. There has been <br/>no move by USCIS to assist prospective adoptive parents whose <br/>documents &quot;expire&quot; while they wait for their child&#39;s home country to <br/>grant them approval to travel. These parents are forced to reapply <br/>with USCIS, repaying the same exorbitant fees two and sometimes <br/>three additional times, each time subjecting themselves to the same <br/>long and uncertain wait for immigration approval. If USCIS would <br/>simply extend the &quot;expiration&quot; deadline for the I-171H from eighteen <br/>months to three years, it would significantly reduce its workload <br/>without having to increase its fees.<br/><br/>In this request for an increase in fees, USCIS is not asking for <br/>what it needs, it is asking for what it wants. It claims that this <br/>fee increase &quot;is designed to provide for an adequate and sustainable <br/>level of investment in staff, in infrastructure, and processes <br/>designed to improve the USCIS&#39; ability to administer the nation&#39;s <br/>immigration laws.&quot; The Bureau justifies these increases by asserting <br/>that &quot;this fee rule would provide the necessary resources to <br/>maintain these processing time standards and fund further <br/>improvements to USCIS business operations to continue to reduce <br/>processing times while ensuring the appropriate level of security.&quot;<br/><br/>There are very few infants infiltrating Al-Qaeda. The idea that <br/>adoptive parents are a threat to national security is laughable. <br/>While we agree with the aims of the Department of Homeland Security, <br/>the additional levels of scrutiny on orphaned children and their <br/>prospective parents is absurd. <br/><br/>While the aims of the department are laudable (reducing identity <br/>fraud, improving service, changing benefit applications from paper <br/>to electronic means in order to streamline the process) forcing <br/>adoptive parents to bear the burden of these goals is <br/>unconscionable. Worse still, many of USCIS&#39; stated aims do not <br/>directly benefit those seeking to immigrate. <br/><br/>Many adoptive families have been through years of infertility and <br/>loss, and are mortgaging our homes and cleaning out our life savings <br/>to bring home a child. Increasing the burden on us is not simply <br/>unfair, it is detrimental to the lives of waiting children. We urge <br/>rejection of the current proposal and a new requirement that USCIS <br/>reduce the fee burden on adoptive families, give first priority to I-<br/>600/600A applications, consolidate the paperwork required for orphan <br/>petitions, and extend the &quot;expiration&quot; of the I-171H from eighteen <br/>months to three years.<br/><br/>Sincerely,<br/><br/>Catherine A Durkin-Herrin<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021ede0", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:01:16Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T16:44:12Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Catherine Durkin-Herrin", "trackingNbr": "8021ede0", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2783/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2783/attachments"}}}}}