{"data": {"id": "USCIS-2006-0044-0615", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0615"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "The memorandum is not that clear. Why the applicant needs to pay for services <br/>that they do not want. Not all the applicants are eligible for an advance parole, <br/>more over not all want an employment authorization.  THERE IS NO NEED THAT <br/>YOU INCREASE YOUR FEES TO IMPROVE YOUR SERVICE. The USCIS is <br/>providing the most terrible consumer service in the planet. How they can send the <br/>notices of action or employment card or green card REGULAR MAIL. They should <br/>send it priority mail with delivery confirmation and that information should appear <br/>in a site that the applicant will know what address they use to send the <br/>correspondence. I have seen so many times the USCIS sending correspondence <br/>to WRONG ADDRESSES. They really do not care about the applicants. The <br/>applicants have to pay the price of the USCIS?s mistake by paying the Motion to <br/>Reopen the case just because they are so afraid that the USCIS might close their <br/>case. <br/>In addition, why couples with kids born during their marriage need to go through <br/>an interview. It is ridiculous because they do not need to prove that they got <br/>married under a bonafide relationship when they have kids together. I notice that <br/>now at least parents of US citizen are getting the residency without interview. <br/>WHAT A GOAL!<br/>Also, talking about NATURALIZATION PROCESS why the applicant has to pay <br/>so much money just because the USCIS needs to pay for the rent of the <br/>auditorium where the ceremony will take place. It should be optional if you want to <br/>attend to the ceremony, you should pay extra and the ones that do not want to <br/>attend the ceremony they take the oath after the interview.  Another comment, the <br/>new site is now more confused. I missed the old one who had more organize the <br/>information.   <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480208146", "lastName": null, "legacyId": null, "modifyDate": "2007-02-20T18:25:18Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-20T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-16T04:43:18Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By L. S.", "trackingNbr": "80208146", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0615/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0615/attachments"}}}}}