{"data": {"id": "USCIS-2006-0044-2829", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2829"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I respectfully write regarding the U.S. Bureau of Citizenship and Immigration<br/>Services? proposed rule to increase immigration fees (72FR USCIS<br/>2006-0044-0001).  While I understand there is a significant backlog of<br/>applications, I am concerned that the proposed fee increase will place a greater<br/>financial burden on immigrants trying to become citizens of the United States.<br/><br/>Our country was founded by immigrants, and immigrants from around the world<br/>continue to make our nation rich with culture, heritage and tradition.  The<br/>process through which they apply for citizenship should be both fair and<br/>expeditious.  To achieve this goal, we must reduce the excessive backlogs and<br/>delays that immigrants continue to face.  However, we should not do so in a way<br/>that makes achieving legal status simply unaffordable for many immigrant families.  <br/><br/>On average, the proposed fee increase would raise application fees by 96<br/>percent.  Rather than spreading this increase out over a period of time, it<br/>would go into effect all at once, placing a significant financial strain on<br/>applicants. The fee for naturalization applications alone would rise by 80<br/>percent, while other application packages, such as the adjustment of status<br/>package, the petition to sponsor relatives, and the fianc? petition, would also<br/>be increased.  Each of these increases could present a hardship for members of<br/>immigrant communities, which could place our already fragile immigration system<br/>under even greater strain.<span style='padding-left: 30px'></span><br/><br/>I am also concerned that by increasing application fees, CIS will send the wrong<br/>message to those attempting to comply with the legal process in good faith.  By<br/>making compliance more difficult for struggling families to afford, we risk<br/>discouraging legal immigration while driving people to find alternative ways to<br/>come to the United States illegally.  In its report, the 9/11 Commission stated<br/>that the services provided by U.S. immigration officials are a crucial element<br/>to our national security.  It is vital to our homeland security efforts to keep<br/>detailed records on who is crossing our borders.  Therefore, we must do<br/>everything possible to encourage adherence to our immigration laws, and to this<br/>end, the affordability of application fees must be maintained.<br/><br/>I fully support efforts made by the Bureau of Citizenship and Immigration<br/>Services to reduce excessive backlogs application delays.  In doing so, however,<br/>it is critical that the agency preserve the affordability of following proper<br/>immigration procedures.  I appreciate the opportunity to submit comments on this<br/>proposed rule.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021ef9a", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:04:43Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T19:37:19Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by James Langevin", "trackingNbr": "8021ef9a", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [{"id": "0900006480dff8db", "type": "attachments"}], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2829/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2829/attachments"}}}}, "included": [{"id": "0900006480dff8db", "type": "attachments", "links": {"self": "https://api.regulations.gov/v4/attachments/0900006480dff8db"}, "attributes": {"agencyNote": null, "authors": null, "docAbstract": null, "docOrder": 1, "fileFormats": [{"fileUrl": "https://downloads.regulations.gov/USCIS-2006-0044-2829/attachment_1.pdf", "format": "pdf", "size": 67176}], "modifyDate": "2007-04-03T21:04:44Z", "publication": null, "restrictReason": null, "restrictReasonType": null, "title": "Comment Submitted by James Langevin, United States Congress (Attachment)"}}]}