{"data": {"id": "USCIS-2006-0044-2704", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2704"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am writing to express my concern regarding the proposed increase in the fees<br/>for the I600A application.  As an adoptive parent I have twice gone through the<br/>I600A application  to adopt a child from China with USCIS in Miami in the past<br/>couple of years.  <br/><br/>While I understand that the fees we pay toward our application are used for<br/>other services offered by USCIS, I am disappointed that prospective adoptive<br/>parents (especially those adopting from China) are going to suffer yet another<br/>financial hurdle.  Since the process time-lines from China have increased to<br/>over 18 months, families are now being asked to incur the I600A fees twice prior<br/>to being united with their child.  At the proposed rate increase this would mean<br/>an average cost of $1660 against the present $685, an increase of 140%!!! This<br/>is unreasonable and penalizes prospective adoptive parents and their children. <br/>Do we really want to keep children from their parents?  Shouldn&#39;t the government<br/>try to assist those who want to make a positive difference in the society? <br/>There are many people in the country who make no attempt to  live by society&#39;s<br/>rules,but yet again it it those who are law-abiding and honest that suffer.<br/><br/>Since the level of service for families has not improved and has even in most<br/>cases become even more difficult and stressful, added to the fact that the INS<br/>officers who are responsible for issuing the 171H have in effect doubled their<br/>workload, (due to the 18 month expiry and subsequent re-application) it seems<br/>hard to justify yet another increase in fees.  <br/><br/>While I understand that the fees will increase no matter what my personal<br/>opinion, I would like to voice my concern and support of all future adoptive<br/>parents and request that the increase be shelved or better yet that the 171H<br/>expiration period be extended for adoptive parents to accommodate the new longer<br/>time-frames.  This would also cut down the work of the officers who would not<br/>have to deal with multiple applications for the same child.<br/><br/>Respectfully,<br/>Kim Choi<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021e673", "lastName": null, "legacyId": null, "modifyDate": "2007-04-03T13:39:35Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T00:54:57Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Kim Choi", "trackingNbr": "8021e673", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2704/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2704/attachments"}}}}}