{"data": {"id": "USCIS-2006-0044-0115", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0115"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I just read about the proposed fee increases for immigration services.  I find<br/>that this is a terrible abuse of a government agency&#39;s authority.  We claim to<br/>be a welcoming nation.  We claim also that we want people to abide by the rules<br/>when immigrating to the United States.  Yet someone wants to make sure that<br/>neither of these things are actually true.  By raising the fees the message is<br/>being sent that the doors are closing.  If people want to come here they are<br/>going to have to do desperate things.  Isn&#39;t the situation desperate enough already?<br/><br/>I also have a further concern, namely the thousands of intercountry adoptive<br/>families that form and expand each year.  Having read this proposal, it sounds<br/>very much as if the Department of Homeland Security is going to fund its other<br/>missions by saddling adoptive families with additional costs.  How many families<br/>will remain incomplete, how many children will continue to languish in<br/>orphanages, all because this massive fee increase is the straw that breaks the<br/>camel&#39;s back?  Worse, this applies also to children who have arrived home,<br/>apparently, as there is also a proposed increase for the Certificate of<br/>Citizenship.  Federal law CLEARLY states that adopted children are citizens as<br/>soon as their adoptions are finalized.  The Department of Homeland Security is<br/>already taking terrible advantage of adoptive families by charging a fee for a<br/>document to which families already have the right.  Raising this fee only<br/>exacerbates the problem.<br/><br/>Finally, what about those people who marry overseas legitimately, or those<br/>immigrant families who are already here legally and have valid reasons for<br/>wanting to bring family members here as well?  Are they too going to be subject<br/>to these massively unfair provisions?<br/><br/>In short, those who have proposed such a radical increase should be ashamed of<br/>themselves.  A moderate increase would be bad enough, but perhaps<br/>understandable.  The size of the proposed increase is unconscionable and needs<br/>to be adjusted now.<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801fa0fc", "lastName": null, "legacyId": null, "modifyDate": "2007-02-02T18:25:06Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-02T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-02T16:51:59Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Laura Dennis-Bay", "trackingNbr": "801fa0fc", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0115/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0115/attachments"}}}}}