{"data": {"id": "USCIS-2006-0044-0174", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0174"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Adjustment of the Immigration and Naturalization Benefit Application and<br/>Petition Fee Schedule<br/><br/>I am the mother of 3 children adopted from Korea.  I would like to address the<br/>N-600 fee and forms for the Certificate of Citizenship, as it pertains to<br/>adopted children who entered the United States on IR4 visas.  <br/><br/>First, I do not feel there should be a need for an increase in the N-600 filing<br/>fee in the case of IR4&#39;s. the reason being that these families have already<br/>submitted all necessary documents for establishing our (the adoptive parents)<br/>citizenship when we filed the I-600 A/I-600 form for the advance processing of<br/>an overseas adoption.   There should be no reason for 15 pages of re-submittal<br/>and re-investigation of these files in order to obtain a COC on behalf of our<br/>children.  It is a waste of our governments time, money, and paper, not to<br/>mention the adoptive parents&#39;.  I thought the goal was to eliminate waste in the<br/>federal government?  <br/><br/>We need to have some equality as it is not fair for families who adopt from<br/>non-ally countries to receive FREE government services in the case of IR3<br/>families receiving COC&#39;s on behalf of their children within 45 days of entry<br/>with absolutely no paperwork required. <br/><br/>IR4 families, many who have adopted from South Korea ( an United States ALLY!),<br/>are required to spend extra time and money to mostly duplicate the I600A and<br/>send in our state issued adoption decree.  <br/><br/>There needs to be a simplified form N-600 for IR4 families!  It should only<br/>require a one page form along with our submittal of a state issued adoption<br/>decree.  There is no need for USCIS to spend countless hours re-investigating<br/>what has already been done.  Just pull up the families I600, see that they had<br/>I171-H approval to bring their child home, see that they have submitted their<br/>official state issued final adoption decree, then issue the COC.  Quite simple<br/>really...why make it so hard on everyone involved with the current system.  <br/><br/>Another problem with the current system is that families are required to appear<br/>in person  at the USCIS office.  More NEEDLESS burden on the government agency<br/>and the adoptive family as we have already appeared in person as part of the<br/>I600-A advanced processing of an overseas adoption and for our the biometrics<br/>submission. <br/><br/>Please consider addressing this issue, it should have been addressed before the<br/>Child Citizenship Act of 2000 was put into effect on February 27, 2002.  <br/><br/>Thank you for your time and consideration of these issues.<br/><br/>Sincerely, <br/>Lisa Spinner, on behalf of my Korean born children Brandon, Matthew, and Sophia<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801fa654", "lastName": null, "legacyId": null, "modifyDate": "2007-02-05T18:55:37Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-05T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-05T17:29:46Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Lisa A. Spinner", "trackingNbr": "801fa654", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0174/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0174/attachments"}}}}}