{"data": {"id": "USCIS-2006-0044-0705", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0705"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am appalled that the government is considering raising the fees yet again for<br/>the I-600 applications for adoptive parents. Foreign adoptions are already very<br/>expensive and it is becoming affordable only the the wealthy. We have adopted<br/>three children internationally in 2002, 2004 and 2006. Each time we submitted an<br/>application the fees increased and so did our wait time. The last time was the<br/>longest and it was for a special needs child. Instead of raising the prices and<br/>throwing money at the issue the UCICS needs to take a look at their own<br/>inefficiencies in administration of the process for I-600s. There is a huge<br/>disparity in the treatment of adoptive parents across the country depending on<br/>which office one is forced to use. Our designated office in San Antonio started<br/>out OK back in 2002 and has turned into a nightmare with a bullish orphan<br/>officer the last few years. Now they are just completley inefficient. Why is is<br/>that the government thinks that charging more money will help them increaes<br/>their productiveness. It hasn&#39;t happened yet and I don&#39;t expect anything to<br/>change by raising the fees another $100. What would make it more efficient is to<br/>draw on best practices from the local agencies that are doing it right, create<br/>some consistency and for goodness sake and make the approval last longer so that<br/>people don&#39;t have to re-file before they even get a referral for an adoption.<br/>This would save a lot of the backlog for the orphan officers. It would also be<br/>nice if there was an expedited process for those families adopting special needs<br/>children so that these kids needing medical attention are not needlessly<br/>languishing in orphanages becuase a family cannot get an I-171 back in a<br/>reasonable length of time. Please do something to fix this process and do not<br/>raise the prices on already financially strained families trying to make a<br/>family via adoption.<br/><br/>Holly Brooke<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480209400", "lastName": null, "legacyId": null, "modifyDate": "2007-02-21T15:45:32Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-21T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-17T03:11:04Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Holly A. Brooke", "trackingNbr": "80209400", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0705/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0705/attachments"}}}}}