{"data": {"id": "USCIS-2006-0044-1699", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1699"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "US Citizenship and Immigration Services<br/>USCIS-2006-0044<br/><br/>I am against the proposed fee increase as it is written. The government is writing <br/>this as a fix to internal problems of inefficiency and waste. This is also being done <br/>at the cost of the tax payers who are suppose to be represented by the very same <br/>people who wrote this. <br/><br/>The detailed breakdown of the costs reveals many of this issues that this agency <br/>has to deal with. A &#39;cost to process&#39; is listed, yet there is a short time that some <br/>of these forms are good until. I am specifically referring to the I-600/600A, N-565, <br/>N-600, and Biometric Services. These are all of the forms that are required for <br/>international adoption. The wait times to be approved by an international adoption <br/>agency is increasing. Since it is required to have these forms before you can be <br/>approved, a person pays to have these completed up front. With the current wait <br/>for China adoptions, we will have to renew this these two more times. If it costs to <br/>process them, then why create your own problem by having them expire too soon? <br/>This means that these costs are actually going to cost anyone currently adopting <br/>over 300% more! Or better yet, why not just create a short form to extend the <br/>forms and charge a small fee for the processing? There are better solutions other <br/>than increasing the fees.<br/><br/>My recommendation is to rewrite this with two objectives. The first is to review and <br/>change the expiration dates based on the reasons for filing these forms. As an <br/>American citizen (born, raised and served in the military), how is it an issue of <br/>national security that I want to adopt a child from abroad? The answer is it isn&#39;t.<br/><br/>The second objective, the fee structure should be based more on what you are <br/>applying for and your status as a citizen at the time of application.<br/><br/>Finally, the Biometric Services does not make any sense. Fingerprints expire. <br/>How is that? My fingerprints have been the same for 46 years! They do not <br/>change. Plus, my fingerprints are in the system because of my military service. It <br/>was flagged when I was fingerprinted for the adoption. Also, isn&#39;t technology <br/>suppose to decrease costs? It does where I work. Another example of the <br/>agencies ineffeciency.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480219eb9", "lastName": null, "legacyId": null, "modifyDate": "2007-03-27T16:34:30Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-27T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-26T20:32:50Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Richard F. Bernier", "trackingNbr": "80219eb9", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1699/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1699/attachments"}}}}}