{"data": {"id": "USCIS-2006-0044-2639", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2639"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "My comment is about the potential adjustment of the fees of filings for petition to <br/>adopt an orphan.  You need to understand how expense this process already is <br/>for families that want to adopt these children and give them the loving and <br/>supportive home environment that they need in order to flourish as they grow.  The <br/>first thing someone needs to put their finger on is that families are not only paying <br/>these fees once, but most often TWICE.  The expiration on the petitions, <br/>approvals, and finger prints do not coinside with each other or with the lengthy <br/>waiting times for most international adoptions.  <br/>No matter what type of fee is involved, a 66% rate increase is just ludicrous!  I <br/>believe that relates to Price Gouging.  Can you imiagine if the cost of a gallon of <br/>milk went up 66% next week?  Or the price of gas.  What if the oil companies <br/>raised it from $2.60 a gallon this week to 4.32 next week, what would be the <br/>reaction across the nation?  And I bet the government would get involved.  But <br/>now it they are trying the same thing.  Maybe because it affects what seems to <br/>be a small group of US citizens that you can just sneak this one by.  But what <br/>you are doing is once again dividing the people in to upper class and middle <br/>class.  You are raising the financial bar of who can &quot;afford&quot; to have children.  Does <br/>the USCIS really want to be responsible for forcing a family to make a decision of <br/>whether or not they can afford the fees in order to have a child?  In order to have a <br/>family?  If I was pregnant and on welfare the government would subsidize my <br/>hospital bills.  But since I am middle class and unable to have biological children, <br/>the government wants it to cost me even more to bring my daughter home.  <br/>Yeah, that really gives me the warm and fuzzy feeling about We The People, For <br/>the People.  <br/>NOT!<br/>OK, realistically.  If you feel it necessary for such a large increase in fees, extend <br/>the expiration of all the documents and fingerprintings out to 18 or 24 months so <br/>families are required to only pay the fees once.<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021e31a", "lastName": null, "legacyId": null, "modifyDate": "2007-04-03T01:53:39Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-01T13:52:33Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Melissa Combs", "trackingNbr": "8021e31a", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2639/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2639/attachments"}}}}}