{"data": {"id": "USCIS-2006-0044-2337", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2337"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "March 30, 2007<br/><br/>Director, Regulatory Management Division<br/>U.S. Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Avenue, NW., 3rd Floor<br/>Washington, DC 20529<br/><br/>Re:<span style='padding-left: 30px'></span>Proposed Adjustment of the Immigration and Naturalization Benefit<br/>Application and Petition Fee Schedule, DHS Docket Number USCIS?2006?0044<br/><br/>To Whom It May Concern:<br/><br/>This letter is in opposition to the proposed fee increases for the<br/>I-600/600A orphan petitions required of adoptive families.  <br/><br/>In 1989, the cost of an I600/I600A petition was $75.  Today the exact same<br/>form costs a prospective adoptive parent $545.  Biometric fingerprinting,<br/>which began in 1998, has risen in cost from $25 to $70 per applicant.  For a<br/>two-parent family adopting a single child, the USCIS process costs an upward<br/>of $685.   Because of the instability concurrent with international<br/>adoption, many families find that their USCIS approval expires prior to<br/>their invitation to travel to their prospective child?s birth country.  As a<br/>result, many families (especially those adopting from China and Guatemala)<br/>find themselves repeating the entire immigration application two or three<br/>times.  This can increase the cost of an adoption by thousands of dollars ?<br/>money many of us simply do not have. <br/><br/>The department admits that it has a dismal track record in processing<br/>applications and with its customer service.  Processing throughout the<br/>regional offices is erratic ? some I-600A applications take months to<br/>process, while individuals in other districts received approval of the exact<br/>same form within ten days.  The refusal of officials to give adoptive<br/>parents priority results in children languishing in orphanages or foster<br/>care overseas for months and months at a time.  Most egregious is that the<br/>processing time for immigrant workers (I-140) and employment authorization<br/>(I-765) are less (average of 3.31 and 1.97 months, respectively) than that<br/>to bring home an orphaned child (3.39 months).   There is no explanation for<br/>why USCIS finds it possible to process the projected 859,543 I-765 and<br/>129,743 I-140 applicants faster than the 29,260 I-600/600A applicants.  Why<br/>are children seeking to immigrate to the U.S. given greater scrutiny than<br/>adult foreign workers?<br/><br/>Adoptive parents attempting to learn the status of their petition are met<br/>with deaf ears and directed to a ?status? website which is not updated.  As<br/>a result of USCIS? refusal to prioritize orphan petitions, thousands of<br/>children suffer needlessly.  There has been no move by USCIS to assist<br/>prospective adoptive parents whose documents ?expire? while they wait for<br/>their child?s home country to grant them approval to travel.  These parents<br/>are forced to reapply with USCIS, repaying the same exorbitant fees two and<br/>sometimes three additional times, each time subjecting themselves to the<br/>same long and uncertain wait for immigration approval.  If USCIS would<br/>simply extend the ?expiration? deadline for the I-171H from eighteen months<br/>to three years, it would significantly reduce its workload without having to<br/>increase its fees.<br/><br/>In this request for an increase in fees, USCIS is not asking for what it<br/>needs, it is asking for what it wants.  It claims that this fee increase ?is<br/>designed to provide for an adequate and sustainable level of investment in<br/>staff, in infrastructure, and processes designed to improve the USCIS?<br/>ability to administer the nation?s immigration laws.?  The Bureau justifies<br/>these increases by asserting that ?this fee rule would provide the necessary<br/>resources to maintain these processing time standards and fund further<br/>improvements to USCIS business operations to continue to reduce processing<br/>times while ensuring the appropriate level of security.?<br/><br/>There are very few infants infiltrating Al-Qaeda.  The idea that adoptive<br/>parents are a threat to national security is laughable.  While we agree with<br/>the aims of the Department of Homeland Security, the additional levels of<br/>scrutiny on orphaned children and their prospective parents is absurd.  <br/><br/>While the aims of the department are laudable (reducing identity fraud,<br/>improving service, changing benefit applications from paper to electronic<br/>means in order to streamline the process) forcing adoptive parents to bear<br/>the burden of these goals is unconscionable.  Worse still, many of USCIS?<br/>stated aims do not directly benefit those seeking to immigrate.  <br/><br/>Many adoptive families have been through years of infertility and loss, and<br/>are mortgaging our homes and cleaning out our life savings to bring home a<br/>child.  Increasing the burden on us is not simply unfair, it is detrimental<br/>to the lives of waiting children.  We urge rejection of the current proposal<br/>and a new requirement that USCIS reduce the fee burden on adoptive families,<br/>give first priority to I-600/600A applications, consolidate the paperwork<br/>required for orphan petitions, and extend the ?expiration? of the I-171H<br/>from eighteen months to three years.<br/><br/>Sincerely,<br/><br/>Barbara J Rynbrandt<br/>Mom to two boys (twins) adopted from Ukraine and a daughter from Kazakhstan<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021cee5", "lastName": null, "legacyId": null, "modifyDate": "2007-03-30T22:54:25Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-30T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-30T18:23:53Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Barbara Rynbrandt", "trackingNbr": "8021cee5", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2337/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2337/attachments"}}}}}