{"data": {"id": "USCIS-2006-0044-2861", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2861"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am writing to protest the proposed fee increases outlined in Docket ID USCIS-<br/>2006-0044, specifically the the following petitions: the fees for the I-600/600A <br/>Petition to Classify Orphan as an Immediate Relative will increase from $545<br/>to $670, the fees for the N-565 Application for Replacement of Certificate of <br/>Citizenship (used for name changes) will increase from $220 to $380, the fees for <br/>the N-600 Application for Certificate of Citizenship will increase from $255 to $460, <br/>and the fees for the Biometric Services (fingerprints) will increase from $70 to $80. <br/>First, a 66% increase in fees, especially on this broad a scope, seems to be an <br/>incredibly large jump. While most citizens understand the need for increased <br/>security costs more money that must be raised from somewhere, a jump this <br/>large does not seem justified without evidence of attempts to try and streamline <br/>many processes that seems repetitive and wasteful. For example, in the case of <br/>the I-600/600-A processing, many countries such as China, have a wait that is <br/>longer than the 18 month time period that the petition is valid. However, instead of <br/>a simplified renewal when the wait for a child goes beyond 18 months, the adoptive <br/>parent must refile a brand new petition, paying full fees and resulting in wasted <br/>manpower by processing it as a completely new application. A streamlined <br/>process would require less time and manpower from the USCIS and less money <br/>for the citizen applying for this petition. <br/>Further, while these increased fees would provide more money to be used for <br/>stronger enforcement of immigration law, it would place the burden for these fees <br/>on the immigrants who are trying to comply with the law as they are required. I <br/>fear that these fees will make the burden of these fees so onerous that they will <br/>have the opposite effect--increasing the number of illegal immigrants because the <br/>fees are beyond what many can afford, so there will be even more dollars needed <br/>for enforcement in the long run. <br/>It does not feel proper or fair to increase these fees without taking a hard look at <br/>the current processes at hand to make sure that the multiple changes <br/>experienced in recent years by the USCIS have not left inefficient processes in <br/>place that wasted the dollars paid by both citizens and legal immigrants. As both <br/>a taxpayer and the parent of naturalized US citizen, this proposal seems unfair <br/>and poorly thought out. <br/>Thank you for your attention,<br/>Margaret Doss<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021f0df", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:06:41Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T22:14:50Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "n/a", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Margaret Doss", "trackingNbr": "8021f0df", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2861/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2861/attachments"}}}}}