{"data": {"id": "USCIS-2006-0044-0320", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0320"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I support this move.<br/><br/>Let me describe why.<br/><br/>I&#39;ve been living in USA since 1999 as a full-time employee getting above market<br/>wages and dutifully paying taxes. Recently, I became a home owner on a personal<br/>level and a manager  - managing people - in professional level. Still - after<br/>making contributions to US economy - I feel , on a personal level, I am not<br/>getting what I deserve. <br/><br/>For example, my wife just cannot work because I am waiting for my &quot;Green Card&quot;<br/>retrogression to end for past several years. She&#39;s a driven individual and I<br/>believe would make an excellent elementary teacher, a position she&#39;s passionate<br/>about -- but she just cannot work! This is frustrating for both her and myself.<br/><br/>For example, when I went to shop for my mortgage, my non-permanent resident<br/>status became a roadblock and eventually my interest rate, despite my 800+<br/>credit score, was much higher than a &#39;resident&#39; guy in a similar position. Yes,<br/>I believe this is discriminatory.<br/><br/>For example, I work for a Fortune 10 company and am in a position where I feel<br/>my earnings should rather be private since I too manage employees. But every<br/>time my H1-B goes up for renewal, the salary just needs to be put up to the<br/>board in front of the cafeteria exposing something very private to the rest of<br/>the 150,000 employee company!<br/><br/>In a nutshell, I have and advanced engineering degree from one of the most<br/>reputed institutes, 10 years of strong experience in my field, am paid very<br/>well, have been contributing to American Economy for past 9 years -- and still<br/>-- am lagging a person of similar stature -- but with residency or citizenship<br/>-- in a lot of personal and financial things!<br/><br/>I can pay for the process to be more efficient, expedient and selecting the<br/>&#39;right&#39; people by doing correct background checks. I can also understand the<br/>premium one needs to pay for &#39;preferred&#39; processing (like, the PERM processing<br/>of Labor or I-140 application) -- and am more than willing to pay!<br/><br/>At the proposed increased fee levels, I believe the process would be more<br/>efficient and expedited and people like me would benefit from it. At the same<br/>time, I would urge to consider starting a &quot;premium processing&quot; for I-485<br/>application too. This way both the BCIS and people like us benefit, and people<br/>who cannot afford to pay don&#39;t lose out on anything (they&#39;re still on the queue!).<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480203091", "lastName": null, "legacyId": null, "modifyDate": "2007-02-12T20:05:25Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-12T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-12T19:51:10Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Nilendu Misra, Hewlett-Packard Company", "trackingNbr": "80203091", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0320/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0320/attachments"}}}}}