{"data": {"id": "USCIS-2006-0044-2172", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2172"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am very concerned with the proposed increase in fees for U.S. Citizenship and<br/>Immigration Services), docket number (USCIS-2006-0044). This blanket increase in<br/>fees will add further barriers to Americans trying to adopt orphans from other<br/>countries, without any guarantee of better service delivery or accountability.<br/><br/>The first argument for this increase in fees noted in the Federal Register is to<br/>increase service delivery. As a recent client at USCIS I was disappointed by the<br/>3 hour wait in line to get fingerprints (and subsequent re-do of the prints a<br/>month later because the quality was poor), however, unless this fee increase<br/>will guarantee certain specifically outlined deliverables, I do not see a<br/>service delivery benefit to clients. &quot;Increase service delivery&quot; is a very vague<br/>and bureaucratic goal if there is not a specific action plan for the use of the<br/>funds that guarantees specific service delivery goals. If certain service<br/>delivery benchmarks were guaranteed and justified (ie. the clients of USCIS<br/>agree that they want specific levels of service and are willing to pay for<br/>them), then the proposed increase could be worthwhile. However, I did not see<br/>any such mention of specific goals that respond to client expectations with the<br/>regulation. It is so sickening to me that the government might allow this<br/>increase in fees without accountability for the funds that would add value to<br/>the clients it aims to serve.<br/><br/>I also wanted to comment the statement made in the Federal Register: &quot;The rule<br/>would permit U.S. Citizenship and Immigration Services to devote certain<br/>revenues to broader investments in a new technology and business process<br/>platform to improve substantially its capabilities and service levels.&quot; Again,<br/>what accountability is there that this will produce better service levels? The<br/>regulation did not outline the action steps that would guarantee better service<br/>delivery. <br/><br/>A 66% increase in fees for no *guarantee* for increased service delivery is<br/>unacceptable. I do not support this regulation and hope that my fellow Americans<br/>who are making decisions about this policy will not either. <br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021b8e9", "lastName": null, "legacyId": null, "modifyDate": "2007-03-30T01:39:06Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-29T03:21:54Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Sarah Lenssen", "trackingNbr": "8021b8e9", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2172/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2172/attachments"}}}}}