{"data": {"id": "USCIS-2006-0044-1291", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1291"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "By increasing fee schedules for green card and U.S. Citizenship applications <br/>certainly supports the funding for an up-to-date technology resolution for a more <br/>sufficient, streamline processing time.  There is tremendous amount of <br/>immigrations coming to America every year.  This does not only reflect the fact of <br/>population increase but it also means increasing of work forces, income <br/>generation, and American culture value for its diversity.<br/><br/> U.S citizens and Non-U.S. citizens all work hard and pay their taxes. Everyone <br/>benefits from their own contributions. It is definitely the immigrants are responsible <br/>for their own fees.  However, a Non-permanent immigrant is usually facing more <br/>challenge in finding works due to his/her alien status than it is to a Permanent <br/>resident or a U.S. Citizen.  Yet he or she still have to pay taxes like everyone else <br/>and is not entitle to the right to vote, Medicare or other benefits available.<br/><br/> It is true for those who files I-485 form also files I-765 form concurrently. How <br/>about individuals who already got approved for I-485 and filing N-400 (Application <br/>for Naturalization)? Permanent Residents who received green card and file for N-<br/>400 do not need to pay extra fee obligation that does not apply to them, they have <br/>the right to work and do not need employment authorization permit.  <br/><br/>U.S. Citizens do not pay for this immigration process, the immigrants pay for <br/>themselves.  Why increase the fees by assuming everyone files for certain <br/>applications? Why not let them pay accordingly to their individual needs or <br/>status? <br/><br/>I OBJECT TO THE PROPOSED RULE &quot;Adjustment of the Immigration and <br/>Naturalization Benefit Application and Petition Fee Schedule? FROM $325 FOR I-<br/>485 AND $330 FOR N-400 TO $905.<br/><br/>Instead of $905 fee for all the application, a fee adjustment of $509 (application <br/>$325 plus employment authorization $180) for I-485 form should be proposed.  N-<br/>400 fee of $330 should remain same as before.  PLUS ANY OTHER FEES MAY <br/>REQUIRED. <br/><br/>Have you ever consider the financial difficulty of a typical working family of 5 <br/>households has to face with the new proposed fee schedule? $905 x 5 = $4,525 <br/>plus biometric fee or other fees. This is not a small amount of money anyone can <br/>afford.<br/><br/> If the proposed fee schedule should passed, there should be a waiver program for <br/>qualified candidates or installment plans for those who do not meet the criteria of <br/>low income and unable to pay a lump sum amount. <br/><br/>KEEP IN MIND IF YOU ARE A PERMANENT RESIDENT, YOU WORK HARD TO <br/>SUPPORT YOUR FAMILY AND PAY TAXES. YET DUE TO THE NEW RULE <br/>YOU MIGHT NOT BE ABLE TO AFFORD TO BECOME A U.S. CITIZEN AND <br/>YOUR VOICE WOULD NOT BE HEARD BECAUSE YOU DO NOT HAVE THE <br/>RIGHT TO VOTE. <br/><span style='padding-left: 30px'></span>&quot;ALL MEN ARE CREATED EQUAL&quot;<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480214692", "lastName": null, "legacyId": null, "modifyDate": "2007-03-16T18:29:36Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-16T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-16T07:12:49Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Valerie H.", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous", "trackingNbr": "80214692", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1291/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1291/attachments"}}}}}