{"data": {"id": "USCIS-2006-0044-0039", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0039"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I disagree with the amount of fee increase as proposed in the document.  I think <br/>the bottom line is the whole operation of USCIS should not be totally relied on the <br/>applicants.  A lot of the overhead expense is fundamentally coming from the <br/>secuity measure in processing the document.  It is necessary, however, and the <br/>federal funding should come in when it involves national security.  When it comes <br/>to inflation, I really think the amount of increase is totally overwhelming and it is <br/>more than enough to cover the basic cost.  The other basic thing is how to <br/>increase the operation efficiency of USCIS without dramtically increasing the <br/>cost.  How much man power is needed to actually get the application document <br/>processed?  How about cutting the number of employee when the applicant <br/>number goes down?  I think in general the budget proposal of USCIS is out of <br/>control and then the bug is being pushed to the new immigrants.  <br/><br/>What do you think if your driver&#39;s license fee has a 100% increase every two <br/>years, if your DMV people tell you that&#39;s what they need to make the process of <br/>getting the driver&#39;s license renewal even faster?  Let people know how much your <br/>staff get paid for getting the job done.  If the applicants are really responsible for <br/>all the cost incurred for the operation, let the whole process be transparent and let <br/>people know it is operating in good efficiency like in a good private company.  If <br/>the mindset behind the fee increase is to discourage more legitimate applicants to <br/>be lawful US citizen, that thought and action must be stopped immediately.<br/><br/>Jonathan Weng<br/>Legal permanent resident<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801f98f9", "lastName": null, "legacyId": null, "modifyDate": "2007-02-01T21:08:03Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-01T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-01T20:30:41Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Jonathan C. Weng, University of Missouri", "trackingNbr": "801f98f9", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0039/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0039/attachments"}}}}}