{"data": {"id": "USCIS-2006-0044-2529", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2529"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "  The proposed fee increases are unacceptable and unjustifiable for many reasons<br/>(below).  USCIS has made no efforts at cost containment and fee increases cannot<br/>be justified until that is done.  A system wide analysis by GAO identification<br/>of failures and recommendations for improvements in USCIS should be accomplished<br/>first.<br/>  The justifications are those same given over the past 20 years with the same<br/>(unkept) promises, because the CIS/ICE/CBP have no enforced benchmarks, no<br/>compromise with opponents/critics/consumers, and no standards-including<br/>realistic assessments of risks.  In Wayne County, Michigan government, if a<br/>decision is not made on a permit within 60 days, then it is automatically<br/>granted.  However, in USCIS, if an application is not adjudicated in 5-10 years,<br/>it lingers unattended, even if repeated inquiries are made to the officer and<br/>their supervisor.   (I currently have a case where an I-130 remains<br/>unadjudicated for 10 years.)  Decision-making is avoided, not managed.  There<br/>appear to be no deadlines whatsoever.  This leads to additional inquiries and<br/>senseless applications or maneuvers by applicants to move cases, which then adds<br/>to the work burden and extends delays.  This procrastination even extends to<br/>just scheduling interviews: once an application is submitted, there should be an<br/>enforced calendar to at least given an interview date!  USCIS should have a rule<br/>set for it to decide I-130, I-751s within 1 year: this is not an impossible task<br/>to decide if a couple is married, yet it dares not set any limits for its own<br/>faults.  Only if actual deadlines are imposed will USCIS officers move cases<br/>through the system, as was done in the asylum offices with their 180 day deadline.<br/>  A business would advertise to its customers when to expect results.  USCIS<br/>does not guarantee anything; it has no regular mechanism to meet with its<br/>?consumers? (attorney groups and non-profit agencies) on specific problems or<br/>cases.  I have never seen USCIS consult its consumers and ask for and really<br/>consider their suggestions on its proposals.  Had this been done, the waste of<br/>millions of hours of staff time with the NSEERS interviews would not have<br/>diverted attention from more productive efforts.  This was widely predicted by<br/>immigration practitioners to be futile but went ahead anyways.  <br/>  There is no prioritization of cases and devotion of valuable human resources<br/>to those first.  USCIS and ICE act as if they will interview extensively and<br/>prosecute fully every single case or minor human or technical transgression.  As<br/>an example, the Detroit District Office interviews I-130 applications of persons<br/>married for several years, with children of their marriage, and who have<br/>submitted extensive documentation of their marriage, after they have already<br/>approved the I-130!  Further, Detroit?s adjudication section interviews couples<br/>married sometimes up to 10 years!  Couples with children of their marriage are<br/>also interviewed.  This should only be done in extremely rare instances instead<br/>of current practice.  There is not a high incidence of fraud of married couples<br/>with biological children of their marriage (by inherent definition, this is<br/>impossible) justifying such tactics.  It raises costs by squandering<br/>interviewing time available to the bureau.<br/>  Because there is no standard and risk-assignment to low priority, USCIS<br/>frequently asks for RFEs- Requests for Further Evidence.  This should not be<br/>used in low priority cases as it only results in augmenting the voluminous<br/>amount of documents being dumped by applicants and their<br/>attorneys/representatives.  Most practitioners I know overdocument all<br/>applications because so many are returned for more and more evidence.  There<br/>seems to be no parameters when there is too much information for officers to digest.<br/>  There is an insistence on impossible misuse of human resources under the guise<br/>of 100% total security (which is unattainable in human affairs; ie the waste of<br/>the NSEERS interviews).  All branches engage in useless litigation (or refer for<br/>litigation), until they are overburdened to breaking with cases: Detroit ICE<br/>would not agree to send back routine and uncomplicated I-485 adjustments from<br/>the Immigration Court to USCIS until the past month, in spite of internal Memos<br/>from Washington to this effect!<br/>  Additionally, the imposition of the entire burden of the costs of all<br/>components of the system upon the paying consumers is a default tax on family<br/>and labor-based applications by the public and Congress so that we do not pay<br/>for the security or values we purport to hold (for example, we should accept to<br/>support the asylum system which is a national core value and interest). <br/>Excessive security checks are unfunded mandates passed on to immigrant applicants.<br/>  This fee increase is even able to be proposed because there are no market<br/>forces or internal factors to force efficiency.  Finally, the fee increases will<br/>increase lack of documentation of persons currently present in our communities<br/>because applications will be unaffordable for many families.  Many of our<br/>clients now have to choose which application they can afford because the high<br/>fees and their ancillary fees (for medical exams, translations, express mailing<br/>to meet deadlines, etc.).  <br/>  Personal insecurity and feelings are allowed to enter into decisions of USCIS<br/>and ICE officers who to ?prosecute?: DNA tests (costing applicants up to $800!<br/>in extra costs) are demanded more and more, even for applicants married for 3-4<br/>years.  As officers have said: ?You are lying.  That is not your child.?  Or ?3<br/>kids doesn?t mean this is a marriage.?!!   These are not rational examination of<br/>facts.  Children of a marriage does indicate a bona fide marriage.<br/>  The citizens of the United States have a public interest in keeping most<br/>residents legal and documented, away from being forced into the underground<br/>systems and economie because they cannot afford to become citizens or legal<br/>residents.  This is done by a well-functioning, data-driven, and humane system.<br/> It is not done by forcing vulnerable people to pay for all costs of public<br/>order and efficiency.  We should accept that our country should pay some<br/>reasonable costs to underwrite our government functions.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021dc5a", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:20:28Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T15:16:08Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Mary Lane", "trackingNbr": "8021dc5a", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2529/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2529/attachments"}}}}}