{"data": {"id": "USCIS-2006-0044-2086", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2086"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am very disappointed to see that not only does it appear that you are not <br/>considering extending the timeline for the I171H for adopting families, but now you <br/>are considering raising the fees for this document.  This is one of the most <br/>stressful, as well as most expensive document required for families that are <br/>adopting internationally.  There are some families that will end up having to apply <br/>for this document 3 times for one adoption because of waiting times right now.  <br/>For most families the cost of this document the first time around,  along with the <br/>biometric fees is a huge financial burden.  But since the expiration of these <br/>documents isn&#39;t close to being along the same wait times we are experiencing <br/>right now, it creates stress in how long you could wait for this document(for some <br/>states 12 weeks waiting) and the cost is just overwhelming.  It doesn&#39;t seem as <br/>though you have a reasonable rationale for such a significant increase.  I would <br/>hope you would reconsider the fee increase, and understand that for most this is  <br/>already a very large sum of money, and to have to be responsible for that cost <br/>multiple times is really too much to ask(when this is the same information being <br/>submitted)  You should be able to streamline this process, and then you would not <br/>have to raise fees. The same for biometrics.  Our fingerprints will be the same as <br/>they were 15 months ago.  With computer technology it would seem as though <br/>you would be able to keep them on file for a bit longer.  You would then need less <br/>workers in your service centers if they were not having to redo fingerprints for US <br/>citizens that have already had a FBI clearance, local and state police clearance, <br/>CPS clearance, and have passed a state certified home study.  We are not the <br/>people the USCIS or the Dept of Homeland Security should be worrying about.  <br/>So this would save your department money right off the bat, and raising fees would <br/>not be necessary.<br/>Thank You for your time and consideration.  Julie &amp; David Rockaway<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021b8e7", "lastName": null, "legacyId": null, "modifyDate": "2007-04-10T16:39:16Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-29T03:21:03Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Julie D. Rockaway", "trackingNbr": "8021b8e7", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2086/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2086/attachments"}}}}}