{"data": {"id": "USCIS-2006-0044-0084", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0084"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "As legal immigrants working in this country, we strongly oppose USCIS new fee <br/>plan. This plan attempts to enhance our hardship and agony caused by this <br/>agency?s inefficiency in processing immigration petitions. For example, simply for <br/>an I-485 adjustment of status application for permanent residence or N-400 <br/>naturalization for citizenship, the USCIS plus the FBI name check can delay the <br/>adjudication for 6 to 10 years! This unreasonable delay is not only a significant <br/>damage to the lives of up to a million legal immigrants, but also a serious harm to <br/>the competence and national interest of this country. <br/><br/>The USCIS has already raised the fees to a level causing heavy financial burdens <br/>on our families. As legal immigrants, we pay all kinds of taxes. Each cent after the <br/>taxes is needed by our daily life. However, the USCIS is planning to collect more <br/>fees from us in the name of funding the DHS security program and reducing the <br/>backlogs. In the past, the USCIS and its predecessor INS, raised fees several <br/>times while promising to deal with substantial backlogs, but the increased fees <br/>have done nothing to alleviate these problems. By the end of 2006 FY, the USCIS <br/>claimed they had significantly reduced the backlogs, but the fact is: Millions of <br/>immigrants waiting for the quota and those stuck in the FBI name check are <br/>simply neglected in their calculations. The DHS security programs shouldn?t be <br/>supported solely by legal immigrants. The legal immigrants? miserable life cannot <br/>afford the bonus of the USCIS employees any more. The USCIS need a true <br/>reform for efficiency instead of confiscating more money from legal immigrants who <br/>have already suffered too much under this broken immigration system. <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801f9a69", "lastName": null, "legacyId": null, "modifyDate": "2007-02-02T16:19:57Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-02T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-02T01:50:33Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Lei Hua", "trackingNbr": "801f9a69", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0084/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0084/attachments"}}}}}