{"data": {"id": "USCIS-2006-0044-1819", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1819"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am writing on behalf of the proposed increase in adoption related expenses <br/>through CIS.<br/>My husband and I currently have a dossier in China - log in date March 27, 2006.  <br/>Due to the slow down in the process on China&#39;s side all of our documents through <br/>CIS will expire prior to our travel to China (potentially before we even get our <br/>referral).<br/>We are already having to pay for documents we already have had done - <br/>fingerprints, home study, I-600A and 171-H.  Too add insult to injury an increase <br/>in 66% would make this process unreachable for many families.<br/>With CCAA making many changes in their guidelines for who can adopt the <br/>number of families will decline, add the increase in fees (and having to do them at <br/>least twice in the process) will make international adoption out of reach for many <br/>families.<br/>At times it feels like international adoption fees through CIS are here to put fat in <br/>the budget of CIS.<br/>We are a military family.  We understand homeland security issues and we <br/>support regulations that keep our country safe.  Putting American Citizen&#39;s safety <br/>first on the priority list in fine - but increasing adoption fees to pay for CIS to do <br/>their other jobs - not appropriate.<br/>Our family did not choose international adoption first.  We looked locally - through <br/>foster/adoption options.  We were told by one agency that since my husband <br/>deploys we would never be able to adopt through them.  We were told by the <br/>Dept. of Social Service that if we wanted a baby we needed to look elsewhere.  <br/>When we looked into local adoptions through &quot;unexpecting&quot; expecting moms it <br/>was like a baby market with the lawyers.  Our family has even tried to do foster-<br/>adopt in another state with a little girl who was Native American.  We were shot <br/>down there due to ICWA (Indian Child Welfare Act).  Since we are not Native <br/>American we could not adopt her - she is on her 15th family through foster care <br/>now..  <br/>I will add one more detail that has frustrated me with CIS.  Our local office in <br/>Charlotte.  When dealing with the appointment office we have had many <br/>challenges.  First, they sent our money order back in October 2005 because it <br/>was too much.  We redid the money order and sent it 5 days before a price <br/>increase.  I did signed return rec&#39;t.  They held on to it for 7 days and then sent it <br/>back so I could send more money.  With a looming year long deployment on our <br/>horizon I was beyond irritated.  When I called the office to speak to a supervisor I <br/>was treated like I was trying to do something illegal.<br/>My husband recently came home from the deployment.  Our fingerprints were <br/>about to expire so I sent a letter explaining that we would need to renew our <br/>prints.  The challenge was making sure we got an appointment that was in <br/>between all of the schools my husband is slated to attend before the next <br/>deployment.  I got my letter returned to me.  I was told that they did not make <br/>appointments based on things like that.  I would have to send another letter in <br/>later and hope I get an appointment that works.<br/>Hey, thanks!  Not like my husband is fighting for anything!  I hate pulling the Army <br/>card, but give me a break.  I have no control over his deployment schedule and <br/>what this county needs him to do.  A bit of understanding and cooperation would <br/>be helpful.  We are not a sole case in this scenario in that office - there are quite a <br/>few military families who look to international adoption here in North Carolina.<br/>I would encourage all involved to look in other places when trying to increase a <br/>budget.  Adopting families are not the gravy train here.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021a673", "lastName": null, "legacyId": null, "modifyDate": "2007-03-28T16:50:37Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-28T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-27T13:50:04Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Rick Larson - WA State congressman", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By AnnMarie Adams", "trackingNbr": "8021a673", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1819/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1819/attachments"}}}}}