{"data": {"id": "USCIS-2006-0044-0840", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0840"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am an american citizen.  My husband will be an immigrant to this country.  I <br/>most definitely think that the fees are extremely high.  I am a professional, <br/>educated woman, and I work an incredible number of hours.  As I am self-<br/>employed, my taxes are most definitely painful enough.  I cannot save money <br/>because I need it to spend on things that are deductible, and when I don&#39;t spend <br/>it, I have to give it to the government.  The current fees are already almost too <br/>much to bear on top of rent, gas, utilities and all of the other ridiculously high living <br/>expenses.  190 dollars for the I-130, 170 dollars for the I-129F, hundreds of dollars <br/>for the I-485, more fees so that he will be able to work here..... FORTY PERCENT <br/>of my income to taxes.......  By increasing the fees as much as is proposed, it is <br/>absolutely insane to expect me and my husband to be able to pay the new <br/>amounts in addition to daily living expenses!  My husband will not be able to help <br/>financially at the start, as he comes from a country where living day to day is <br/>significantly less, which in turn makes his income significantly insignificant as <br/>compared to the painful cost of living in the United States.  I make about 30,000 <br/>dollars a year, and I can guarantee that this is far more than the average <br/>immigrant salary.  This country was BUILT on immigrants, (my great-great <br/>grandfather came here with 7 dollars in his pocket) and by making it so <br/>impossible for people to come and have the right to build a better life (legally), is <br/>absolutely arrogrant.  And by the way, why are people complaining about the cost <br/>of *illegal* immigrants on this forum?  As much as I agree that I do not want my <br/>taxes paying for those who are here illegally, the immigration services are for <br/>those who are trying to go through the system in the proper way.  Furthermore, <br/>the number of illegal immigrants will likely skyrocket through the roof, because <br/>they will want to live here, but will never have even a CHANCE to afford the costs <br/>involved to even try.  I would like to see someone with a family who can live on <br/>minimum wage or less (most of the illegals), and still try to go through the pipeline <br/>legally.  Has the USCIS even considered this most likely probability??????  Do <br/>you think you see too many illegals now?  Just triple and quadruple the fees, and <br/>watch the immigration lawyer fees go up, and you will see illegals in abundance.   <br/>No one can live on minimum wage.  We are seeing to it that it should be <br/>impossible to live any sort of dream by taxing the citizens into debt while they <br/>labor and watch their families crumble just to make ends meet. <br/>Please... stay self-sufficient, but let people have a chance with some dignity.  We <br/>are killing ourselves out here.  <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020aa13", "lastName": null, "legacyId": null, "modifyDate": "2007-02-23T19:09:54Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-23T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-23T05:10:11Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous", "trackingNbr": "8020aa13", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0840/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0840/attachments"}}}}}