{"data": {"id": "USCIS-2006-0044-2803", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2803"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "April 2, 2007<br/><br/>Director, Regulatory Management Division<br/>US Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Ave. NW, 3rd Floor<br/>Washington, D.C. 20529<br/><br/>RE: DHS Docket # USCIS-2006-0044<br/>Proposed Rule ? Adjustment of the Immigration and Naturalization Benefit<br/>Application and Petition Fee Schedule<br/><br/>On behalf of the Korean American Resource &amp; Cultural Center (KRCC), I am writing<br/>to strongly oppose the increase to immigration and naturalization fees that US<br/>Citizenship and Immigration Services (USCIS) proposed on February 1, 2007.<br/><br/>Founded in 1995 by a group of low-income, immigrant Korean American youth,<br/>KRCC?s mission is to empower the Korean American community through education,<br/>social service, organizing/advocacy, and culture.  KRCC serves the Korean<br/>American community of greater Chicago, now estimated at 100,000.  KRCC is also<br/>an affiliate of the National Korean American Service &amp; Education Consortium,<br/>which was established in 1994 and seeks to project a national Korean American<br/>voice on immigrant rights and civil rights issues.<br/><br/>The Korean community in the United States is largely immigrant; according to the<br/>2000 Census, approximately 78% of Korean Americans were born outside of the US.<br/> Department of Homeland Security estimates indicate that there are over 200,000<br/>Korean American legal permanent residents eligible to naturalize.  We currently<br/>provide naturalization application assistance to 150 prospective US citizens per<br/>year.  These community members have worked hard to establish lives for<br/>themselves in the U.S., and yet Korean Americans are still nearly twice as<br/>likely as non-Hispanic whites to live in poverty and Korean Americans? per<br/>capita income is thousands of dollars less than the national average. The steep<br/>fee increases proposed by USCIS ? which in some cases are double the current fee<br/>? would put the goals of gaining permanent resident status, reuniting with<br/>family members, and ultimately becoming a US citizen further out of reach. <br/>USCIS should be building bridges for immigrants to move toward citizenship, not<br/>putting up walls.<br/><br/>The proposed fee for naturalization is particularly jarring.  As recently as<br/>1998, the cost to apply for citizenship was $95.  The current fees are typically<br/>$400, a fourfold increase in the past eight years.  Now USCIS is proposing a<br/>further increase of 70%, to $675.  An individual working at a minimum-wage job<br/>would need to work for more than three weeks and save all of her or his earnings<br/>in order to pay this fee.<br/><br/>Even more startling is the proposed cost of filing for adjustment of status,<br/>which for many immigrants is the first step on the road to US citizenship.  That<br/>application has risen from $130 in 1998 to a total of $400 today. Under the<br/>proposed rule, the total price will rise to $985.  In other words, it will cost<br/>nearly $1,000 for an immigrant to apply for a green card and start the five-year<br/>countdown to citizenship.  A minimum-wage worker would need to save a full<br/>month?s pay to afford the proposed fee.<br/>USCIS claims that the fee increase is necessary to improve service.  We are not<br/>disputing the fact that USCIS service requires improvement; there exist<br/>continuing backlogs in application processing and months-long (even years-long)<br/>delays.  77,000 Koreans ? and 1.5 million Asians ? are caught in the family<br/>immigration backlogs, and Korean American citizens must wait at least 3.5 years<br/>for their children and up to 12 years for their siblings to join them in the US.<br/> Furthermore, in October 2006 the Government Accountability Office reported that<br/>USCIS had lost track of 110,000 files needed to process citizenship cases. <br/>However, we question whether service improvements could be better accomplished<br/>by improving the efficiency of the current application processing procedures<br/>rather than increasing the application fees.  <br/><br/>Moreover, we support the provision of the Citizenship Promotion Act of 2007<br/>(H.R. 1379 and S. 795 respectively) which calls for a moratorium on fee<br/>increases until the Department of Homeland Security can submit a report<br/>justifying the need for such increases.  This legislation mandates that this<br/>report be based upon a comprehensive review of the direct and indirect costs of<br/>immigration services and that these costs are to be distinct from expenditures<br/>related to national security and border enforcement.<br/><br/>USCIS also argues that it has no other option than raising fees if it wants to<br/>cover its costs.  However, there are no laws that require USCIS to fund the<br/>entirety of its operations through application fees.  Nothing prevents USCIS<br/>from pursuing other sources of revenue, including asking Congress for<br/>appropriations.  In fact, USCIS has sought and received Congressional funding<br/>several times in the past.<br/><br/>Most basically, immigration and citizenship are public goods that benefit our<br/>entire country. Immigrants bring their talent and hard work to our economy. <br/>They pay taxes, revitalize our communities, and contribute to the cultural<br/>vibrancy of our nation. In becoming US citizens, immigrants demonstrate their<br/>strong commitment to their new home country by learning English, gaining<br/>knowledge about American history and government, and swearing allegiance to the<br/>United States.  Given the net benefit that immigration provides to this country,<br/>USCIS must move towards encouraging immigrants to become part of our community<br/>by gaining legal status and becoming citizens, rather than set up barriers that<br/>block their path to citizenship and exclude them from becoming more active<br/>participants in US society.<br/><br/>The plan to increase immigration fees is misguided.  I urge USCIS to first<br/>justify the fee increase by conducting a thorough assessment of its current<br/>policies and procedures ? with particular regard to the efficiency of its<br/>application processing and background checks ? and seek other sources of funding<br/>before proceeding with the proposed fee increase.  Thank you for your consideration.<br/><br/>Sincerely,<br/><br/>Becky Belcore<br/>Executive Director<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021eee7", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:03:05Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T18:36:04Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Becky Belcore", "trackingNbr": "8021eee7", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [{"id": "0900006480dff8d7", "type": "attachments"}], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2803/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2803/attachments"}}}}, "included": [{"id": "0900006480dff8d7", "type": "attachments", "links": {"self": "https://api.regulations.gov/v4/attachments/0900006480dff8d7"}, "attributes": {"agencyNote": null, "authors": null, "docAbstract": null, "docOrder": 1, "fileFormats": [{"fileUrl": "https://downloads.regulations.gov/USCIS-2006-0044-2803/attachment_1.doc", "format": "doc", "size": 33280}], "modifyDate": "2007-04-03T21:03:06Z", "publication": null, "restrictReason": null, "restrictReasonType": null, "title": "Comment Submitted by Becky Belcore, Korean American Resource and Cultural Center (Attachment)"}}]}