{"data": {"id": "USCIS-2006-0044-2494", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2494"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "March 27, 2007<br/> <br/><br/>Director, Regulatory Management Division<br/>U.S. Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Avenue, NW., 3rd Floor<br/>Washington, DC 20529<br/><br/>Re:<span style='padding-left: 30px'></span>Proposed Adjustment of the Immigration and Naturalization Benefit<br/>Application and Petition Fee Schedule, DHS Docket Number USCIS 2006-0044<br/><br/>To Whom It May Concern:<br/><br/>This letter is in opposition to the proposed fee increases for the I-600/600A orphan<br/>petitions required of adoptive families.   <br/><br/>I recently completed the adoption of a 2 1/2 year old boy from Russia (he became <br/>a U.S. citizen 11/23/06).  This was a very expensive and difficult task at current <br/>costs.  As a single father, working full time, I could barely afford it, but I <br/>desperately wanted a son.  Fortunately, I completed my adoption one month <br/>before my I-600/600A would have expired, or I would have had to redo this form at <br/>even more out of pocket, non-reimbursed expense.  Many families I know were not <br/>so lucky.  <br/><br/>Why are orphaned children seeking to immigrate to the U.S. given greater scrutiny <br/>than adult foreign workers?<br/><br/>Adoptive parents attempting to learn the status of their petition are almost entirely <br/>ignored directed to a status website which is not updated.  <br/> <br/>There has been no move by USCIS to assist prospective adoptive parents whose<br/>documents expire while they wait for their child&#39;s home country to grant them<br/>approval to travel.  These parents are forced to reapply with USCIS, repaying the<br/>same exorbitant fees two and sometimes three additional times, each time <br/>subjecting themselves to the same long and uncertain wait for immigration <br/>approval.  What is truly shocking about this is that some offices seem to get <br/>approval very quickly while others delay and delay and delay.  If there was a <br/>correllation between how over-burdened they were and how delayed they were, the <br/>fee increase might make sense, but there is no correllation whatsoever. <br/><br/>In this request for an increase in fees, USCIS is not asking for what it needs, it<br/>is asking for what it wants.  It claims that this fee increase is designed to<br/>provide for an adequate and sustainable level of investment in staff, in<br/>infrastructure, and processes designed to improve the USCIS ability to administer<br/>the nation&#39;s immigration laws.  The Bureau justifies these increases by asserting<br/>that this fee rule would provide the necessary resources to maintain these<br/>processing time standards and fund further improvements to USCIS business <br/>operations to continue to reduce processing times while ensuring the appropriate <br/>level of security.<br/><br/>I would be amazed to find out that an internationally-adopted child was a member <br/>of a &#39;sleeper cell&#39;.  The idea that adoptive parents are a threat to national security <br/>is laughable.  While we agree with the aims of the Department of Homeland <br/>Security, the additional levels of scrutiny on orphaned children and their <br/>prospective parents is absurd.  <br/><br/>While the aims of the department are laudable (reducing identity fraud, improving<br/>service, changing benefit applications from paper to electronic means in order to<br/>streamline the process) forcing adoptive parents to bear the burden of these goals<br/>is unconscionable.  .   <br/><br/>There is an incorrect picture that parents who adopt internationally must have high <br/>disposable incomes.  Far from that, most of us are regular people who take out <br/>extra mortgages, increase our credit card debt and put off buying necessities just <br/>to bring out children home.  Increasing the burden on us is not simply unfair, it is <br/>detrimental to the lives of waiting children.  <br/><br/>We urge rejection of the current proposal and a new requirement that USCIS <br/>reduce the fee burden on adoptive families, give first priority to I-600/600A <br/>applications, consolidate the paperwork required for orphan petitions, and extend <br/>the expiration of the I-171H from eighteen months to three years.<br/><br/>Sincerely,<br/><br/>Andrew Cronyn<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021db09", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:18:03Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T11:24:14Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Andrew Cronyn", "trackingNbr": "8021db09", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2494/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2494/attachments"}}}}}