{"data": {"id": "USCIS-2006-0044-2259", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2259"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "While I can see the reason why the USCIS wants to increase all the fees, I would <br/>support this idea ONLY IF the service can promise it&#39;s customers a higher <br/>customer satisfaction rate and treat the legal aliens with fairness and respect. <br/>Even if the service can make such a promise, the proposed fees are outrageous, <br/>especially for low and middle income families it will be a big financial burden. They <br/>simply can?t afford it. Being a legal non-immigrant for the past 9 years and waiting <br/>to get my green card, I am writing from my own personal experience.<br/><br/>Lately, especially after the Sep 11th, it is very obvious that lot of qualified, law-<br/>abiding, hard-working individuals who came to this country get stuck in the long <br/>waiting queue to get their green cards while other illegal immigrants cut in front of <br/>the line. Not to mention at any given point, the way in which two different legal <br/>aliens being treated is totally different; one could wait for years and years to get <br/>his green card whereas the other one gets his green card in a few months. <br/><br/>The USCIS and all the government officials must understand the difference <br/>between the ?illegal? aliens and the ?legal? aliens. It makes no sense to tackles <br/>both parties? problems at the same time because each involves a different set of <br/>complications, and it makes no sense to treat a legal alien like he/she is a <br/>terrorist or potential threat to this county. By doing that USCIS forces a potential <br/>permanent resident or U.S citizen return to their home country where his/her skills <br/>which are highly in-demand are better utilized. <br/><br/>And also, USCIS has been so adamant in its position whenever customers or their <br/>attorneys or their congressmen/senators contact them with a request to expedite <br/>the processing on a long-pending application. The response we get is simply ?the <br/>case is pending? or ?it is pending because of security review, but it can not be <br/>expedited?. I personally received this kind of responses for more than 3 years no <br/>matter who contacted the USCIS. It is very obvious that if someone was really a <br/>terrorist or a potential threat to this country he/she might have already caused <br/>some damage to this country. By keeping the application in a ?pending? state for <br/>years and years, the USCIS is not going to gain anything, but only lose, i.e., lose <br/>a well-qualified individual who could be contributing his skills and knowledge to the <br/>U.S economy. Common sense says that why would anyone want to stay in this <br/>country if USCIS tortures them. One more point I want to make here regarding the <br/>rudeness/unfairness of USCIS is the recent announcement about rejecting <br/>mandamus actions when a case is pending for an unusual time. It simple tells <br/>that USCIS does not want to take responsibility for their mistakes.<br/><br/>I agree additional security measures must be implemented to protect this country <br/>from further attacks. But there must be a balance between the security and <br/>helping legal aliens.<br/><br/>Again, by improved customer satisfaction I mean that when a customer calls the 1-<br/>800 no. the USCIS customer service representative who picks up the phone must <br/>be in a position to actually help the customer, not just read the information from <br/>the computer which is already available to the customer via the USCIS.gov <br/>website. <br/><br/>To reiterate and conclude, I would support the idea of fee increase only if USCIS is <br/>willing to treat the genuine customers with fairness and respect and also establish <br/>a reasonable fee increase. Otherwise, if it continues to operate like it does today, <br/>it may be able to raise all the funds it wants, but there may not be enough <br/>customers to service.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021c6a5", "lastName": null, "legacyId": null, "modifyDate": "2007-03-30T17:01:00Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-30T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-30T02:20:29Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Anonymous", "trackingNbr": "8021c6a5", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2259/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2259/attachments"}}}}}