{"data": {"id": "USCIS-2006-0044-0987", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0987"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "To Whom It May Concern,<br/><br/>Although I understand the need for CIS to modernize its business from processes, <br/>to technology, to application timelines, I feel as though the astronomical rate <br/>increases are unjustified. It merely seems as though CIS has taken the costs of <br/>the interim benefits for most of the applications and rolled it into the new <br/>application fees. <br/><br/>As an immigrant I can honestly tell you the public perception of CIS is poor and <br/>will likely get worse with the fee increases. Also, as a proud immigrant, I would <br/>pay reasonable fees for immigration services BUT they must be justified. Up until <br/>now, CIS has failed in customer service, application procedures, waittimes, <br/>backlogs, and any other customer facing process you can think of. I know the <br/>excuse is that the new fees will improve the system, but nothing in this agency&#39;s <br/>history shows a need to service its customers while protecting the USA. What <br/>guarantees do we have - as the public- that the fee increases will result in a 20% <br/>reduction of processing times? Seriously, the processing times for most <br/>applications today do not fall within the timeline the President asked for to begin <br/>with. How do I know the USCIS will follow through? <br/><br/>Finally, the other area of concern is the percentage of increase. A citizenship <br/>application would cost approximately $700 (including biometrics). That is a huge <br/>burden on the public. Keep in mind that non of the fee is refundable should <br/>something go wrong (whether it is a USCIS error or not). I can honestly tell you <br/>that his fee is unaffordable to most individuals, and the fact that we are speaking <br/>out against the fee increases does not mean we do not value the US immigration <br/>benefits bestowed on us. <br/><br/>My solution would be to take Congress up on its offer and request they pay for the <br/>expansion efforts of USCIS over the next several years. If the billions of dollars <br/>were supplied, then USCIS could increase the fee - not to recover the lost interim <br/>benefit applications, but rather to reflect the true increase of inflation and the true <br/>cost of application processing. Another option is for USCIS to implement the <br/>changes they propose the increased fees would facilitate first, then after proving to <br/>the general public that they are an efficient and functioning agency, they can raise <br/>the fees as much as they like. No one will complain if they know the system and <br/>processes actually work. <br/><br/>Regards,<br/>Mo.<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020cb92", "lastName": null, "legacyId": null, "modifyDate": "2007-03-01T21:26:06Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-01T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-01T17:18:31Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Mo Jibril", "trackingNbr": "8020cb92", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0987/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0987/attachments"}}}}}