{"data": {"id": "USCIS-2006-0044-0050", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0050"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I think this fee increase is nothing but an anti immigrant effort to stop immigration <br/>in the United States.  However, it is wrong and unfair.  The government is not <br/>taking into account the cost of living increase and the difficult financial situation <br/>most of us are living in the United States as a consequence of the War and all <br/>related issues.  <br/><br/>Indeed, the new fees will stop people from filing applications with the Service and <br/>probably the Service will get up to date with their backlogs due to the lack of <br/>filings but that won&#39;t reduce the number of undocumented immigrants in the United <br/>States.  Having people legalize in the United States should be a priority instead of <br/>turning people away from that path.  It is sad and a shame that the government <br/>would turn their back to the people who makes this country<br/><br/>If the government needs to increase their income, it should raise only the fees of <br/>employment and business related applications because those people are capable <br/>of paying higher fees.  However, raising the fees for adjustment applications <br/>knowing that most of those are related to family immigration is unfair.  The <br/>government is targeting the poorest kind of immigrant.  Tell them to target the <br/>richer and not the poorer.  I cannot stop thinking about the millions of working <br/>class immigrants who will not be able to afford the government ridiculous fees.  <br/><br/>At last, the government should consider the access of these immigrants to legal <br/>representation.  As an immigrant I have never even consider the possibility of <br/>submitting any applications ot the government without legal representation.  <br/>Immigration laws in this country are anti immigrant, tricky and confusing.  With <br/>the current fees, and the current misleading information provided by USCIS many <br/>individual file their applications on their own to later find out they are not eligible for <br/>the benefit sought.  However, some immigrants are able to make the extra effort <br/>and obtain legal representation before submitting any applicaitons to ensure that <br/>their money will be rightly expense.  If the government raises its fees outrageously <br/>as proposed, immigrants will not be able to obtain legal representation and will <br/>end up throwing money for no benefit in the governments hands.  As you may <br/>know, USCIS never returns funds to applicants. <br/><br/>This fee increase is very unfair. <br/><br/>Respecfully, <br/><br/>Kathia Pereira,Esq.    <br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801f9959", "lastName": null, "legacyId": null, "modifyDate": "2007-02-02T15:13:03Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-02T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-01T21:46:23Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Kathia Pereira", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Kathia I. Pereira, Pereira and Associates LLP", "trackingNbr": "801f9959", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0050/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0050/attachments"}}}}}