{"data": {"id": "USCIS-2006-0044-0715", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0715"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "The fee hike is out of proportion to the benefit that is claimed by Director <br/>Gonzalez. An increase of 80% does not justify an improvement in performance by <br/>only 20%. The fee hike also represents a significant burden, as it would mean that <br/>each applicant awaiting their I-485 approval in general will need to pay $340 + <br/>$305 = $645 for EAD renewal and Advance Parole per year. A lot of people have <br/>been waiting over 6-7 years for their 485 approval. This means that for no fault of <br/>theirs, they will have to pay every yearover $1000 per family (assuming 2 people <br/>per family).<br/><br/>This increase should only be allowed with following pre-conditions:<br/>1. People will not have to pay for any extensions or renewals of the EAD cards or <br/>Advance Parole. The fee&#39;s should be only one time for initial application. This is <br/>only fair, as the people having to extend/renew these are not at fault and are <br/>actually suffering.<br/>2. USCIS should have set time for processing all applications, and this cannot be <br/>changed based on workload or other excuses. <br/>3. Anytime any of the applications are not approved in the above time, USCIS will <br/>have to refund the money for application and provide service free of charge. If <br/>USCIS does not process the application, in twice the set time frame, then it <br/>should have to pay a fine as well as answer to a monitoring authority.<br/>4. Some people are stuck in Namecheck process for over 4 years. This is a totally <br/>opaque process, with no accountability. A portioon of the revenue from the fee <br/>hikes should be used to improve services of FBI specifically for immigration <br/>related namecheck, and this process should be made transparent. No application, <br/>should take longer than 1 month for clearance. Again accountability and fines for <br/>poor performance need to be put in place to ensure compliance. Applicants <br/>should be able to inquire regarding status of their namecheck.<br/>5. An audit of USCIS services should be done after 1 or 2 years of these fee hikes <br/>being put in effect to see if it has the impact that it is intended to. If not, the <br/>Director should have to answer to a Congressional inquiry, and the fee hike <br/>rescinded.<br/><br/>Director Gonzalez in his statements claims that this fee hike will solve a lot of <br/>problems. I seriously doubt it. Unless there are above pre-conditions, this fee hike <br/>should not be approved.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480209464", "lastName": null, "legacyId": null, "modifyDate": "2007-02-21T15:46:31Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-21T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-18T01:56:52Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous ", "trackingNbr": "80209464", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0715/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0715/attachments"}}}}}