{"data": {"id": "USCIS-2006-0044-0306", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0306"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Dear Sir or Madam :<br/><br/>The proposal thoroughly explains why the fee raises are required. While I<br/>sincerely appreciate the fine work done by the USCIS in an important issue like<br/>immigration, I am also of the view that a 66% raise is unjustified. Immigrants<br/>come to the US for freedom and expression of their skills. The cost of a H1B is<br/>already around $2500 and a cost of securing a Green card almost double that.<br/>Though the USCIS fee in the latter is not a big component, it will become one if<br/>the fee raise is implemented. A skilled immigrant worker is contributing to the<br/>economy by paying taxes and by bridging the shortage of skills. Most H1B<br/>applicants return to their home country after their term but leave all the<br/>Soc-Sec, Medicare contributions unclaimed. It should also be noted that skilled<br/>non-immigrants often are young and single falling in to the 30% tax bracket.<br/>Their tax contribution is significant.<br/><br/>The country needs to attract skilled labor force. The proposed fee raise will<br/>prove a dampener and companies will feel more and more discouraged to hire<br/>foreign labor. A foreign employee will also feel guilty that he costs more to<br/>the company than a US citizen. Both factors are not healthy in a competitive and<br/>a globalized world. While all other fee raises are palatable, the I-485 raise<br/>from $325 to over $900 is too much. These significant fee raises will be the<br/>&quot;last straw in the camel&#39;s back&quot; for an immigrant after waiting five or six<br/>years for his green card! By the time the skilled immigrant has reached the<br/>I-485 stage, he or she would have contributed over $100,000 in income taxes<br/>alone, leave aside the economic, demographic and skill contributions.<br/><br/>The DOL is now clamoring to impose a PERM fee for labor certifications. The<br/>drastic USCIS fee raise will only compound to the problems of potential<br/>immigrants who are already in trauma due to long wait periods, employer&#39;s<br/>business changes, problems in uniting their families etc. The United States is a<br/>great country on the planet and its greatness stems from the equal opportunity<br/>it provides for everyone who knocks her doors. So I request the Director to<br/>kindly look at the problem in an integral way from all standpoints and implement<br/>a fair, reasonable and phased increase in filing fees.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480201a22", "lastName": null, "legacyId": null, "modifyDate": "2007-02-12T19:47:47Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-12T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-11T21:08:16Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous", "trackingNbr": "80201a22", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0306/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0306/attachments"}}}}}