{"data": {"id": "USCIS-2006-0044-1258", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1258"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I have two main comments to make, and a suggestion on what to do instead of a <br/>fee increase.<br/><br/>1. I find it hard to believe that the last time fees were increased was 1998.  When <br/>my husband and I applied to change his status from fiance visa to permanent <br/>resident, we sent in fees as indicated on forms and had our paperwork sent back <br/>with a notice we didn&#39;t pay enough, even though we paid fees as listed on the <br/>forms.  We were married and applied in 2001, so unless we were given REALLY <br/>antiquated forms, I could swear they&#39;ve increased fees more recently.<br/><br/>2. Is their service going to improve as drastically as the fees are increasing? <br/>Including the above listed incident, our paperwork was sent back to us three <br/>times.  It was sent back the first time because we sent it to the wrong address.  <br/>We followed the directions indicated on the forms.  We called for help and after <br/>being on hold for two hours, were given a different address to send the forms.  The <br/>forms came back again, BECAUSE THEY WERE SENT TO THE WRONG <br/>ADDRESS!  This address was given to us by the representative over the phone!  <br/>By this time we were nearing our filing deadline.  We checked the forms again and <br/>online and there was only one address left by this time, so we sent it in. Finally it <br/>was to the right place.  To add insult to injury, after waiting 28 months, we were <br/>granted our interview.  The day of our interview we went where we were supposed <br/>to go in Chicago.  We went to one floor to wait and were told to hand our interview <br/>letter in.  They would call us to go upstairs when it was our turn.  We were there <br/>about an hour early.  After waiting about two hours, and noticing people who had <br/>come in after us were getting called before us, I went to the window to try to ask <br/>what happened.  I was very rudely told to sit down.  I was treated like I was <br/>threatening the woman working at the window instead of trying to ask a question.  <br/>After another twenty minutes there was a shift change.  I again asked and this <br/>woman told me she would look into it.  We were the next people called.  We got <br/>upstairs and no sooner sat down then we were called for our interview.  The <br/>woman who called us demanded to know why we were late.  She said it was the <br/>third time they called us, and were going to consider our <br/>appointment &#39;abandoned.&#39;   I explained how after we turned in our letter downstairs <br/>their people seemed to lose it, and I explained how when I tried to ask about it I <br/>was yellled at.  Her response was &quot;Oh.&quot; No apology or anything, even though our <br/>being late was their fault.   Will these highly inflated fees be used for better <br/>customer service?  <br/><br/>Instead of increasing fees and penalizing people who are following the rules, how <br/>about charging fines to the illegal immigrants who enter the country?  Don&#39;t spend <br/>money to detain and deport them, especially if they have caused any problems. <br/>Just make them pay the fees they should have paid to enter the country legally, at <br/>the &#39;priority processing&#39; rate, of course, plus a fine of about $5000.00 each.  If they <br/>don&#39;t have the cash, refer them to a bank to borrow the money.  Then, we could <br/>save money by not detaining and deporting them, we could get money from those <br/>entering illegally, they could become legal, and they&#39;d start out in massive debt in <br/>the true American spirit.  This would solve many aspects of the problems the US <br/>Citizenship and Immigrations Services are facing.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021292d", "lastName": null, "legacyId": null, "modifyDate": "2007-03-13T15:35:55Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-13T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-12T01:59:17Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous", "trackingNbr": "8021292d", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1258/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1258/attachments"}}}}}