{"data": {"id": "USCIS-2006-0044-0328", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0328"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "<br/><br/> <br/>Dear USCIS,<br/><br/>This is in reference to the proposed increase in fees.  I, and many other<br/>immigrants that I know of, SUPPORT IT, for reasons that will become clear shortly.<br/>   <br/>----<br/>ABSTRACT: A more efficient but slightly &quot;costlier&quot; immigration service immensely<br/>benefits the common applicant, both because of timelier services, and also<br/>because of elimination of the very expensive lawyers fees.  The only parties<br/>that lose from higher USCIS fees are the lawyers.   These are the same lawyers<br/>who organize a wide campaign of comments submitted to you opposing such fees.<br/><br/>----<br/><br/>Details: The current USCIS fees are completely dwarfed by the immense fees that<br/>the typical  immigrant pays to the lawyers.  These low fees ensure a very<br/>haphazard and timeconsuming service by USCIS.  Because of that, one tiny mistake<br/>can cause an immigrant many years of delay, or even denial of immigration benefits. <br/><br/>As a result of this, the immigrant feels compelled to hire lawyers, who tend to<br/>be very expensive.   Thus, the current &quot;cheap&quot; fees translate into very<br/>expensive fees for the immigrant.  The lawyers benefit immensely.  The USCIS<br/>loses because of a huge workload with no funding.  The immigrant loses, BOTH<br/>because of dismal service from USCIS, as well as due to paying immense fees to<br/>lawyers.<br/><br/>A simple solution to all this is to make USCIS more efficient, by providing<br/>funding for the process through raised fees.  Because of increased efficiency,<br/>the immigrant will feel less compelled to hire expensive lawyers. The immigrant<br/>benefits both from increased efficiency, as well as save a lot of money.  The<br/>proposed increase in fees is completely dwarfed many, many times over by the<br/>amount of money that would be saved if a lawyer did not have to by hired. USCIS<br/>will benefit by becoming a more efficient agency that will be able to pay for<br/>its own funding. The lawyers, the middlemen, will be increasingly &quot;cut out.&quot;<br/><br/>The only &quot;losers&quot; in this new scenario are the lawyers.  These same lawyers are<br/>the ones who are aware of such news much more than immigrants and citizens are.<br/>They organize massive campaigns, and encourage all their subscribers to oppose<br/>USCIS fees.  As a result, you will see a disproportionately  large number of<br/>&quot;opposition&quot; comments.<br/><br/>As you read them, I just want you to keep in mind that they represent the<br/>viewpoint of the average lawyer, not the average immigrant.  <br/><br/>The average immigrant pays thousands of dollars in lawyers&#39; fees, and because of<br/>USCIS&#39;s inefficiency, waits tens of years to see their loved ones, wastes<br/>thousands more dollars in flights to and from back home, and wastes another<br/>thousands of dollars in international phone calls made to loved ones.  This<br/>immigrant would love nothing more than a chance to shorten the above expensive,<br/>agonizing and time-consuming process for the simple cost of a few scores of<br/>extra dollars per application. He/she saves a lot of money in the process, so<br/>the cost is offset many times over.<br/><br/>As an immigrant, I thank you for proposing an increase in fees, and hope to see<br/>a more efficient USCIS in the process.<br/><br/> <br/><br/>USCIS-2006-0044-0001<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064802033e5", "lastName": null, "legacyId": null, "modifyDate": "2007-02-12T21:27:05Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-12T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-12T21:09:46Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Abhinau Banguly", "trackingNbr": "802033e5", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0328/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0328/attachments"}}}}}