{"data": {"id": "USCIS-2006-0044-2768", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2768"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "April 2, 2007<br/><br/>Director, Regulatory Management Division<br/>US Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Ave. NW, 3rd floor<br/>Washington DC 20529.<br/><br/>RE:  DHS Docket # USCIS-2006-0044<br/>Proposed rule? Adjustment of the Immigration and Naturalization Benefit <br/>Application and Petition Fee Schedule<br/><br/>On behalf of the Legal Aid Foundation of Los Angeles, I am writing to strongly <br/>oppose the increase to immigration and naturalization fees, the elimination of <br/>VAWA self-petitioning fees, and changes to the fee waiver system that US <br/>Citizenship and Immigration Services (USCIS) proposed on February 1, 2007.  <br/><br/>The Legal Aid Foundation of Los Angeles (LAFLA) is the frontline law firm for low-<br/>income people in Los Angeles. LAFLA promotes access to justice, strengthens <br/>communities, fights discrimination, and effects systemic change through <br/>representation, advocacy, and community education.  LAFLA assists <br/>undocumented victims of crime with immigration relief that is available to them; <br/>specifically we assist victims with petitions under the Violence Against Women <br/>Act (VAWA), U visas, T visas, asylum and naturalization.  <br/><br/>Eliminating Fees for VAWA Self-petitioners<br/>While we work with immigrant survivors of domestic violence and other crimes, we <br/>oppose eliminating the self-petition fee, particularly in relationship to eliminating <br/>fee waivers as an option outside of the self-petitioning context.  <br/><br/>First of all, many victims of domestic violence gain status outside of the self-<br/>petitioning context, including through family-based immigration and employment.  <br/>Further, self-petitioners who separate from their abusers find protection in families <br/>and communities that will be harmed by the general fee increases, which in turn <br/>harms self-petitioners.  Finally, some of our self-petitioners can afford to pay the <br/>fees. Since USCIS argues that it needs fees to ensure efficient adjudication, self-<br/>petitioners who can afford to pay the fees should do so.  Those that cannot should <br/>be able to request a fee waiver.<br/><br/>Do Not Erect a Financial Fence to Legal Immigration Status<br/>Many of the immigrants and refugees we work with on a daily basis already <br/>struggle to pay immigration fees.  The steep increases proposed by USCIS, which <br/>in some cases double the current fee, would put the goals of gaining permanent <br/>resident status, reuniting with family members, and ultimately becoming a US <br/>citizen farther out of reach.  Drastically enhanced fees, coupled with restrictions <br/>on fee waivers, will force many hard-working immigrants into undocumented <br/>status.  These otherwise-eligible immigrants will become more vulnerable to <br/>exploitation and crime victimization and less able to contribute to our communities <br/>and formal economy.  This result confounds attempts at immigration reform by <br/>forcing people to become undocumented instead of encouraging them to gain <br/>secure legal status.<br/><br/>The proposed fee for naturalization is particularly jarring.  As recently as 1998, the <br/>cost to apply for citizenship was $95.  In 2002, after the Bush Administration took <br/>office, the costs (including biometric fees) went up from $250 to $310.  The total <br/>fees are now $400, a fourfold increase in the past eight years.  Now USCIS is <br/>proposing a further increase of 70%, to $675.  An immigrant working at a <br/>minimum-wage job would need to work for more than three weeks and save all of <br/>his earnings in order to pay this fee.<br/><br/>Even more startling is the proposed cost of filing for adjustment of status, which <br/>for many immigrants is the first step on the road leading to US citizenship.  That <br/>application has risen from $130 in 1998 to $325 today, plus $75 for biometrics.   <br/>Under the proposed rule, the price will rise to $905 plus $80 for biometrics.  In <br/>other words, it will cost nearly $1,000 for an immigrant to get a green card and <br/>start the five-year countdown to citizenship.  A minimum-wage immigrant worker <br/>would need to save a full month?s pay to afford the proposed fee.<br/><br/>Part of the justification for such a huge increase in the cost of obtaining a green <br/>card is that USCIS will no longer charge fees for ?interim benefits? associated with <br/>an application for a green card, such as employment authorization and permission <br/>to travel abroad.  Because of the costs of these interim benefit applications, <br/>USCIS estimates that the real cost of an adjustment application is currently $800 <br/>and therefore, the increase is only $105 over what persons pay today.  These <br/>interim benefits were necessary when USCIS took several years to process <br/>adjustment applications.  However, USCIS states that it ?has already substantially <br/>improved service levels, achieving the President?s goal of six months processing <br/>times for immigration applications in October of 2006.?  (Building an Immigration <br/>Service for the 21st Century).  If this is true that USCIS has achieved a six month <br/>processing time, the need for interim benefits has been eliminated, for the most <br/>part and the real cost of an adjustment application is not $800 as USCIS states.  <br/>The cost is much less and therefore, the increase in the fee is not $105 as USCIS <br/>states, it is much greater.  Additionally, the experience at our office is that USCIS <br/>has decreased its processing time and is processing most adjustment <br/>applications within 6 months.  Therefore, as previously stated, USCIS?s statement <br/>that the fee increase for adjustment applications is only $105 is not accurate.<br/><br/>USCIS claims that the fee increase is necessary to improve service.  USCIS <br/>definitely needs to improve service, as shown by the continuing backlogs in <br/>application processing and the months-long (even years-long) delays caused by <br/>security checks.  Last October, the Government Accountability Office reported <br/>that the agency had lost track of 110,000 files needed to process citizenship <br/>cases.  We applaud USCIS?s efforts to improve service.  We nevertheless believe <br/>that the burden of paying for such improvements should not rest solely with <br/>immigrants who are already struggling to pay agency costs and receiving poor <br/>service.  <br/><br/>Fair Fee and Waiver Structure<br/>The proposal to increase fees by such large percentages is especially alarming <br/>given that USCIS has never developed an application form for needy persons to <br/>request a fee waiver.  USCIS states that it proposes to modify and clarify eligibility <br/>for an individual fee waiver but it does not clarify anything.  It does not propose to <br/>develop an application form.  And it does not state anything different than what <br/>has been stated in past field guidance memoranda.  See Interim Field Guidance <br/>on granting fee waivers pursuant to 8 CFR 103.7(c) issued by Michael A. <br/>Pearson.  This field guidance issued in 1998 lists the factors that USCIS will <br/>consider in adjudicating fee waiver requests.  These are the same factors that <br/>USCIS lists again in this most current fee increase proposal.  The only <br/>modification that USCIS proposes with regards to fee waivers is the elimination of <br/>them for certain applications.<br/><br/>USCIS gives no information about how many fee waivers it grants nor any <br/>information on how it adjudicates fee waivers.  Given that USCIS states that there <br/>has been an increase in fee waivers, both in volume and as a percentage of <br/>applications filed and it states that it expects to receive more fee waiver requests <br/>after fees are increased, it is incumbent on USCIS to establish a clear manner for <br/>persons to request fee waivers and clear standards on how it grants fee waiver <br/>requests.    <br/><br/>The proposal to eliminate fee waivers for certain applications is also particularly <br/>alarming.  USCIS proposes to eliminate few waivers for form I-485, applications to <br/>adjust status.  Our agency handles hundreds of cases a year that are filed under <br/>the immigration provisions of the Violence Against Women Act and many of these <br/>clients cannot afford to pay the fee for form I-485.  When appropriate, applicants <br/>request a fee waiver.  The elimination of fee waivers for adjustment applications <br/>would eliminate the ability of many of these vulnerable immigrants to adjust their <br/>status and continue on their path of self-sufficiency and citizenship and is a <br/>mistake.    USCIS argues, in the proposed rule that it is inconsistent to allow for <br/>fee waivers for adjustment applications because applicants must establish that <br/>they are not a public charge.  This argument does not apply to persons who have <br/>approved I-360s as battered spouses or children.  Such persons are VAWA self-<br/>petitioners and under INA section 212(a)(4)(C)(i) applicants who are adjusting <br/>based on an approved self-petition are exempt from the public charge ground of <br/>inadmissibility.  In fact, Congress has specifically allowed VAWA self-petitioners <br/>to qualify and receive public benefits, including cash aid, in order to aid in their <br/>escape of the battering situation.  Further, their receipt of public benefits is not a <br/>factor to be considered when determining admissibility or eligibility for an <br/>immigrant visa.  INA section 212(s).    <br/><br/>Refugees, asylees, and registry applicants are also exempt from establishing that <br/>they are not likely to become a public charge.<br/><br/>USCIS states that a fee waiver based on inability to pay implicates the public <br/>charge ground of inadmissibility.  This is not necessarily true.  Establishing <br/>inability to pay and obtaining a fee waiver does not necessarily mean that the <br/>applicant will not be able to establish that he is not a public charge.  This principle <br/>was recognized in the Interim Field Guidance on granting fee waivers pursuant to <br/>8 CFR 103.7(c) issued by Michael A. Pearson.  Determination of whether <br/>someone is likely to become a public charge is a prospective test.  Because <br/>someone cannot pay a fee now does not necessarily mean that he will not be self-<br/>sufficient in the future.  Given the visa quota system and processing backlogs, <br/>many regular family-based immigrant applicants who need fee waivers at the time <br/>of application may be able to overcome public charge concerns by the time <br/>USCIS adjudicates their adjustment applications.<br/><br/>What self-petitioners need, like other immigrants, are a fee structure and a <br/>generous fee waiver system that reflect their financial reality. These principles <br/>should apply not just to self-petitioning, but to fees for work authorization, <br/>adjustment of status and other matters associated with obtaining self-petitioning <br/>status and permanent residence. This is how the current system works, and it <br/>works well for self-petitioners. Eliminating or restricting access to fee waivers for <br/>all related applications will undermine Congress? goal to protect and provide <br/>secure status to immigrant survivors of domestic violence and other crimes.<br/> <br/> USCIS should retain and improve the existing fee waiver system, not restrict it.  <br/><br/>Most basically, immigration and citizenship are public goods that benefit our <br/>entire country and that we as a nation should help pay for.  Immigrants bring their <br/>talent and hard work to our economy.  They pay taxes and help revitalize our <br/>communities.  In becoming citizens, immigrants demonstrate their strong <br/>commitment to their new home country by learning English, gaining knowledge <br/>about American history and government, and swearing allegiance to the United <br/>States.  It is little wonder that newly naturalized citizens, eager to participate in <br/>our democracy, consistently vote at higher rates than other citizens.  We should <br/>be encouraging immigrants to become part of our community by gaining legal <br/>status and becoming citizens, not setting up barriers that block their path and <br/>keep them out.  <br/><br/>USCIS argues that it has no other option than raising fees if it wants to cover its <br/>costs.  In fact, there are no laws that require USCIS to fund all of its operations <br/>through fees.  Nothing prevents USCIS from pursuing other sources of revenue, <br/>including asking Congress for appropriations.  Indeed, USCIS has sought and <br/>received Congressional funding several times in the past<br/><br/>For all these reasons, the proposal to increase immigration fees and change the <br/>current fee waiver system is imprudent and ineffective in accomplishing the goals <br/>the DHS.  We urge USCIS to reconsider this proposal, to retain the existing fee <br/>waiver system and fees for VAWA self-petitioners, and to seek other sources of <br/>funding for its operations, rather than shift the burden to selected groups of <br/>immigrants.  Thank you for your consideration.<br/> <br/>Sincerely,<br/><br/>Michael Ortiz<br/>Directing Attorney, Immigration Unit<br/><br/>Susana Martinez<br/>Staff Attorney, Immigration Unit<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021ed73", "lastName": null, "legacyId": null, "modifyDate": "2007-04-03T14:26:21Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T16:00:42Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Michael Ortiz/Susana Martinez", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Anonymous", "trackingNbr": "8021ed73", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2768/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2768/attachments"}}}}}