{"data": {"id": "USCIS-2006-0044-2499", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2499"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I wish to comment on USCIS-2006-0044.  My wife and I have adopted two children <br/>from Russia in 2003 and we are in process of adopting a third right now.  I have <br/>specific comments regarding two fees which I have experienced as an adoptive <br/>parent:  (1) Petition to Classify Orphan as an Immediate Relative/Application for <br/>Advance Processing of Orphan Petition (I-600/I-600A); and (2) Application for <br/>Certification of Citizenship (N-600).<br/><br/>I-600/600A.<br/>1.  The costs for this are now $545 and are requested to increase to $670, an <br/>increase of 23%.  This is on top of a 352% increase over the past 13 years ($155 <br/>to $545).  What has changed in processing orphan adoption requests that <br/>requires a 23% increase in two years?  <br/>2.  It appears that the stated ?determination? costs for I-600 are SIGNIFICANTLY <br/>higher than for other applications with seemingly much higher Homeland Security <br/>risk.  I do not believe that adopting my 4 year old boy from Russia is in the same <br/>class as other applications such as I-129/129F/130.  Is USCIS doing too much <br/>work in the wrong area?<br/>3.  Congress has authorized USCIS to recoup the costs of certain programs <br/>(example: asylum) by charging extra on other immigration fees.  I don?t have a <br/>gripe with burdening immigrant adults with such fees, but asking adoptive US <br/>citizen parents to bear such costs is distressing.<br/><br/>N-600<br/>In it current form, I am VEHEMENTLY OPPOSED to any increase in this fee.  It is <br/>proposed to go from $255 to $460 (an 80% increase!).  My wife and I have two <br/>children adopted from Russia that automatically received citizenship in 2003 when <br/>they entered the country.  They subsequently (and automatically) received FREE <br/>Green Cards (a very illogical step since they were not resident aliens, but <br/>citizens).  In November, 2006, I applied for and received US Passports for them <br/>(very quickly, I might add).  In December 2006 I paid $255 for each of my <br/>children?s Certificates of Citizenship.  I am projected to receive them in June <br/>2007.  USCIS?s justification for the increase is a large ?determination? cost.  In our <br/>case, there is no determination cost at all ? the information is already in USCIS <br/>computers.  All that is required is to print and mail the certificates.<br/>After 2004, USCIS recognized the inequity and started issuing Certificates of <br/>Citizenship to all new foreign adoptees automatically at no charge.  But that <br/>leaves a vast pool of Adoptive Parents who adopted before 2004, who are now <br/>paying $255 and will soon have to pay $460 if they want Certificates of Citizenship <br/>for their children.  Until this inequity is corrected, I am very opposed to an <br/>increase.<br/><br/>Finally I have a general comment.  Adoptions cost increases are far exceeding the <br/>inflation rate for a variety of reasons, but fee increases as discussed above are <br/>part of the problem.  My wife and I are upper middle class ? we ONLY had to take <br/>a second mortgage on our home to adopt!  For lower middle class or the poor, <br/>adoption is becoming almost impossible.  Even the IRS Adoption Tax Credit only <br/>covers one third the cost of a foreign adoption (our current Russian adoption will <br/>cost us $33,000).  Even worse, some lower middle class and poor will be unable <br/>to take advantage of the tax credit if their tax liability is low.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021db4c", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:18:39Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T12:12:57Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Mark Collins", "trackingNbr": "8021db4c", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2499/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2499/attachments"}}}}}