{"data": {"id": "USCIS-2006-0044-0703", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0703"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "My husband and I are adopting a child from China.  We had completed our<br/>paperwork and have been waiting for a match for almost 12 months now.  During<br/>our wait, we realized that our time to wait for a match was likely going to<br/>exceed the time limit for the I-171H.  In response to this, we appealed to our<br/>family and friends for help in appealing to our government.<br/><br/>We specifically wrote letters to our congressman, Rep. Tom Tancredo; our<br/>senator, Senator Wayne Allard;  the director of the Denver District office of<br/>USCIS, Mr. Mario Ortiz,  and the secretary of Homeland Security, Secretary<br/>Michael Chertoff.  In essence, we received little in return.  Our elected<br/>officials told us there was nothing they could do.  We received a form letter<br/>from Mr. Ortiz and the person who responded on Secretary Chertoff&#39;s behalf - the<br/>same EXACT form letter was received by family and friends who also appealed on<br/>our behalf.  No letter we received addressed our concerns directly and in fact<br/>implied that we should have adopted domestically instead.<br/><br/>We explained that having couples, like us, complete the entire process for a new<br/>I-171H put additional burdens on staff.  We explained that this process only<br/>served as a penalty for couples, like us, who have chosen to adopt<br/>internationally when the delay to complete the adoption was not our fault.  In<br/>fact, we pointed out according to publication M-249, The Immigration of Adopted<br/>and Prospective Adoptive Children, an international adoption is deemed abandoned<br/>if not completed in the requisite timelines.  We have not chosen to abandon our<br/>petition, we are merely waiting and have no control over a foreign government.<br/><br/>The validity of an I-171H was not always 18 months.  It was, at a time in<br/>history, only valid for only 12 months. This timeframe was considered inadequate<br/>and it was changed to 18 months.  Today, this 18-month time period is equally<br/>inadequate yet nothing is being done to address this issue.<br/><br/>Today, I learned that USCIS wishes to increase their fees for fingerprinting and<br/>for the processing of the I-600A, which must be filled out prior to receiving an<br/>I-171H.  There are many feelings rushing through me; omitting expletives, the<br/>two prominent ones are indignation and frustration.<br/><br/>The fee increase is not necessary at this time and amounts to a penalty on those<br/>couple who have chosen to adopt internationally.  However, if a fee increase is<br/>inevitable, then perhaps the length of time the I-171H is valid should be<br/>extended to 24 months and, for those who, like us, currently hold a valid<br/>I-171H, be grandfathered into that extended time frame.<br/><br/>Thank you for your time.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480209344", "lastName": null, "legacyId": null, "modifyDate": "2007-02-21T15:45:15Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-21T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-17T00:37:48Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Christine M. Swenson", "trackingNbr": "80209344", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0703/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0703/attachments"}}}}}