{"data": {"id": "USCIS-2006-0044-1810", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1810"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Increasing the USCIS costs for adoption applications by an average of 66% is <br/>unjustifiable and places an undue burden on applicants. <br/><br/>A USCIS document fee update was done in 2005, less than 2 years ago. If all the <br/>additional costs that have been recently identified, and are the basis for the current <br/>fee increase, did not exist in 2005, it does not appear that an effective cost-benefit <br/>analysis was done before starting any new procedures, new requirements, or <br/>expanding existing services between 2005 and the present. If these additional <br/>costs existed in 2005, why weren&#39;t they addressed then? <br/><br/>In the Dept of Homeland Security Document 8 CFR Part 103, it is stated that the <br/>fee increase will be used to enhance services that range from increasing staff to <br/>technology investments to infrastructure improvement. Fees will continue to be <br/>used to recover costs to services for non-paying users. This sounds great; <br/>however, the problem in always in the details. Why isn&#39;t there sufficient workforce <br/>to meet workload demands? Is the solution to simply hire more people, at a huge <br/>cost, or make the current workforce more productive? Why is &quot;making a <br/>determination&quot; so extremely expensive? (Table 10) How can this cost be reduced? <br/>Why is &quot;complexity&quot; so expensive? Is it in part due to organizational dysfunction <br/>which makes completing a dossier a chaotic procedure with one office not <br/>communicating with another?  All I see are macro level discussions of agency <br/>performance, but we all know that it is not only the system, but the parts and how <br/>they work together that makes a big impact on performance. I don&#39;t see much <br/>desire in the document to improve efficiency and effectiveness. Rather, I see <br/>justification for rising costs. <br/><br/>Was there a cost-benefit analysis done before security, as it is currently defined, <br/>was made a priority for the USCIS and the how this would be funded. It appears <br/>not, because according to the document, a $1 billion funding gap now exists. <br/>Before a massive increase in biometric requirements or background checks was <br/>identified as necessary for security, who figured out the costs? &quot;Certain <br/>immigration benefit determinations have become more complex....with new <br/>programs and eligibilities.&quot; Ok, this makes sense, but who pays for it? Why <br/>should the lack of analyses and planning for this be passed on now to adoption <br/>applicants, when they already pay taxes? <br/><br/>Obviously a reduction in services is not desirable and reducing backlog is very <br/>important to both the United States Government (USG) and USCIS clients/users. <br/>Hiring new staff and using electronic solutions are effective solutions to improved <br/>services and increased security. However, raising international adoption fees by <br/>over 60% is not the solution to paying for it. Those families who are adopting are <br/>already making huge sacrifices to adopt; it is very expensive, the administrative <br/>procedures are a nightmare, and the whole process carries a huge emotional <br/>investment which sometimes does not end happily. They are creating families and <br/>need all kinds of support for that; they do not need increased expenses to what is <br/>already, on average, $20,000.<br/><br/>The USG has to juggle many priorities. If homeland security is so important to the <br/>Administration, and USCIS has a role to play in that, then the USG needs to make <br/>budget decisions in line with that priority. It appears that this is not the case with <br/>USCIS with the $1 billion budget gap. <br/><br/>The private sector can pass on its costs to the consumer who makes the choice <br/>to purchase a good or service. The public sector cannot operate on the exact <br/>same principal as it results in a burden on individual users, who have no other <br/>choice. Adoption applicants and well as all other users of USCIS forms have no <br/>choice in the matter. Cost recovery is a good tool, not a guiding principal. <br/><br/>US Citizens pay taxes and it is the responsibility of the USG, no matter what <br/>administration is in office, to analyze and decide upon the most efficient and <br/>equitable use and redistribution of those resources. If the IEFA needs more funds <br/>to operate, then the Administration needs to allocate more funds so that it can <br/>meet the needs of USCIS customers, performance standards, and its institutional <br/>goal of increasing national security. Without being sarcastic, the amount spent <br/>monthly in Iraq and Afghanistan and Israel and Egypt and on other foreign policy <br/>goals is hindering the proper functioning of the USG on its own soil. Budgets are <br/>finite; income is finite, and expenses need to be finite, also. Where are the USG?s <br/>priorities?<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021a5dd", "lastName": null, "legacyId": null, "modifyDate": "2007-03-28T16:49:49Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-28T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-27T12:20:53Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Kathryn M. Lane", "trackingNbr": "8021a5dd", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1810/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1810/attachments"}}}}}