{"data": {"id": "USCIS-2006-0044-0761", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0761"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "We are writing to you and your department both as US citizens and parents-to-be<br/>of a child from China regarding current USCIS regulations that affect the<br/>process and cost of China adoption. This letter contains a little bit about us<br/>and a proposal for changing the current system. <br/><br/>Our dream of completing a family has been, and continues to be, a ?long and<br/>winding road?. To fulfill our dream we chose China. At times we have found the<br/>process to be both difficult and confronting. We have had to submit to the<br/>scrutiny of our adoption agency, our state, our federal government, and the<br/>Chinese government. When we gave birth to our first child, we did not have a<br/>social worker come to our house to ask us questions about our childhood, our<br/>marriage, and our parenting ideas. We did not have to provide everyone with<br/>proof that we were not criminals, and that we had not ever abused, neglected or<br/>abandoned a child. We did not have to prove that we were physically and<br/>financially healthy and stable. But, this is only a part of what it takes if you<br/>want to parent a child from China! The investment of our time, money and<br/>emotions has been substantial. We have followed all the rules of both the United<br/>States and the Peoples Republic of China. We filled out the dozens of required<br/>forms, ordered the required documents, prepared our dossier and immigration<br/>files and sent them to China. Finally, after all this, we have allowed ourselves<br/>to be filled with the myriad of hopes, fears, dreams and desires of all waiting<br/>parents! <br/><br/>As part of this process we are required to obtain USCIS approval (form<br/>I-171H/I-797C). We originally applied for the I171-H in the Fall of 2005.  Only<br/>after our home study was completed were we given an appointment for<br/>fingerprinting that was more than a month out.  Nearly 2 months after<br/>fingerprinting we received our valid I171-H on March 24 of 2006. According to<br/>current regulations it is valid for 18 months (September 2007). Until recently,<br/>this approval period served families in the process of China adoption quite<br/>well. They were able to receive their child referral, travel to China, receive<br/>their child and submit an I-600 in Guangzhou for their child?s visa. This is<br/>what we had been looking forward to for our family, our adoption journey.<br/>Unfortunately, China is now experiencing a significant increase in the length of<br/>time it will take to match us with our child. <br/> <br/>This increased waiting timeline has occurred quickly and with dramatic effects.<br/>It is a certainty that every family who has a dossier in China will experience<br/>the expiration of their: 1) fingerprints (valid for 15 months) and I-171H/I-797C<br/>approval (valid for 18 months). The cost, both emotionally and financially of<br/>filing a new I-600A will be very high. The cost to your USCIS offices for<br/>processing a new I-600A will be very costly and time consuming. House Resolution<br/>628 is before the Judiciary Committe to extend the I-171H.  However, if the bill<br/>does not pass, the addition burden imposed by the higher fees will negatively<br/>affect our family as well as thousands of others.  In addition to the cost of a<br/>new I-171H, we will have to pay $145 more that it would have this year.  Since<br/>the USCIS does not directly control the length of time the I171H is valid,<br/>please help by controlling the cost of reapplication.  I would propose a reduced<br/>rate for those who&#39;ve already applied and received a valid I171H.  Given that it<br/>took several months to receive the I171-H in the first place, we believe that<br/>another $670 reapplication fee is simply disproportionate and excessive.<br/>Increasing the cost on us now adds to the pain.<br/> <br/><br/>Thank you for your time and thoughtfulness about this matter. <br/>Sincerely, <br/>Timothy &amp; Scarlet Thomas<br/>Spartan_tim@yahoo.com<br/>Scarlet_thomas@yahoo.com<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020a095", "lastName": null, "legacyId": null, "modifyDate": "2007-02-21T16:14:55Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-21T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-20T22:40:56Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Timothy J. Thomas", "trackingNbr": "8020a095", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0761/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0761/attachments"}}}}}