{"data": {"id": "USCIS-2006-0044-0075", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0075"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "As legal immigrants working in this country, we strongly oppose USCIS new fee<br/>plan. This plan attempts to enhance our hardship and agony caused by this<br/>agency?s inefficiency in processing immigration petitions. For example, simply<br/>for an I-485 adjustment of status application for permanent residence or N-400<br/>naturalization for citizenship, the USCIS plus the FBI name check can delay the<br/>adjudication for 6 to 10 years! This unreasonable delay is not only a<br/>significant damage to the lives of up to a million legal immigrants, but also a<br/>serious harm to the competence and national interest of this country. <br/><br/>The USCIS has already raised the fees to a level causing heavy financial burdens<br/>on our families. As legal immigrants, we pay all kinds of taxes. Each cent after<br/>the taxes is needed by our daily life. However, the USCIS is planning to collect<br/>more fees from us in the name of funding the DHS security program and reducing<br/>the backlogs. In the past, the USCIS and its predecessor INS, raised fees<br/>several times while promising to deal with substantial backlogs, but the<br/>increased fees have done nothing to alleviate these problems. By the end of 2006<br/>FY, the USCIS claimed they had significantly reduced the backlogs, but the fact<br/>is: Millions of immigrants waiting for the quota and those stuck in the FBI name<br/>check are simply neglected in their calculations. The DHS security programs<br/>shouldn?t be supported solely by legal immigrants. The legal immigrants cannot<br/>afford the bonus of the USCIS employees any more. The USCIS need a true reform<br/>for efficiency instead of confiscating more money from legal immigrants who have<br/>already suffered too much under this<br/>broken immigration system. <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801f9a17", "lastName": null, "legacyId": null, "modifyDate": "2007-02-02T16:09:18Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-02T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-02T00:30:18Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous", "trackingNbr": "801f9a17", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0075/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0075/attachments"}}}}}