{"data": {"id": "USCIS-2006-0044-2852", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2852"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "April 2, 2007<br/><br/>Director, Regulatory Management Division<br/>U.S. Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Avenue, NW, 3rd Floor<br/>Washington, DC 20529<br/><br/>Re:  DHS Docket  No. USCIS-2006-0044<br/><br/>Dear Director:<br/><br/>On behalf of the Association of Community Organizations for Reform Now (ACORN),<br/>I write to express my opposition to the United States Citizenship and<br/>Immigration Services? (USCIS) proposed rule that would significantly increase<br/>fees for naturalization and immigration applications.  <br/><br/>ACORN, the nation?s largest community organization of low- and moderate-income<br/>families, has approximately 300,000 members organized into neighborhood chapters<br/>in more than 110 cities across the country.  Since 1970, ACORN has advocated and<br/>organized around economic and social justice issues, including those that affect<br/>hundreds of our immigrant members and their families.  Recently, our members<br/>have submitted hundreds of comments to USCIS expressing their concerns with the<br/>agency?s proposal, especially for those immigrants who will soon be eligible to<br/>become citizens and will face prohibitive fees to naturalize.  Our comments<br/>focus on the potential impact the agency?s proposed fee structure would have on<br/>low-income immigrants and outlines recommendations we encourage USCIS to consider.  <br/><br/>Agency?s proposed rule adversely affects low-income immigrants<br/><br/>As a nation of immigrants, we should be making it easier for qualifying<br/>immigrants to become Americans, not harder ? especially if they have played by<br/>the rules and have taken all the proper steps needed to become lawful U.S.<br/>citizens.  The fee increases proposed by USCIS are prohibitive for many working<br/>families. Under the current proposal, an application for permanent residency<br/>would increase from $325 to $905 ?nearly a 300% increase. In addition, a<br/>citizenship application (N-400) would virtually double to $595, and fees for<br/>fingerprinting would increase 14%. For example, a family of four would have to<br/>pay approximately $2,430 in application and processing fees to become legal<br/>citizens of the U.S.  This is in addition to the English and civics classes many<br/>immigrants need to take in order to prepare for their naturalization exams.<br/><br/>Moreover, USCIS has chronically delayed the processing of naturalization<br/>applications.  The backlog of naturalization applications is a serious problem<br/>throughout the country.  In its report, Atrapado! Caught in the Backlog: <br/>Immigrant New Yorkers? Endless Wait for Citizenship, New York ACORN concludes<br/>that the backlog has been most severe in New York where, according to USCIS,<br/>more than 126,000 cases remain pending, almost one-fifth of the total number of<br/>outstanding cases nationwide.  Although it serves more immigrants than any other<br/>USCIS District Office in the country, the New York City District Office has one<br/>of the longest processing times of any USCIS subdivision.  <br/><br/>The situation in New York demonstrates the barriers faced by immigrants hoping<br/>to become citizens, many of whom have already faced many hurdles before they<br/>enter the naturalization process.  The growing numbers of immigrants, combined<br/>with increasing complexities of immigration law and the large backlog at USCIS,<br/>have fueled demand for immigration-related legal assistance in many cities. <br/>Shortages in affordable immigration legal services lead many potential citizens<br/>to become prime targets for unscrupulous immigration consultants who defraud<br/>desperate immigrants with promises of an expedited application process. <br/>Immigration assistance fraud is a growing problem that costs immigrant<br/>communities millions of dollars a year and causes untold damage to its victims.   <br/><br/>But even those permanent residents who have been able to avoid victimization,<br/>must still face the obstacle of the backlog before achieving the dream of<br/>naturalization.  Even years after they have fulfilled the requirements of<br/>citizenship, thousands of immigrants are kept waiting, deprived of numerous<br/>benefits and rights that citizens take for granted.  Not surprisingly, under the<br/>proposed fee structure, the long processing time created by an ever-increasing<br/>backlog is only expected to shorten by 20%.  Applicants will be forced to pay<br/>more for services that, by USCIS own admission, are already lacking to begin with.  <br/><br/>Recommendations<br/><br/>Below are recommendations we hope USCIS will consider as it revises its fee<br/>structure:<br/><br/>?<span style='padding-left: 30px'></span>Maintain fee waiver for low-income immigrants.  USCIS should continue to<br/>provide fee waivers for those immigrants who would face economic hardship as a<br/>result of paying high immigration adjudication fees.  The U.S. should not<br/>discourage hard-working, low-income immigrants from completing the<br/>naturalization process.  While USCIS has argued that fee waivers transfer the<br/>cost to other fee-paying applicants, it has failed to recognize how high<br/>naturalization fees price out qualifying immigrants.  In fact, high costs for<br/>naturalization may be one factor that discourages immigrants from naturalizing<br/>at the same rates as higher-income immigrants.  Without relief for potential<br/>citizens, the proposed fee structure, if adopted, would have discriminatory<br/>results by effectively denying citizenship to the working poor that make up a<br/>large segment of the immigrant population.  Immigrants who are eligible and have<br/>played by the rules should not face excessive economic barriers to the American<br/>Dream. <br/><br/>?<span style='padding-left: 30px'></span>Request appropriated funds for the adjudication of N-400s.  Rather than<br/>raising naturalization fees for the sixth time since 1988, we urge you to call<br/>on Congress to provide sufficient appropriated funds to ensure that citizenship<br/>remains an attainable goal for current and future immigrants. With the help of<br/>appropriated funds, USCIS can make the proper changes needed to bring<br/>immigration services into the modern era without preventing eligible immigrants<br/>from obtaining U.S. citizenship.  <br/><br/>Coupled with recent increases in funding for both interior and border<br/>enforcement, including money for the extension of a border wall, the proposal to<br/>swell processing fees to exorbitant levels only reinforces the message that<br/>immigrants are increasingly unwelcome in this country.  To change this<br/>perception, USCIS cannot continue to operate 99% on user fees.  This system is<br/>not only unfair because it passes on the department?s costs onto the already<br/>struggling immigrants who are trying to become citizens, but it is unsustainable<br/>over the long term.<br/><br/>Therefore, ACORN urges USCIS to abandon its efforts to drastically increase<br/>naturalization<br/>and immigration application fees.  At a minimum, USCIS should request, and<br/>Congress should provide, a consistent funding stream to adjudicate N-400<br/>applications.  We cannot extol the merits of U.S. citizenship and assimilation<br/>into U.S. society and simultaneously erect a second wall that places the dream<br/>of acquiring U.S. citizenship beyond the reach of countless immigrants who<br/>contribute to this country every day.  Only with additional funding can USCIS<br/>process N-400 applications more efficiently and cost-effectively. <br/><br/>I appreciate the opportunity to comment on USCIS? proposed rule to revise the<br/>fee structure for immigration and naturalization applications.  Should you have<br/>any questions, please do not hesitate to contact Brenda Mu?iz, ACORN?s<br/>Legislative Director, at (202) 547-2500 or via email: legdirect@acorn.org. <br/><br/>Sincerely, <br/><br/>Maude Hurd<br/>ACORN National President<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021f07f", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:05:58Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T21:23:58Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Brenda Muniz", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Maude Hurd", "trackingNbr": "8021f07f", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2852/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2852/attachments"}}}}}