{"data": {"id": "USCIS-2006-0044-2099", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2099"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am writing to comment on the Notice of Proposed Rule Making in the Federal <br/>Register published by U.S. Citizenship and Immigration Services on February 1, <br/>2007 that proposes to raise filing fees (docket number: USCIS-2006-0044). I <br/>understand that you will be reviewing comments on this proposed rule before <br/>sending the final proposal to the Office of Management and Budget. <br/><br/>I am writing to request reconsideration of the increase in filing fees for the I-600A <br/>Petition to Classify an Orphan as an Immediate Relative and the biometrics fees <br/>(fingerprinting). My husband and I are in the process of adopting internationally. <br/>We sent our original I-600A to the CIS in August 2005, were fingerprinted, received <br/>our approved 1-171H in November 2005, and submitted our dossier to China in <br/>December 2005. When we started the adoption process, there was an 8-10 month <br/>wait between dossier submission to the China Center of Adoption Affairs (CCAA) <br/>and referral date. Now, the wait between dossier submission and referral is 16 <br/>months and travel to China usually occurs about 2 months later. In addition, the <br/>time frame between dossier submission and referral is predicted to continue <br/>increasing. <br/><br/>Because the I-171H expires 18 months after it is issued and fingerprint clearance <br/>expires 15 months after completed, families are required to renew their fingerprint <br/>clearance and their I-171H while they are waiting for a referral. This renewal <br/>involves resubmitting an I-600A, refingerprinting, and repaying the filing fees. <br/>Personally, we submitted our dossier 15 months ago and are waiting for a referral. <br/>Even if we received a referral soon, our I-171H would expire before our travel would <br/>be complete. Therefore, we applied for renewal of our I-171H by resubmitting the I-<br/>600A, refingerprinting, and repaying the filing fee (currently $545 + 2 people <br/>refingerprinting $140 = $685).  <br/><br/>At the present time, the majority of international adoptions involve children from <br/>China. Knowing that the I-171H has an 18 month expiration date, the fingerprint <br/>clearance has a 15 month expiration date, and the time between dossier <br/>submission and travel is increasing to beyond 18 months, this means the majority <br/>of families adopting internationally will have to pay the filing fee for the I-600A and <br/>fingerprinting twice. Rather than increasing the fee from $545 to $670 for the I-<br/>1600A and from $70 to $80 for fingerprinting, I ask that when you consider <br/>increasing the filing fees for the I-600A and the fingerprinting that you to <br/>understand that this would really increase the fee to $1660 (2 submissions at <br/>$670 + 2 sets of fingerprints at $80 for 2 adults). Increasing these fees places a <br/>great burden on families who are adopting internationally. Thank you for <br/>considering my comments.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021b37d", "lastName": null, "legacyId": null, "modifyDate": "2007-03-30T00:44:29Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-28T14:36:08Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Rachel B. Baker", "trackingNbr": "8021b37d", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2099/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2099/attachments"}}}}}