{"data": {"id": "USCIS-2006-0044-1065", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1065"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Dear Secretary Chertoff and the Administrative Staff of the Department of<br/>Homeland Security:<br/><br/>I am writing to address the proposal to increase certain immigration fees. <br/>While I agree that a fee increase is necessary to ensure public safety and<br/>agency efficiency, I have three main concerns with the proposed increase.<br/><br/>1.<span style='padding-left: 30px'></span>The drastic fee increase proposed could encourage more illegal border<br/>crossing resulting in more undocumented people.  One reason that people choose<br/>to cross the border without proper authorization is the cost of a visa or other<br/>immigration status.  Because the border is currently relatively easy to pass<br/>through undetected, the fee increase will likely exacerbate the problem.  This<br/>will end up increasing the costs for Customs and Border Patrol and for<br/>Immigration and Customs Enforcement, which will be unprepared for the greater<br/>influx of undocumented people.<br/><br/>2.<span style='padding-left: 30px'></span>With the incredibly high proposed increase in immigration fees, it is likely<br/>that fewer people will use the assistance of immigration lawyers that are now<br/>necessary to complete the complex forms and other requirements.  This can<br/>backfire and harm the country because many who will benefit our country will<br/>likely not be able to successfully complete the forms without legal assistance.<br/> Many people comment that immigration paperwork has become as difficult as the<br/>U.S. tax code.  It is a complex world of legal documentation, which most often<br/>requires the assistance of an immigration lawyer.  For example, under the<br/>Immigration Marriage Fraud Act, the requirements to successfully obtain<br/>unconditional lawful permanent resident status have become increasing complex. <br/>There are initial filing deadlines that require incredible amounts of paperwork<br/>and other evidentiary support to obtain conditional permanent resident status. <br/>Then there are additional filing requirements to remove that conditional status<br/>with additional filing fees.  The current rate of adjustment of status for<br/>marriage petitions is $935.00.  The proposed change in fees more than doubles<br/>that cost.  It is very likely that with more than a 100% increase in immigration<br/>fees, many people will try to navigate the world of immigration law alone and<br/>unassisted.<br/><br/>It is important that people be able to get legal assistance for the many<br/>requirements and to be completely informed of all that the immigration laws<br/>require of them.  This fee increase will likely cause many people to file for<br/>immigration benefits without being fully informed about what they need to do to<br/>successfully pass through all of the immigration hurdles.  This can be nearly<br/>impossible without an immigration attorney.  Because many people will not seek<br/>legal assistance under the proposed fee increase, the United States will end up<br/>preventing many valuable immigrants from becoming a part of our nation and<br/>contributing to its growth and development.  <br/><br/>3.<span style='padding-left: 30px'></span>It appears counterintuitive to increase the fees to counteract the fees that<br/>are waived for particular immigration benefit claims or for those who cannot<br/>afford the fees while decreasing a person?s ability to request a fee waiver. <br/>INA section 212(a)(4) prevents those who are likely to become public charges<br/>from being admitted to the United States.  However, these fee increases are such<br/>that many people should be able to request a fee waiver, and they still would<br/>not fall into the definition of one likely to become a public charge.  Many of<br/>these fees are too great for many people to afford.  Therefore, fee waivers<br/>should be available when the fees are increased by an average of 86% [as stated<br/>by Emilio T. Gonzalez in his statement before the House Judiciary Committee on<br/>February 14, 2007], and sometimes even more.  However, this proposal seeks to<br/>decrease a person?s ability to request waivers.  If the Government intends to<br/>decrease waivers available, then there is not the need to increase fees as<br/>drastically as is currently being proposed to cover those requesting waivers or<br/>other free immigration benefits.  <br/><br/>Based on the foregoing reasons, I respectfully request that Mr. Chertoff and the<br/>Department of Homeland Security rethink the amount that the fees will be<br/>increased.  This is due to the above three concerns I have listed.  First, the<br/>proposed fees will likely increase illegal border crossings. Second, it will<br/>prevent people from seeking legal assistance for immigration benefits and<br/>exclude people who would be beneficial to this country.  Finally, the proposed<br/>increase is counterintuitive as it purports to increase fees to cover those<br/>seeking fee waivers and other free immigration benefits while the proposed rule<br/>seeks to limit a person?s ability to obtain a fee waiver.  <br/><br/>I sincerely hope that my comments are taken into consideration and that this<br/>proposed rule be modified to a less drastic fee increase.  Instead of the<br/>current proposal, I hope the Government would choose to employ a more reasonable<br/>fee increase such as 30% to 33%.  I believe that this increase would still allow<br/>the Government to maintain its efficiency and thoroughly screen those seeking<br/>admission without creating the adverse effects of the drastic proposed increase.<br/> Under a smaller fee increase, I think it would still be completely reasonable<br/>for the Government to seek to limit fee waivers.  <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020d887", "lastName": null, "legacyId": null, "modifyDate": "2007-03-05T15:53:19Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-05T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-04T17:34:58Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Kalin Mittleider", "trackingNbr": "8020d887", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [{"id": "0900006480dff8c9", "type": "attachments"}], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1065/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1065/attachments"}}}}, "included": [{"id": "0900006480dff8c9", "type": "attachments", "links": {"self": "https://api.regulations.gov/v4/attachments/0900006480dff8c9"}, "attributes": {"agencyNote": null, "authors": null, "docAbstract": null, "docOrder": 1, "fileFormats": [{"fileUrl": "https://downloads.regulations.gov/USCIS-2006-0044-1065/attachment_1.doc", "format": "doc", "size": 29696}], "modifyDate": "2007-03-05T10:53:20Z", "publication": null, "restrictReason": null, "restrictReasonType": null, "title": "Comment Submitted By Kalin Mittleider (Attachment)"}}]}