{"data": {"id": "USCIS-2006-0044-0513", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0513"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "My two cent..<br/><br/>I believe that increase are necessary when justified. And maybe in this case it is. <br/>But it&#39;s too large of an increase at one time. The only way an increase this lager <br/>could be justified is if the current crappy system that breaks up and ruins families, <br/>economically, financially, and socially is if it was fixed so that applicants who go <br/>thru the system and file all the proper paperwork can have their Green Card within <br/>12 months from beginning to end. <br/><br/>I am personally very discourage by the whole system right now after getting my I-<br/>140 approved then was told I would have to wait for a Visa from the State <br/>Department to be available before I can file my I-485 for myself and the rest of my <br/>family who&#39;ve been here with me in the U.S. for over three years and cannot work. <br/>This system has made them useless. Three years! And with my priority date of <br/>February 7, 2006 and the State Department Visa status showing August 1 2002 it <br/>seem to me as if they, as well as I might have to wait a few more years before we <br/>can all apply to change our status. THIS IS FRUSTRATING..And not to mention <br/>very costly since I&#39;ve employed an immigration lawyer to help me become a Lawful <br/>Permanent Residence. <br/><br/>If Immigration want to increase the fee for applications then do something to <br/>reduce the time and money it&#39;s costing, honest, law abiding people like me that <br/>it&#39;s suffocating along with the other members of my family. Why is there a wait for <br/>Visa from the State Department. Make is so that as soon as an individual goes <br/>thru the system legally and gets an approval at each state there&#39;s that they are <br/>not going to waiting for this and that. Like a priority dates.  We all want to go on <br/>living and this wait is not enabling us to move forward and is the cause of much <br/>stress and anxiety.<br/><br/>RAISE THE FEES GRADUALLY, BUT FIX THE SYSTEM AND STOP WAISTING <br/>TIME AND RUINING FAMILIES.<br/><br/>Sincerely Yours<br/><br/>Steve Dickenson <br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480207dd7", "lastName": null, "legacyId": null, "modifyDate": "2007-02-16T19:25:29Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-16T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-15T22:05:03Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Steve Dickenson", "trackingNbr": "80207dd7", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0513/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0513/attachments"}}}}}