{"data": {"id": "USCIS-2006-0044-1782", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1782"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "To:  US Citizenship and Immigration Services<br/>Re:  Docket number USCIS-2006-0044<br/><br/>My husband and I are in the process of adopting a child from China.  We began <br/>the lengthy paperwork process in July 2006.  The process continues to slow down <br/>more and more each day.  When we first began working on the adoption, the wait <br/>time was approximately 6 to 9 months from the date the paperwork is logged in to <br/>China.  Now, less than nine months later, we learn that the wait time has <br/>increased to 15 or 16 months.  This means that unless something changes <br/>quickly, we will probably have to resubmit some of the CIS forms and redo our <br/>fingerprints, which will result in even more fees and increased expenses to us as <br/>we wait for our daughter.<br/><br/>Adopting internationally is already very expensive, especially since we will be <br/>required to travel to China and stay two to three weeks.  Please reconsider this <br/>decision and do NOT raise the fees any higher than they already are.  Also ? <br/>anything that can be done to increase the length of time that I600/I600A forms are <br/>valid to at least 24 months would be extremely helpful.  We have no control over <br/>the wait time ? and will probably be penalized simply because of what seems like <br/>an arbitrary time limit on these forms.<br/><br/>Another problem we have encountered because of the extended wait time is that <br/>we will lose the ability to deduct thousands of dollars in expenses on our income <br/>taxes.  We spent over $8,600 in 2006 on adoption expenses.  When we finally <br/>receive our daughter in 2008, we will only be able to deduct expenses from 2008  <br/>and 2007.  It would be extremely helpful if a change could be made to the tax laws <br/>to allow deductions for international adoptions from the previous two years prior to <br/>the date the adoption is finalized.<br/><br/>The number of couples (and single persons) who are adopting internationally has <br/>increased tremendously in the past few years.  For various reasons, many of us <br/>are unable to adopt in the U.S. and have chosen the more expensive international <br/>adoption route and have had to make sacrifices to be able to afford it.  Please do <br/>not make this process any more difficult by increasing the expense of adopting.<br/><br/>Thank you for your consideration.<br/><br/>Nancy Cunningham<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021a16c", "lastName": null, "legacyId": null, "modifyDate": "2007-03-28T16:23:32Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-28T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-27T02:07:14Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Nancy Cunningham", "trackingNbr": "8021a16c", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1782/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1782/attachments"}}}}}