{"data": {"id": "USCIS-2006-0044-0978", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0978"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "SEIU represents immigrant workers who perform some of our most needed, yet <br/>undervalued, work ? work that is essential to our economy, families, and <br/>communities. These hardworking immigrants care for our children and aged, cut <br/>our grass, and clean our toilets. With dignity, they struggle to make ends meet <br/>and sustain their families.<br/><br/>This is why Service Employees International Union strongly condemns the drastic <br/>increase in the naturalization fees proposed by the United States Citizenship and <br/>Immigration Services (USCIS). This proposal is ?another barrier?&#39; for immigrants to <br/>earn U.S citizenship and make the American dream unattainable.   The fees for <br/>starting the naturalization process will go from $400 to $675, an increase of 69%. <br/>This new price tag constitutes a burden unfairly placed on the back of the poorest <br/>immigrant families in our country.<br/><br/>According to the USCIS, this increase would pay for major infrastructure <br/>investments and process enhancements that would be used to fix the broken <br/>immigration system.<br/><br/>Service Employees International Union acknowledges that the USCIS does need <br/>to make major investments to enhance the delivery of its services, and <br/>understands that USCIS faces serious fiscal problems.  However, we believe that <br/>our system for funding immigration services should be a partnership where <br/>applicants pay a reasonable fee for quality service.  Therefore, we join our <br/>community allies, and urge the President and Congress to address the USCIS? <br/>fundamentally flawed system of financing immigration services by providing <br/>appropriations to cover costs of major USCIS expenses such as infrastructure <br/>investments, process enhancements and capital improvements.<br/><br/>This country is built upon the great tradition of the melting pot that welcomes and <br/>assimilates new arrivals. The USCIS? proposed fee increase violates this legacy. <br/>Immigrants who apply for naturalization are eager to demonstrate their <br/>commitment to this country. It is counterproductive to raise the fees so high that <br/>eligible immigrant families are excluded from full participation in our civic life.<br/><br/><span style='padding-left: 30px'></span>#  #  #<br/><br/>With 1.8 million members, SEIU is the fastest-growing union in North America. <br/>Focused on uniting workers in three sectors to improve their lives and the services <br/>they provide, SEIU is the largest health care union, including hospitals, nursing <br/>homes, and home care; the largest property services union, including building <br/>cleaning and security; and the second largest public employee union.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648020c67c", "lastName": null, "legacyId": null, "modifyDate": "2007-03-01T21:32:52Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-01T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-28T20:08:46Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Ali Jost, Service Employees International Union (SEIU)", "trackingNbr": "8020c67c", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0978/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0978/attachments"}}}}}