{"data": {"id": "USCIS-2006-0044-2856", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2856"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "4/01/07<br/><br/>Director, Regulatory Management Division<br/>U.S. Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Ave., NW, 3rd floor<br/>Washington, DC 20529<br/><br/>RE:   DHS Docket # USCIS-2006-0044<br/>Proposed rule ? Adjustment of the Immigration and Naturalization Benefit <br/>Application and Petition Fee Schedule<br/><br/>To Whom it May Concern:<br/><br/>I write to strongly oppose the increase of immigration and naturalization fees that <br/>the U.S. Citizenship and Immigration Services (USCIS) proposed on February 1, <br/>2007.  Every day immigrants and refugees already struggle to pay immigration <br/>fees.  The steep increases proposed by USCIS would make it much more difficult <br/>to gain permanent resident status, reunite with family members, and become a <br/>U.S. citizen.  USCIS should be helping immigrants become citizens, not making it <br/>harder.<br/><br/>I personally spent  more than two thousand dollars throughout my immigration <br/>process, and needless to say it was more than difficult to meet these quotas. <br/>Besides the financial struggle, add  the time consuming procedures and <br/>paperwork required to gain residency and citizenship, lost wages, risk to loose <br/>job, transportation, etc. they all add to the difficulty for the whole process, please <br/>don&#39;t add more obsticles.<br/><br/>USCIS claims that the fee increase is necessary to improve service, and USCIS <br/>definitely needs to improve service.  While I applaud USCIS?s efforts to improve <br/>service, I do not think that the entire cost should rest on immigrants who are <br/>already paying taxes, working hard, and struggling to pay high fees while receiving <br/>poor service.  <br/><br/>Immigration and citizenship are public goods that benefit our entire country and <br/>that we as a nation should help pay for.  Immigrants work hard, pay taxes, and <br/>help revitalize our communities.  In becoming citizens, immigrants demonstrate <br/>their strong commitment to their new home country by learning English, gaining <br/>knowledge about American history and government, and swearing allegiance to <br/>the United States.  We should be encouraging immigrants to become part of our <br/>community by gaining legal status and becoming citizens, not setting up barriers <br/>that block their path and keep them out.  <br/><br/>For all these reasons, I strongly oppose the proposed fee increases and urge <br/>USCIS to reconsider this proposal, and to seek other sources of funding for its <br/>operations, rather than add more burdens on immigrants.  Thank you for your <br/>consideration.<br/><br/>Sincerely,<br/>Janeatte bendezu<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021f0ae", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:06:33Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-02T21:46:37Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Jeanette Bendezu", "trackingNbr": "8021f0ae", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2856/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2856/attachments"}}}}}