{"data": {"id": "USCIS-2006-0044-2404", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2404"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "<br/>Director, Regulatory Management Division<br/>US Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Ave. NW, 3rd floor<br/>Washington DC 20529.<br/><br/>RE:  DHS Docket # USCIS-2006-0044<br/>Proposed rule? Adjustment of the Immigration and Naturalization Benefit Application <br/>and Petition Fee Schedule<br/><br/>The National Immigration Forum submits the following comment regarding the fee <br/>increase proposed for immigration benefits in the proposed rule published in the <br/>Federal Register on February 1.  The National Immigration Forum opposes the fee <br/>increases and urges USCIS to seek Congressional appropriations to cover additional <br/>costs.<br/><br/>The National Immigration Forum advocates and builds support for public policies that <br/>welcome immigrants and refugees and are fair and supportive to America?s newcomers <br/>and the communities in which they settle.  As part of its mission, the Forum promotes <br/>policies to encourage immigrants to become fully integrated into American society.<br/><br/>As such, we are concerned that the steep fee increases proposed by USCIS will serve <br/>as a barrier and prevent eligible immigrants from taking the necessary steps to become <br/>citizens.  The proposed adjustment of status fee (including the biometric fee and <br/>required medical examination) would exceed $1,000.  This would amount to a full <br/>month?s pay for a minimum wage worker and would effectively price him or her out of <br/>being able to adjust to become a legal permanent resident, and thus a citizen later.  The <br/>fees for naturalizing are equally exorbitant. Should the proposed fee go into effect, the <br/>increase in the naturalization application fee will be 710% in 10 years.  Similar steep <br/>rises are proposed to go into effect for other immigration benefits.  <br/><br/>It is in our nation?s interest and consistent with our tradition as a nation of immigrants to <br/>encourage, rather than discourage, immigrant integration and citizenship.  The <br/>proposed fee increase moves us in the wrong direction. <br/><br/>Interim Benefits Costs Should Not be Included in the I-485 Fee  <br/><br/>Because many adjustment applicants do not file for interim benefits such as <br/>employment authorization (i.e. minors do not need this, neither do many asylees who <br/>have work authorization) or advance parole (many people choose not to travel during <br/>this period, many others cannot do so without triggering inadmissibility bars) it is <br/>patently unfair to charge all adjustment applicants for a benefit which many will not <br/>need. <br/><br/>Fee waivers should not be eliminated for entire groups of applicants<br/><br/>USICS proposes to eliminate fee waivers for certain forms, stating that applicants are <br/>supposed to show that they will not become a public charge, and applying for a fee <br/>waiver contradicts this requirement.  However, not all applicants using the forms listed <br/>in the proposed rule are required to show they will not become a public charge?for <br/>instance, asylees applying to adjust their status, as well as persons seeking to adjust <br/>based on the Cuban Adjustment Act and NACARA, are exempt from the public charge <br/>grounds of inadmissibility.  <br/><br/>In addition, by waiving the fee on a blanket basis for VAWA I-360 petitions but <br/>simultaneously eliminating the possibility of a fee waiver for adjustment applicants, the <br/>Service is actually making it more difficult for this vulnerable group of applicants.  A <br/>VAWA petitioner will be spared the $375 fee but be barred from seeking a waiver for <br/>the proposed $905 fee to adjust her status.  It would be more equitable and humane to <br/>have both waivers continue to be available. <br/><br/>The cost of modernizing the agency should not be borne entirely by immigrants<br/><br/>USCIS has in recent years obtained appropriated funds from Congress so it could <br/>make investments needed to reduce application backlogs.  We urge USCIS to continue <br/>to seek appropriated funds for some of the expenses described in the proposed rule.  <br/><br/>Immigration benefits our entire country and we as a nation should help pay for it.  <br/>Immigrants help revitalize our communities and our economy.  We should be <br/>encouraging immigrants to become part of our community by gaining legal status and <br/>becoming citizens.  We should not be setting up barriers to block their path and keep <br/>them out, which is what this dramatic fee increase would do.<br/><br/>We stand ready to work with USCIS to seek additional Congressional funding for <br/>adjudication and infrastructure costs but believe it is imperative for USCIS to step up to <br/>the plate and affirmatively seek necessary appropriations to carry out these functions.  <br/>Unless this happens, the proposed fee increase will go into effect and many deserving <br/>and qualified immigrants will be shut out of the process of becoming citizens and fully <br/>integrated into our society.<br/><br/>Conclusion<br/><br/>In sum, we urge USICS to reconsider the proposed fee increases, to examine its costs <br/>more closely, and to seek Congressional appropriations for enhancements and <br/>modernization.  Thank you for your consideration of these comments.<br/><br/>Sincerely,<br/><br/>Christina DeConcini, Esq.<br/>Director of Policy<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021ce90", "lastName": null, "legacyId": null, "modifyDate": "2007-03-30T23:50:44Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-30T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-30T18:04:49Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Christina DeConcini", "trackingNbr": "8021ce90", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2404/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2404/attachments"}}}}}