{"data": {"id": "USCIS-2006-0044-2527", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2527"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "DEPARTMENT OF HOMELAND SECURITY<br/>8 CFR PART 103<br/><br/>By Electronic Transmission<br/><br/>Florida International University Students:<br/><br/>Keneth Batista<br/>Melina Corzo<br/>Renaldo C. Lisenbee<br/>Patrice Prescott<br/>Efrain Sora<br/><br/><span style='padding-left: 30px'></span>RE: Proposed Adjustments to the Immigration and Naturalization <br/>Benefit Application and Petition Fees of the Immigration Examinations Fee <br/>Account<br/><br/>After receiving feedback from various stakeholders, we have arrived at a joint <br/>opinion regarding the decision to adjust the immigration benefit application and <br/>petition fees of the Immigration Examinations Fee Account. We believe that we <br/>have thoroughly researched and interpreted the proposed guidelines which outline <br/>the fee schedule, prevention of fraud, and investment of a more comprehensive <br/>and quicker approach to handling customers? requests. We note substantial <br/>agreement for enforcing an increase in fees in an effort to improve and preserve the <br/>reliability and security of a U.S. immigration system. <br/><br/><span style='padding-left: 30px'></span>We believe that although an increase in any fee may be a burden to <br/>many prospective applicants and petitioners, in the long term it will serve as an <br/>advantageous benefit to how the system is conducted in the future. Based on the <br/>background information presented in this rule, the fees are intended to fully <br/>implement an expeditious service with a manageable database in order to <br/>complete the processing of the application.<br/><br/><span style='padding-left: 30px'></span>It is strongly agreed by the majority of our polled sample that it is a <br/>right and responsibility of the United States, democratic society, to manage <br/>immigration with caution so that it serves the best national interest. Although <br/>there have been disagreements as to the number of immigrants entering the <br/>country, in actuality, it serves a considerable amount of opportunities.  On the <br/>contrary, we do understand that the influx of immigrants unlawfully will also pose <br/>problems as well. Enforcing efforts in the past have failed to fully manage and <br/>control the illegal immigrants. Therefore, allowing the USCIS to enforce a more <br/>comprehensive and more developed system will without a doubt help facilitate the <br/>management process and reduce the amount of illegal immigrants entering the <br/>country. Yet again, the issue of improving fraud prevention and detection plays a <br/>key role. Contributing to this are the fears of the future. <br/><br/><span style='padding-left: 30px'></span>Citizenship is a major priority, especially for Muslims. Mr. Firooz <br/>Namei, an immigration lawyer has stated that many more people are coming <br/>forward and ensuring that they become legal citizens of the United States. Many <br/>suspect that due to America?s war on terrorism, it can certainly lead to more <br/>restrictions on non-citizens. As evidenced by the daily activities surrounding our <br/>world, greater restrictions are being pushed on those who are not citizens despite <br/>the longevity of a person?s stay here in America. District Director of the INS in the <br/>state of Ohio has explained that although the application process typically takes <br/>several months, the end result is rewarding. The amount of application requests <br/>often increases substantially when fees such as the one proposed is in effect. <br/>Furthermore, a greater recognition and clearer distinction between a citizen and <br/>an immigrant are being displayed today. <br/><br/><span style='padding-left: 30px'></span>As the USCIS claims, with these adjusted fees, it should continue to <br/>find ways to improve its productivity in application processing while also trying to <br/>cut costs. Needless to say, at times it may cost a little more to achieve such <br/>standards. Distinctively, the USCIS has the ability to waive some of the fees <br/>applied for entire classes of applicants. Making this as fair as possible, USCIS <br/>thoroughly evaluates any applicant in need with the understanding that there only <br/>be compelling reasons when granting a prospective applicant a waiver. Thus, if a <br/>prospective applicant cannot afford the fee, there are various avenues that he/she <br/>can take to continue this very tedious process. <br/><br/><span style='padding-left: 30px'></span>We also believe, that these added cost should immediately serve the <br/>best interest of prospective applicants and petitioners. These improved services <br/>can only occur if there?s a transformation from the current USCIS? paper-based <br/>date systems into digital processing resources and expanded on-line services. <br/>Applicants and petitioners should have greater access to office locations and <br/>information, making the process simpler. In the long run, we believe that this <br/>should reduce fees in the future, as the USCIS continues to review its fee <br/>structure every two years. <br/><br/><span style='padding-left: 30px'></span>We agree that there should be an increase in fees, but the USCIS <br/>should commit to improving their service levels beyond 20 percent by the end of <br/>fiscal year 2009. If the USCIS was able to implement a major improvement in <br/>service levels, achieved goals of six months processing times in the absence of <br/>full funds, then it is important that the USCIS commit to be better positioned by <br/>2009 and to have a permanently improved business model.  <br/><br/><span style='padding-left: 30px'></span>Thank you for this opportunity to submit comment of behalf of the <br/>Florida International University Business and Society students.<br/><br/><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span>Sincerely,<br/><br/><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><br/><span style='padding-left: 30px'></span>Keneth Batista<br/>Melina Corzo<br/>Renaldo C. Lisenbee<br/>Patrice Prescott<br/>Efrain Sora<br/><br/>STAKEHOLDERS CONTACTED:<br/><br/>(INCSC) Office<br/>1-800-375-5283 <br/><br/>Center for Immigration Studies<br/>http://www.cis.org<br/>E-Mail: center@cis.org<br/>1522 K St. NW, Suite 820<br/>Washington, DC 20005-1202<br/>Phone: 202-466-8185<br/>Fax: 202-466-8076<br/><br/>It is the Center&#39;s mission to expand the base of public knowledge and <br/>understanding of the need for an immigration policy that gives first concern to the <br/>broad national interest. The Center is animated by a pro-immigrant, low-<br/>immigration vision which seeks fewer immigrants but a warmer welcome for those <br/>admitted<br/><br/>Americans for Better Immigration<br/>http://www.betterimmigration.com<br/>E-Mail: info@betterimmigration.com<br/>1601 N Kent St., Suite 1100<br/>Arlington, VA 22209<br/>Phone: 703-816-8820<br/><br/>Contact: Caroline Espinoza<br/>Media Office for Americans for Better Immigration<br/>Cell: (703) 568-7894<br/><br/>&quot;Americans for Better Immigration (ABI) is a non-profit, non-partisan organization <br/>which lobbies Congress for reductions in immigration numbers.&quot;<br/>(http://www.betterimmigration.com)<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021dc49", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:20:24Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T15:01:17Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by FIU Students", "trackingNbr": "8021dc49", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [{"id": "0900006480dff8d3", "type": "attachments"}], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2527/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2527/attachments"}}}}, "included": [{"id": "0900006480dff8d3", "type": "attachments", "links": {"self": "https://api.regulations.gov/v4/attachments/0900006480dff8d3"}, "attributes": {"agencyNote": null, "authors": null, "docAbstract": null, "docOrder": 1, "fileFormats": [{"fileUrl": "https://downloads.regulations.gov/USCIS-2006-0044-2527/attachment_1.doc", "format": "doc", "size": 35840}], "modifyDate": "2007-04-02T11:20:25Z", "publication": null, "restrictReason": null, "restrictReasonType": null, "title": "Comment Submitted by FIU Students (Attachment)"}}]}