{"data": {"id": "USCIS-2006-0044-2604", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2604"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am appalled that USCIS has proposed such massive fee increases.  I have been <br/>practicing immigration law since 1986.  Each time there has been a fee increase <br/>there has been no corresponding improvement in service.  Instead, processing <br/>times get longer and adjudications get more inconsistent.  As just one example, <br/>the latest so-called ?improvement? of bi-specialization has replaced a processing <br/>time of approximately 60-90 days for an EB-1 multinational manager I-140 at VSC <br/>with approximately 1 year at NSC.  And, I have some applicants for I-485s and N-<br/>400s who have been waiting for more than 1 year for ?security clearances.? USCIS <br/>has made it impossible to get useful or accurate information when there is a <br/>problem by requiring people to call an ?800? number.  The ?customer service?  <br/>representatives read from scripts, ask irrelevant questions (such as the birth date <br/>of a petitioner?s representative) and do nothing more than look at the same case <br/>status system that we can access ourselves.  I cannot count the number of times <br/>these ?customer service? people have given my clients a wrong answer.  USCIS <br/>could save money if it would allow us to resolve problems by speaking with <br/>officers at the Service Centers, as we used to do.  The ?new? USCIS web site is <br/>full of broken &quot;links&quot; and much harder to use than the original one.  If I am having <br/>problems finding information - and I know what I am looking for on the site - I can <br/>imagine how difficult it is for the general public. A fee increase from $190 to <br/>$320 for an I-129 imposes a further burden on U.S. businesses who want to <br/>remain competitive in the global market place by hiring both U.S. and foreign <br/>workers. Increasing the fee for a Form I-485 from $325 to $905 places a ?green <br/>card? out of reach for most people.  I cannot help but wonder if a fee increase from <br/>$330 to $595 for the N-400 is intended to discourage an increase in the number of <br/>foreign born U.S. citizens.  Our country has benefited from being a nation of <br/>immigrants.  These fee increases send the message that the foreign-born are not <br/>welcome here. Before USCIS proposes fee increases, it needs to prove that the <br/>funds will be used to improve service and that it will have people who are trained <br/>properly to help customers and adjudicate their petitions and applications fairly <br/>and consistently.  Until then, this proposed rulemaking should be withdrawn.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021df74", "lastName": null, "legacyId": null, "modifyDate": "2007-04-03T01:04:45Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-01T01:04:25Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Leslie Dellon", "trackingNbr": "8021df74", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2604/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2604/attachments"}}}}}