{"data": {"id": "USCIS-2006-0044-0251", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0251"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I am writing to argue against the current proposed fee increases as they relate to I-<br/>600/I-600A petitions.  Given the uncertain nature of the foreign adoption process, <br/>many prospective adoptive parents are already in a position of having to complete <br/>FBI fingerprinting 2-3 times and USCIS I-600/I-600A approval at least twice for the <br/>adoption of the SAME child, because waiting times imposed by the foreign <br/>country are increasing.<br/><br/>I am personally caught in this situation.  My husband and I began paperwork in <br/>early 2005 for the adoption of a child from China.  We have already had to have our <br/>FBI fingerprints redone.  We also have recently submitted a second I-600 <br/>application, since our original approval expires soon.  We will not be able to <br/>complete travel to China to return with our daughter until later this year.  Families <br/>who have entered the China adoption program after us will have to wait even longer <br/>between initial paperwork processing and completion of travel.<br/><br/>This means these families are already paying USCIS double the posted fee.  If an <br/>allowance can be made for paying one fee for the simultaneous adoption of <br/>multiple children, then it seems like there should be only one fee paid for the <br/>adoption of the same child.<br/><br/>I realize that the fact that the USCIS approval expires before many families are <br/>able to complete their travel is on the one hand a separate issue from the <br/>proposed fee increases.  However, inasmuch as USCIS and Congressional <br/>leadership appears unwilling to change the arbitrary nature of the length of approval <br/>before expiry, then the proposed fee increase is a further burden for this set of <br/>families who will be paying increased fee not once, but twice.<br/><br/>For most families, little if anything has changed from one I-600/I-600A submission <br/>to the next (again, for the same adoption)--we are asked to submit additional <br/>copies of the parents&#39; birth certificates and marriage license, another &quot;Copy of <br/>Original Document&quot; form, and an &quot;updated&quot; homestudy.  In our case, the &quot;update&quot; <br/>required another set of state police clearances and our social worker asking us <br/>fewer than 10 questions that mainly related to criminal activity since we had had <br/>no change in marital status, household residents, living arrangements, health, or <br/>jobs/income.  It hardly seems that even if the fee increase for the first submission <br/>of I-600/I-600A is justifiable, subsequently forcing families in this situation to <br/>submit essentially all of the same paperwork and pay the fee a second time <br/>neither is efficient nor necessitates the same review process (i.e., USCIS should <br/>face lower processing costs for renewals as opposed to initial applications).<br/><br/>USCIS appears to be looking to adoptive families, who are already stretched <br/>financially to pay the host of fees required by the U.S. government, adoption <br/>agencies, and the foreign government of their child&#39;s birth country, to subsidize <br/>USCIS costs for other individuals.  If USCIS is going to propose a restructured fee <br/>system, then even if the I-600/I-600A fee is raised for the first submission to cover <br/>expected processing costs, this is an opportunity to then introduce a significantly <br/>reduced fee if families must file renewal due to delays in the same adoption.<br/><br/>If you have any questions or would like to ask me follow-up questions, please feel <br/>free to contact me.<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801fdaac", "lastName": null, "legacyId": null, "modifyDate": "2007-02-08T19:32:31Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-08T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-08T17:17:04Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Stephanie M. Jozefowicz", "trackingNbr": "801fdaac", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0251/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0251/attachments"}}}}}