{"data": {"id": "USCIS-2006-0044-0253", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0253"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "I write to express grave concern over the steep increases in immigration <br/>application fees proposed last week by U.S. Citizenship and Immigration Services <br/>(USCIS). The National Immigrant Justice Center and the International Refugee <br/>Center, both partners of Heartland Alliance, work with thousands of immigrants, <br/>refugees, and asylees annually to provide a range of legal and refugee <br/>resettlement services. <br/>I am particularly troubled by the proposed increase of two fees: the fee to <br/>naturalize, and the fee to adjust to lawful permanent residence, commonly known <br/>as the status that earns an immigrant a ?green card?. Both will be raised at <br/>shockingly high rates and will negatively affect tens of thousands of low-income <br/>immigrants and asylees each year. <br/>USCIS proposed to raise the naturalization fee from $330 to $595. This increase <br/>will make citizenship cost-prohibitive for thousands of longtime permanent <br/>residents who have worked and raised families in the United States and who want <br/>to assume the responsibilities, rights, and protections afforded to citizens under <br/>the U.S. Constitution. <br/>In addition, the proposed hike in the fee to adjust status to permanent residence <br/>will be insurmountable for many asylees. By law, those who apply for and obtain <br/>asylum within the U.S. must apply to adjust their status and obtain a green card <br/>within a year of the grant of asylum. These asylees are fortunate to have the <br/>opportunity to live in safety in America, but they also face significant hurdles. <br/>Many struggle to support their families, learn English, and secure social services. <br/>Unlike refugees, they are not exempt from the fee for a green card application. <br/>Now, USCIS proposes to raise that fee from $325 to $905. These fees are <br/>assigned to each individual applicant, such that under the proposed rule, a family <br/>of four will have to pay an exorbitant $3,620 within a year of the asylum grant. <br/>Furthermore, while fee waivers remain available to certain naturalization applicants, <br/>the proposed rule removes green card applicants from eligibility for fee waivers <br/>altogether. This change will harm not only the asylees discussed above, but also <br/>immigrants who originally obtained special immigration status as victims of <br/>trafficking or domestic violence, and who face similar challenges to building stable <br/>lives in America. For policy reasons we all support, these vulnerable immigrants <br/>are either exempt from fees or eligible for fee waivers when they initially apply for <br/>lawful immigration status. Under the proposed rule, however, when these <br/>individuals apply for green cards soon after, they will be ineligible for a fee waiver. <br/>The director of USCIS, Assistant Secretary of Homeland Security Emilio <br/>Gonzalez, contends that the agency must operate on a business model, and <br/>therefore income from fees must offset virtually all of the agency&#39;s costs. <br/>Accordingly, Assistant Secretary Gonzalez stated that the agency will not seek <br/>funds from Congress to reduce the unreasonable burden of the fee increases on <br/>immigrants and asylees. <br/>Even without the proposed increase, the fee to apply for citizenship has already <br/>increased fourfold in the past eight years. Every immigrant expects to pay a fee for <br/>a benefit, but those fees must be fair. <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801fdafb", "lastName": null, "legacyId": null, "modifyDate": "2007-02-08T19:32:33Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-08T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-08T18:53:49Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Peter Gunther", "trackingNbr": "801fdafb", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0253/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0253/attachments"}}}}}