{"data": {"id": "USCIS-2006-0044-2466", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2466"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "To Whom It May Concern:<br/><br/>We are writing to you and your department both as US citizens and parents-to-be <br/>of a child from China regarding current USCIS regulations that affect the process <br/>and cost of China adoption. This letter contains a little bit about us and a proposal <br/>for changing the current system. Our dream of completing a family has been a <br/>journey. We have a son we adopted from Korea in 2004 and now we are waiting <br/>for our daughter from China. The process for both has been quite involved with our <br/>Chinese adoption process currently taking almost double the time that we had to <br/>wait for our son three years ago. We have had to submit to the scrutiny of our <br/>adoption agency, our state, our federal government, and the Chinese government. <br/>The investment of our time, money and emotions has been substantial. We have <br/>followed all the rules of both the United States and the Peoples Republic of China. <br/>We filled out the dozens of required forms, ordered the required documents, <br/>prepared our dossier and immigration files and sent them to China. And now the <br/>long wait for our daughter truly begins. As part of this process we are required to <br/>obtain USCIS approval (form I-171H/I-797C). According to current regulations, this <br/>document is valid for 18 months. Until recently, this approval period served <br/>families in the process of China adoption quite well. They were able to receive <br/>their child referral, travel to China, receive their child and submit an I-600 in <br/>Guangzhou for their child?s visa. This is what we had been looking forward to for <br/>our family, our adoption journey. Unfortunately, China is now experiencing a <br/>significant increase in the length of time it will take to match us with our child. <br/>This increased waiting timeline has occurred quickly and with dramatic effects. It <br/>is a certainty that every family who has a dossier in China will experience the <br/>expiration of their: 1) fingerprints (valid for 15 months) and I-171H/I-797C approval <br/>(valid for 18 months). The cost, both emotionally and financially of filing a new I-<br/>600A will be very high. The cost to your USCIS offices for processing a new I-<br/>600A will be very costly and time consuming. We would like to propose the <br/>following:<br/>1) Effective immediately, set the validity period for all newly issued I-171H/I-797C <br/>from 18 to 24 months.<br/>2) Effective immediately, allow all families holding a valid I-171H/I-797C to file and <br/>be approved for an extension to 24 months within 30 days after submitting the <br/>following documents:<br/>a. A copy of their current I-171H/I-797C and valid fingerprints<br/>b. A Home Study update to ensure that families still qualify to adopt from China.<br/><br/>With the proposed increased USCIS fees as well as the longer wait times for <br/>adoption from China, the current cost for fingerprints and I-600A will increase from <br/>$685 to $1660. Please help us with relief of the burden to submit another I-600A <br/>for a new I-171H when we have not even had the chance to use the one you gave <br/>us initially. Please do not add additional time and cost simply because we want to <br/>be parents! We implore you to look at the need and rational behind a completely <br/>new file when these timelines are now here through no fault of our own.<br/><br/>Thank you for your time and thoughtfulness about this matter.<br/><br/>Sincerely,<br/><br/>Diane Hazlett<br/>Painted Post, NY<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021d85d", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T14:34:24Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T01:53:29Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Adoptive Parent, Diane", "trackingNbr": "8021d85d", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2466/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2466/attachments"}}}}}