{"data": {"id": "USCIS-2006-0044-2052", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2052"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Dear Sirs,<br/><br/>With regard to the increase in fees for:<br/>Adoption-Related Petitions Affected by the Proposed Increase<br/>I-600/600A Petition to Classify Orphan as an Immediate Relative from $545 to $670<br/>N-565 Application for Replacement of Certificate of Citizenship (used for name <br/>changes) from $220 to $380<br/>N-600 Application for Certificate of Citizenship from $255 to $460<br/>Biometric Services (fingerprints) from $70 to $80<br/><br/>I am curious what added benefit I would be deriving from these increases?  Will <br/>the length of time these documents are valid be increased? Would there be some <br/>way to state that those in process could be &quot;grandfathered in&quot; so that increases <br/>or redoing of these doucments would not need to be done if the family is in <br/>process of adoptiing a child and the documents expire?<br/>We have been told not to comment about the cost, but I have to comment about <br/>the cost.  Each international adoption is expensive- if I was able to give birth to a <br/>child, my insurance would cover the cost of that child, but I am not able to have a <br/>biological child and I have choosen to form my family through adoption.  As my <br/>process has moved throught he courts in Guatemala, I am forced to renew <br/>documents for the US that are expiring- like my finger prints, soon my I-171H.  <br/>These are expenses that continue to rise, they increase the cost of my adoption <br/>beyond what I was told to plan for.  I can understand an increase in the fees, if it <br/>was a one time thing- that the documents I paid for at the beginning of this <br/>adoption would carry through to the end no matter how long it takes.  The fact that <br/>a foriegn court is moving slower should not be the reason I have to redo these <br/>documents and pay for them again at a higher fee.  Can you not increase the time <br/>these <br/>documents are good for such that families are not required to redo these <br/>doucments in process?  Can you not consider making the fee increases only for <br/>those now starting the process and requesting these documents? <br/><br/>As I look at these documents, I do not see the increase in overhead to provide <br/>them- computers are doing more and more of the work (background searches, <br/>electronic finger prints, etc).  These process are more efficient, so what is driving <br/>these increases?<br/><br/>Thank you for your time and the opportuinity to comment.<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021b7c3", "lastName": null, "legacyId": null, "modifyDate": "2007-03-29T19:37:41Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-28T23:55:03Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by D. A. Cole", "trackingNbr": "8021b7c3", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2052/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2052/attachments"}}}}}