{"data": {"id": "USCIS-2006-0044-1987", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1987"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "On behalf of the National Network to End Violence Against Immigrant Women, we <br/>are writing to strongly oppose the proposed increases for immigration and <br/>naturalization fees, the elimination of VAWA self-petitioning fees, and changes to <br/>the fee waiver system as proposed by the US Citizenship and Immigration <br/>Services (USCIS) on February 1, 2007.  <br/><br/>The National Network to End Violence Against Immigrant Women is comprised of <br/>over 3,000 professionals nationwide including police, sheriffs, district attorneys, <br/>probation officers, prosecutors, health providers, churches, rape crisis centers, <br/>domestic violence shelters, mental health professionals, child protective services <br/>workers, and immigrant rights? groups.  The Network?s members are all joined by <br/>a common purpose -- working towards the eradication of all forms of violence <br/>perpetrated against immigrant women and children including domestic abuse, <br/>sexual assault, human trafficking, and stalking.  <br/> <br/>Eliminating Fees for VAWA Self-petitioners<br/>The National Network has worked with Congress since 1994 to craft special <br/>routes to status for noncitizen survivors of domestic violence and sexual assault. <br/>The VAWA self-petitioning provisions and the U visa are two notable products of <br/>our efforts.  As the authors of these provisions, we strongly object to the proposed <br/>elimination of fees for VAWA self-petitioners. We did not request this fee <br/>elimination and we believe it will be more harmful than helpful to self-petitioners.<br/><br/>We certainly do not support raising other fees to compensate for the elimination of <br/>VAWA fees.  We have always opposed ?fixes? for survivors of violence that harm <br/>other immigrants, not only for philosophical reasons, but also because immigrant <br/>survivors of violence do not live in a vacuum.  Many of them may have separated <br/>from their abusers and live in families and communities that will be harmed by the <br/>general fee increases. This, in turn, harms domestic violence survivors. <br/><br/>Self-petitioning is not the only route to status Congress contemplated for survivors <br/>of violence; the battery or extreme cruelty waiver to conditional residence, the U <br/>visa, and the special access to work authorization for dependents of certain <br/>nonimmigrants are examples of other special options Congress has created.  <br/>Victims of domestic violence must be able to pursue the avenues to status that <br/>are safest for them, which may not be completely outside the special options for <br/>violence victims. <br/><br/>Some self-petitioners can afford to pay the fees, so providing an exception for only <br/>this category makes no sense. Since USCIS argues that it needs fees to ensure <br/>efficient adjudication, self-petitioners who can afford to pay the fees should do so.  <br/>Those that cannot should be able to request a fee waiver, as should all otherwise <br/>eligible applicants for secure status.<br/><br/>Fair Fee and Waiver Structure<br/>What self-petitioners need, like other immigrants, are a fee structure and a <br/>generous fee waiver system that reflect their financial reality. These principles <br/>should apply not just to self-petitioning, but to fees for work authorization, <br/>adjustment of status and other matters associated with obtaining self-petitioning <br/>status and permanent residence. This is how the current system works, and it <br/>works well for self-petitioners, promoting safety as well as fairness. Eliminating or <br/>restricting access to fee waivers for all related applications will undermine <br/>Congress? goal to protect and provide secure status to immigrant survivors of <br/>domestic violence and other crimes.<br/><br/>USCIS? suggestion that public charge concerns make fee waivers inappropriate for <br/>those seeking adjustment of status is inaccurate.  Congress didn?t just mandate <br/>access to self-petitioning for domestic violence survivors, it also smoothed their <br/>path to lawful permanent residence, including relaxing public charge <br/>considerations at the adjustment phase.  Self-petitioners, those seeking special <br/>immigrant juvenile status, U and T visa applicants, asylees and others may be <br/>able to overcome public charge concerns even if they obtain fee waivers.  <br/><br/>USCIS also argues that regular family-based petitioners should be ineligible for fee <br/>waivers because they must submit affidavits of support. Given the visa quota <br/>system and processing backlogs, many regular family-based immigrant <br/>applicants who need fee waivers at the initial phase may be able to overcome <br/>public charge concerns by the time USCIS adjudicates their adjustment <br/>applications.  This approach, in fact, comports with USCIS own instructions on <br/>considering public charge as a prospective test. <br/><br/>USCIS should retain the existing fee waiver system, not restrict it.  Giving <br/>applicants the choice to pay the fees or seek fee waivers is the best way to <br/>promote victim safety and ensure eligible immigrants participate fully in our <br/>society.<br/><br/>Do Not Erect a Financial Fence to Regularizing Status<br/>Many immigrants already struggle to pay immigration fees. The proposed <br/>increases in these fees, sometimes double the current fee, will create a financial <br/>fence to legalizing thousands of immigrants.  Drastically enhanced fees, coupled <br/>with restrictions on fee waivers, will force many hard-working immigrants into <br/>undocumented status.  These otherwise eligible immigrants will become more <br/>vulnerable to exploitation and crime victimization and less able to contribute to our <br/>communities and formal economy.  This result confounds attempts at immigration <br/>reform by forcing people to become undocumented instead of encouraging them to <br/>gain secure legal status.<br/><br/>USCIS should wait to see what Congress enacts in the coming year before <br/>suggesting new fees. The new law may create a new stream of money.  Moreover, <br/>USCIS should not rely solely on fees to support its operations. It should ask <br/>Congress for direct support instead, which Congress has provided in the past.<br/><br/>For all these reasons, the proposal to increase immigration fees and change the <br/>current fee waiver system is imprudent and Ineffective.  We urge USCIS to <br/>reconsider this proposal, to retain the existing fee waiver system and fees for <br/>VAWA self-petitioners, and to seek other sources of funding for its operations, <br/>rather than shift the burden to selected groups of immigrants.  Thank you for your <br/>consideration.<br/><br/>On behalf of the National Network to End Violence Against Immigrant Women<br/><br/>Gail Pendleton<br/>Asista Immigration Assistance<br/><br/>Joanne Lin<br/>Legal Momentum<br/>Immigrant Women&#39;s Program<br/><br/>Leni Marin<br/>Family Violence Prevention Fund<br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021b518", "lastName": null, "legacyId": null, "modifyDate": "2007-03-29T16:12:01Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-28T17:43:17Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Joanne Lin", "trackingNbr": "8021b518", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [{"id": "0900006480dff8cf", "type": "attachments"}], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1987/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1987/attachments"}}}}, "included": [{"id": "0900006480dff8cf", "type": "attachments", "links": {"self": "https://api.regulations.gov/v4/attachments/0900006480dff8cf"}, "attributes": {"agencyNote": null, "authors": null, "docAbstract": "Attachment on USCIS-2006-0044-DRAFT-2589", "docOrder": 1, "fileFormats": [{"fileUrl": "https://downloads.regulations.gov/USCIS-2006-0044-1987/attachment_1.doc", "format": "doc", "size": 35328}], "modifyDate": "2007-03-29T12:12:02Z", "publication": null, "restrictReason": null, "restrictReasonType": null, "title": "Comment Submitted by Joanne Lin (Attachment)"}}]}