{"data": {"id": "USCIS-2006-0044-2671", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2671"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Fees related to international adoption already create a barrier for infertile couples <br/>to realize their goals of creating a family through this form of adoption.  Increased <br/>fees will not encourage more families to use our flawed domestic adoption <br/>system.  It will only hurt these US victims of reproductive diseases and the <br/>orphaned victims of poverty/disease abroad.  The agencies that process the <br/>paperwork for international adoptions already leave the putrid taste of bureaucracy <br/>in the mouths of hopeful couples.  They force adoption and referral delays and <br/>work-related absences in the process.  They cost the couples hundreds of dollars <br/>and weeks of time for a small determination and sheet of paper.  To add to that? <br/>is abuse.  Sit in an office with a woman while a nurse schedules her fifth D&amp;C; <br/>hold a woman?s hand when the doctor?s tell her that her last IVF cycle failed and <br/>she had spent $60,000 and taken out loans but still won?t have a child; go to a <br/>domestic adoption counselor and hear about the fees and likelihood a couple will <br/>be able to adopt a healthy infant from this country; watch your wife?s face when <br/>her siblings and closest friends announce their pregnancies and feel the shame of <br/>impotence; listen to the shattering quiet the day your wife gets her period each <br/>month; and don?t be bitter when you find out that the government that won?t <br/>declare infertility a disease that should be covered by insurance will raise the <br/>costs associated with international adoption.  The government that gives women <br/>the freedom to murder fetuses, allows abusive parents visitation rights to their <br/>victims, and rewards parenthood with tax breaks and credits, is now adding to <br/>their barriers?taking back part of the adoption credit--that was your last hope for <br/>starting a family.  Pardon me for not being polite and gracious.  <br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021e4b1", "lastName": null, "legacyId": null, "modifyDate": "2007-04-03T13:38:03Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-01T19:23:53Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Sidney Porter", "trackingNbr": "8021e4b1", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2671/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2671/attachments"}}}}}