{"data": {"id": "USCIS-2006-0044-1975", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1975"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "To say the least, I am of the up most offended by such a proposed raise in rates.  <br/>I am the father of one son and one daughter who are adopted from a foreign <br/>country.  We are only now able to start the process for applying for the Certificate <br/>of Citizenship for the one child, but need to wait until the courts finalize before we <br/>can apply for the second CoC.  While I make a good wage, such increases in fee <br/>would require us make cuts in our budgets else where.  I can only imagine what <br/>would happen if a family that was adopting had less of an income as we do.  We <br/>are folks whom are trying to do the right thing in life and not only have a family, but <br/>do so by helping a child of a foreign country.  Our laws state that a child becomes <br/>a US cititzen once the adoption to qualify parents becomes finalized.  Why not <br/>provide a Certificate of Citizenship automatically - at no cost.  We are Land of the <br/>Free and Home of the Brave....The Statue of Liberty doesn&#39;t say give me your <br/>poor, your needy....for $600 dollars.  Let&#39;s get real.  We have set up the Dept. of <br/>Homeland Security to have an integrated computer system with all the other US <br/>federal agencies and dept., yet the Social Security Administration will not <br/>recongize my son as a US Citizen until I produce a Certificate of Citizenship <br/>(COC).  How insulting.  <br/><br/>Private NGOs and Non-profits must find ways to be more effecient at less cost, <br/>but our federal gov&#39;t keeps increasing fees.   How are families that are trying to <br/>adopt supposed to keep putting up fees for USCIS paperwork, and still afford to <br/>pay all the other cost that amount to and excess of $25,000.  We can&#39;t keep <br/>screwing the folks that want to do the right thing.  My firm belief that the cost to <br/>adopt should be a tax credit for the total cost of adoption, not just a set limit, and <br/>not for a specific income bracket.  Equal for all.  Then at least I can get my money <br/>back from the US Gov&#39;t that keeps taking money out of my wallet while kissing me <br/>on my cheek.  I have a cheek you can all kiss right here.<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021ac39", "lastName": null, "legacyId": null, "modifyDate": "2007-03-29T16:10:57Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-29T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-28T02:01:59Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Latorrett", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Christopher B. Owen", "trackingNbr": "8021ac39", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1975/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1975/attachments"}}}}}