{"data": {"id": "USCIS-2006-0044-2883", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2883"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "On behalf of my husband Brian and myself, I am writing with concerns about the <br/>proposed Immigration Benefit Application/Petition and Biometric fee increase.  <br/><br/>We are parents-to-be of a child from China and our dream of completing our family <br/>has been, and continues to be, a ?long and winding road?. To fulfill our dream we <br/>chose to adopt from China.  At times we have found the process to be both difficult <br/>and exhausting.  We have had to submit to the scrutiny of our adoption agency, <br/>our state, our federal government, and the Chinese government.  <br/><br/>The investment of our time, money and emotions has been substantial. We have <br/>followed all the rules of both the United States and the Peoples Republic of China. <br/>We filled out the dozens of required forms, ordered the required documents, <br/>prepared our dossier and immigration files and sent them to China.  Finally, after <br/>all this, we have allowed ourselves to be filled with the overwhelming hopes, fears, <br/>dreams and desires of all waiting parents!  <br/><br/>As part of this process we are required to obtain USCIS approval (form I-171H).  <br/>Our approval has been processed and according to current regulations is valid for <br/>18 months. Until recently, this approval period served families adopting from China <br/>quite well.  However, China is now experiencing a significant increase in the length <br/>of time it will take to match us with our child. Therefore, like most other families <br/>now in the process of adopting from China, we will have to re-file their I-600A to get <br/>a new I-171H.  <br/><br/>The burden of paying and submitting a new I-600A for a file that is already <br/>approved seems pointless and an unproductive use of USCIS resources. For us to <br/>be asked to pay these fees twice certainly seems excessive and unwarranted. But <br/>for us to be charged an increased fee on top of it seems absurd.<br/><br/>We hope for relief of the burden of submitting another I-600A for a new I-171H <br/>since we have not even had the chance to use the one given to us initially.  What?s <br/>more, we ask that you please think of the many families like ours who are in the <br/>process of adopting who could be effected by the additional costs of an already <br/>expensive process and reconsider raising these fees.  <br/><br/>Our hearts are open and eager to love a child adopted from China.  Please do not <br/>add additional time and cost simply because we want to be the parents of an <br/>orphan. Please consider helping us by not increasing the fees.<br/><br/>Thank you for your time and thoughtfulness toward this matter.  <br/><br/>Sincerely,  <br/><br/>Kathryn and Brian Knox<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021f244", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:08:37Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-03T02:03:42Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Kathyrn Knox", "trackingNbr": "8021f244", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2883/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2883/attachments"}}}}}