{"data": {"id": "USCIS-2006-0044-2571", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2571"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Regarding: DHS Docket No. USCIS-2006-0044<br/>Please do not increase the fees associated with international adoption.  Federal <br/>Register 8 CFR Part 103 proposes that filing fee for the I-600/I-600A will increase <br/>from $545 to $670. <br/><br/>International adoption itself is a time-consuming, emotional and expensive <br/>process for the adopting parents. For example, we are adopting from China and <br/>our estimated total adoption cost is over $24,000.  People adopting are not rich <br/>and this is a huge sum of money, but folks simply want to build their family and, <br/>for a variety of different reasons, international adoption is their best option for doing <br/>so. <br/><br/>In the Federal Register announcement, Table 6 outlines the projected workload <br/>volume for I-600/I-600A.  One reason for the increase in workload volume is <br/>because adoption processing timeframes in China have increased and families are <br/>having to file TWO I-600A to complete their adoption. For example, we filed our I-<br/>600A in November 2005 and our paperwork was sent to China at the end of <br/>December 2005. Our adoption has still not completed and we had to re-file our I-<br/>600A this month because our I-171H was going to expire (June 2007) before the <br/>adoption was completed. <br/><br/>The fact that we have already been approved to adopt by USCIS but then have to <br/>re-file and be re-approved because our I-171H expires in June 2007 but we won?t <br/>be bringing home our child until at least October 2007 added over $900 to our <br/>adoption costs. Was it really necessary for us to be re-approved and pay all the <br/>fees again to simply get us through four to five more months until we completed <br/>the adopting process? This increases the workload volume at USCIS.<br/><br/>Instead of increasing the fee for filing the I-600/I-600A because of projected <br/>workload volume increase, simply extend the validity timeframe of the I-171H from <br/>18 months to 24 months and leave the fees unchanged. This will relieve some of <br/>the financial burden of Americans adopting internationally and it will mean that <br/>there won?t be an increase in I-600/I-600A filings because families waiting for their <br/>referral won?t have to re-file. <br/><br/>Thank you for your consideration.<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021de03", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T20:07:27Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T19:57:40Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Jay Inslee", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Shannon Gaub", "trackingNbr": "8021de03", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2571/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2571/attachments"}}}}}