{"data": {"id": "USCIS-2006-0044-0493", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0493"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Dear Sir/Madam.<br/><br/>It is very good to know and nice to observe that there is some real thought process <br/>in-place for the Immigration policy and regulations. But it would have been really <br/>appreciated very much by millions of beneficiary, employers and law-firm if this <br/>thought process has been made in the most current demanding needs of today, <br/>which is to reduce the undue processing delays in various stages of Immigration <br/>say filing RIR (LC), I-140 and I-485.<br/><br/>But it was very unfortunate to know that most of the fees related to Immigration <br/>services are proposed to be increased considerably. Keeping the turn around time <br/>in mind for processing various cases say I-140 (turn around time for regular <br/>processing is close to 6-7 months), I-485 (turn around time for processing varying <br/>from 3-12 months once the priority date becomes current) it doesn&#39;t warranty any <br/>need to increase the cost of any immigration service provided by USCIS.<br/><br/>It is very much understood that the process in certifying any Immigration case has <br/>become complicated these days due to the tight security measure. But more than <br/>the security measure it is the resource crunch at various USCIS centers and slow <br/>processing are the main factors pushing things in a wrong direction for not getting <br/>things done in timely fashion by USCIS.<br/><br/>Please make every effort to make things better to improve the processing time <br/>involved in various stages of Immigration. I believe, if things moves faster there <br/>would not be any concern from beneficiary, law-firm or employer rather everyone <br/>would support the increase in cost of Immigration.<br/><br/>So the think tank behind this Immigration policy, should spend sufficient time in<br/>evolving a decent timeframe for all these process. It would benefit many of the <br/>LEGAL immigrants who are working for the good cause of this country&#39;s economy.<br/><br/>Keeping in mind the jobs which have started moving to the other parts of the world, <br/>I think to remain competent and competitive is the only way to get around any <br/>concerns or problems. Any steps taken other than that would be a very bad <br/>decision in long term. So please think in terms of long term goals rather short term <br/>goals like increasing the prices of immigration while the service outcome is very <br/>bad. Instead, the current trend of immigration processing demands reducing the <br/>cost from the existing price. <br/><br/>&quot;In general the common sense would be to increase the cost if and only if there is <br/>any quality of service provided&quot;. I would appreciate that USCIS to be a good trend <br/>setter and not be a wrong doer.<br/><br/>Thanks<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480207c4a", "lastName": null, "legacyId": null, "modifyDate": "2007-02-16T18:55:07Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-16T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-15T20:22:10Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anonymous", "trackingNbr": "80207c4a", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0493/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0493/attachments"}}}}}