{"data": {"id": "USCIS-2006-0044-0266", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0266"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "As an employee of an Immigration attorney, I see the clients? needs.  I know the <br/>people who are most desperate to keep their families intact, as well as where they <br/>stand financially.  I also see the intense pressure and stress that Immigration <br/>regulations and waiting times can put upon people&#39;s lives.  <br/>Is it too much to ask that a person be allowed to attend to their dying parents in <br/>their home country?  As the home of the free, we are supposed to be humane.  <br/>Does the phrase &quot;Give me your tired, your poor, your huddled masses, yearning <br/>to breath free&quot; have no meaning in the current climate of terrorism and fear?  <br/>The people that this agency was created to serve have come here for two basic <br/>reasons: to make a better life for themselves and their families or because their <br/>families (spouse, children, parents) have already made a better life and the family <br/>wants to be reunited.  <br/>The proposed fees place an enormous burden upon the US Citizen petitioners that <br/>are trying to unite their family.  Already, waiting times cause families to miss <br/>spectacular and life altering events because they can not go home, or their child <br/>can not come to the US, because that child is waiting on a visa.  <br/>A 20% reduction in processing times does NOT justify a 60% increase in fees.  <br/>Under the rules of VAWA, a spouse of a US Citizen, who has been abused by <br/>said US Citizen must wait over 9 months (at the current processing times) for their <br/>initial visa application to be approved before they can even apply for permanent <br/>residence.  Then there must be an additional wait of 7 months for their Permanent <br/>Residency application to be approved.  This the best case scenario assuming that <br/>there is no additional evidence requested (many times incorrectly or <br/>unnecessarily).  This abused spouse, often without any family or support in <br/>America, must often wait 16 months before they can have peace of mind that their <br/>abusive spouse can no longer hurt them and they can stay and work in America.  <br/>This VAWA applicant is most likely not in a position to make any money or <br/>receive any employment until after their application is on file.  These applicants <br/>struggle to pay the current filing fees, and yet they are expected to pay the new <br/>fees that have increased 60% for a decrease of about three months in processing <br/>time.<br/>Unacceptable.<br/>On the USCIS.gov home page a statement is made.  &quot;Securing America&#39;s <br/>Promise.&quot; What is this promise?  That they will be financially skewered for a very <br/>small perceivable gain?    <br/>I understand that technology is expensive, but USCIS has made great gains in the <br/>last year with a decrease in processing times.  Although still unacceptable, <br/>progress HAS been made WITHOUT increasing fees by 60%.  <br/>Do not allow this increase to occur.  Thank you for your concern in this matter.<br/>From:<br/>A native-born 4th Generation American<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801fe345", "lastName": null, "legacyId": null, "modifyDate": "2007-02-08T22:18:57Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-08T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-08T21:41:44Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Anita W. Faulkner", "trackingNbr": "801fe345", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0266/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0266/attachments"}}}}}