{"data": {"id": "USCIS-2006-0044-2569", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2569"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "To Whom It May Concern;<br/><br/>I writing to ask that the proposed fee increase to the Immigration and <br/>Naturalization Benefit Application and Petition Fee Schedule not be increased. I <br/>am currently waiting to be matched with an orphan child from China. Given the <br/>current waiting period and the gradual increase in time that has been evidenced <br/>over the past 6 months, it is quite likely that I will be waiting for at least two years, <br/>if not three. Given the fact that necessary documents are only valid for a short <br/>time, it is likely that I will have to pay fees to renew these documents at least <br/>once, if not twice. Additionally, I will be required to re-submit fingerprints, with the <br/>excessive fee, each time.<br/><br/>This will be my only child. I am not a wealthy person, but I do have enough to give <br/>a healthy and secure home to a child. I wish that could be a child from the United <br/>States, but the costs are prohibitive to the extreme. In fact, I chose China <br/>because of it&#39;s affordability (vs. the US) and it&#39;s reliability (vs. the US). It is <br/>unfortunate that I will be required to wait for such a long time, but it is the situation <br/>I must accept.<br/><br/>Each time I pay the USCIS fees, it decreases the amount of time I will be able to <br/>spend with my child, because I will have return to work more quickly after arriving <br/>home and take on more jobs to make up for it. Additionally, as a teacher, my <br/>fingerprints are already on file with the FBI. In fact, having worked with children for <br/>the past 20 years, my fingerprints have been taken more than 9 times. The USCIS <br/>is the only agency to charge such an exorbitant rate for a seemly simple <br/>procedure. Why are these fingerprints are not accessed when the renewal comes <br/>up? These would seem an easier and less work intensive procedure.<br/><br/>I realize that many are concerned about false identities and immigrations issues. <br/>However, penalizing adoptive parents is not the answer. There seems to be a <br/>myth that those choosing to adopt from outside of the US are wealthy &quot;yuppies&quot; <br/>looking for perfect babies. This is an aggregious stereotype and simply not true. <br/>However, these fee increases will certainly limit adoptions to those types of <br/>families as they will have to consider adding yet another $1000 to amount required <br/>to process the adoption.<br/><br/>Please reconsider these fee increases.<br/><br/>Sincerely,<br/><br/>Jana Johnson<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021ddeb", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T20:07:24Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T19:41:40Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Jana Johnson", "trackingNbr": "8021ddeb", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2569/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2569/attachments"}}}}}