{"data": {"id": "USCIS-2006-0044-2506", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2506"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "  My husband and I are in the process of adopting a baby girl from China.  We <br/>submitted our I-600A in Jan 2006 and received our I-171H in May 06.  Our dossier <br/>was logged in (&quot;LID&quot;) to China 6/19/06.  Due to lengthening referral times in China <br/>(e.g. from 8-9 mos when we began this process, to current waiting time of 16-17 <br/>mos), we do not expect our referral until Oct/Nov 06.  Since the 171-H expires in <br/>18 mos, and must be valid when we travel to China to get our child, we will now <br/>have to reapply to renew our I-171H and pay the entire I-600A application fee <br/>again.  We, and other parents pursuing international adoption, have no control over <br/>the referral and travel waiting times, hence many families (especially for China) are <br/>going to have to pay double I-600A fees.  If docket # 2006-0044 goes into effect, <br/>we will pay even higher fees in addition to repeat fees, and this is unacceptable.  <br/>This is yet another reason why the I-171H expiration should be extended to 24 <br/>months, and renewable without having to resubmit an I-600A and pay duplicate <br/>fees (i.e. when nothing in our application has changed!).  <br/> Higher fees should not be charged to adoptive families, who are already paying <br/>thousands of dollars to adopt children from foreign countries in order to provide <br/>them with a family and a better life.  I have read the docket 2006-0044 and totally <br/>disagree with USCIS adoption form fees being increased to support the <br/>Immigration Examination Fee Account to &quot;provide services to asylum and refugee <br/>applicants and certain other immigrants at no charge.&quot;  In my opinion, those <br/>applicants should have to pay the same fees as everyone one else applying for <br/>citizenship- if they can&#39;t afford immigration fees, they should be able to apply for <br/>citizenship, period.  Adoptive families should not have to pay higher fees to <br/>support immigrants who can&#39;t afford fees; this is another indication that <br/>immigration into the U.S. needs to be better controlled and limited.  <br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021db87", "lastName": null, "legacyId": null, "modifyDate": "2007-04-02T15:18:54Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-02T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-31T12:45:46Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": "Great Wall China Adoption", "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by Julie Working", "trackingNbr": "8021db87", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2506/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2506/attachments"}}}}}