{"data": {"id": "USCIS-2006-0044-0312", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0312"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "On behalf of the Southeast Asian community in Lowell, Massachusstts and on <br/>my own behalf, I am most concerned about a proposed rule by the Citizenship <br/>and Immigration Service, the division of the Department of Homeland Security, to <br/>nearly double the cost of becoming an U.S. citizen and drastically raise the cost <br/>of becoming a legal permanent resident. According to the articles by the <br/>Associate Press issued on January 31, 2007, the proposal seeks to increase an <br/>application fee for citizenship from $330 to $595 and the fee for becoming a legal <br/>permanent resident from $325 to $905.<br/><br/>The proposal, if adopted, would affect the poor Southeast Asian refugees and <br/>immigrants especially Cambodians in the United States. It would prevent tens of <br/>thousands of Cambodians who have already taken or will take steps <br/>toward becoming US citizen or permanent residents from becoming one. <br/><br/>Lowell, MA would be disproportionately affected since it is home to the second-<br/>largest community of Cambodian refugees in the United States.  According to the <br/>2000 U.S Census, the Southeast Asian population of Lowell totals 17,300. It is <br/>believed that the total Lowell?s Southeast Asian population is seriously <br/>undercounted. The Lowell City officials estimate the Southeast Asian population <br/>to be at least 32,000 most of who are Cambodians. According to recent census <br/>data, the per capita income for the Lowell?s Cambodians is US$ 6,259; 42.6 % of <br/>them live below the Federal Poverty Level; and only 46% are in the workforce, in <br/>contrast to the national average of 65%.<br/><br/>I hope you will seriously consider the impact that the proposal would have on our <br/>poor Southeast Asians who would seek to become American citizen or permanent <br/>residents. The proposal with its current price tag can only prevent smooth <br/>integration of minority communities into a mainstream society, and seems to be <br/>contrary to an immigration policy that President Bush well articulated in his state <br/>of the Union Address to the United States Congress on Tuesday January 23, <br/>2007. <br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "0900006480202912", "lastName": null, "legacyId": null, "modifyDate": "2007-02-12T19:50:43Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-12T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-12T14:16:29Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Sengly Kong", "trackingNbr": "80202912", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0312/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0312/attachments"}}}}}