{"data": {"id": "USCIS-2006-0044-1826", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1826"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Director, Regulatory Management Division<br/>US Citizenship and Immigration Services<br/>Department of Homeland Security<br/>111 Massachusetts Ave. NW, 3rd floor<br/>Washington DC 20529.<br/><br/>RE:  DHS Docket # USCIS-2006-0044<br/><br/>Proposed rule? Adjustment of the Immigration and Naturalization Benefit <br/>Application and Petition Fee Schedule<br/><br/>To Whom It May Concern:<br/>I am writing to strongly oppose the increase to immigration and naturalization fees <br/>that US Citizenship and Immigration Services (USCIS) proposed on February 1, <br/>2007.  <br/><br/>Many of the immigrants and refugees we work with on a daily basis already <br/>struggle to pay immigration fees.  The steep increases proposed by USCIS, which <br/>in some cases double the current fee, would put the goals of gaining permanent <br/>resident status, reuniting with family members, and ultimately becoming a US <br/>citizen farther out of reach.  USCIS should be building bridges for immigrants to <br/>move toward citizenship, not putting up walls.<br/><br/>The proposed fee for naturalization is particularly jarring.  As recently as 1998, the <br/>cost to apply for citizenship was $95.  In 2002, after the Bush Administration took <br/>office, the costs (including biometric fees) went up from $250 to $310.  The total <br/>fees are now $400, a fourfold increase in the past eight years.  Now USCIS is <br/>proposing a further increase of 70%, to $675.  An immigrant working at a <br/>minimum-wage job would need to work for more than three weeks and save all of <br/>his earnings in order to pay this fee.<br/><br/>Even more startling is the proposed cost of filing for adjustment of status, which <br/>for many immigrants is the first step on the road leading to US citizenship.  That <br/>application has risen from $130 in 1998 to $325 today, plus $75 for biometrics.   <br/>Under the proposed rule, the price will rise to $905 plus $80 for biometrics.  In <br/>other words, it will cost nearly $1,000 for an immigrant to get a green card and <br/>start the five-year countdown to citizenship.  A minimum-wage immigrant worker <br/>would need to save a full month?s pay to afford the proposed fee.<br/><br/>USCIS claims that the fee increase is necessary to improve service.  USCIS <br/>definitely needs to improve service, as shown by the continuing backlogs in <br/>application processing and the months-long (even years-long) delays caused by <br/>security checks.  Last October, the Government Accountability Office reported <br/>that the agency had lost track of 110,000 files needed to process citizenship <br/>cases.  <br/><br/>I applaud USCIS?s efforts to improve service.  I nevertheless believe that the <br/>burden of paying for such improvements should not rest solely with immigrants <br/>who are already struggling to pay agency costs and receiving poor service.  <br/><br/>USCIS also argues that it has no other option than raising fees if it wants to cover <br/>its costs.  In fact, there are no laws that require USCIS to fund all of its operations <br/>through fees.  Nothing prevents USCIS from pursuing other sources of revenue, <br/>including asking Congress for appropriations.  Indeed, USCIS has sought and <br/>received Congressional funding several times in the past<br/><br/>Most basically, immigration and citizenship are public goods that benefit our <br/>entire country and that we as a nation should help pay for.  Immigrants bring their <br/>talent and hard work to our economy.  They pay taxes and help revitalize our <br/>communities.  In becoming citizens, immigrants demonstrate their strong <br/>commitment to their new home country by learning English, gaining knowledge <br/>about American history and government, and swearing allegiance to the United <br/>States.  It is little wonder that newly naturalized citizens, eager to participate in <br/>our democracy, consistently vote at higher rates than other citizens.  We should <br/>be encouraging immigrants to become part of our community by gaining legal <br/>status and becoming citizens, not setting up barriers that block their path and <br/>keep them out.  <br/><br/>For all these reasons, the proposal to increase immigration fees is misguided and <br/>counterproductive.  We urge USCIS to reconsider this proposal, and to seek other <br/>sources of funding for its operations, rather than add more burdens on <br/>immigrants.  Thank you for your consideration.<br/><br/>Sincerely,<br/><br/>Todd Ricker<br/>655 Congress St. #518<br/>Portland, ME 04101<br/>Todd.Ricker@Juno.com<br/><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><br/><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><span style='padding-left: 30px'></span><br/><br/>Comment on FR Doc # E7-01631", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021a699", "lastName": null, "legacyId": null, "modifyDate": "2007-03-28T18:28:39Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-03-28T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-03-27T14:10:22Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Todd R. Ricker", "trackingNbr": "8021a699", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [{"id": "0900006480dff8cd", "type": "attachments"}], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1826/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-1826/attachments"}}}}, "included": [{"id": "0900006480dff8cd", "type": "attachments", "links": {"self": "https://api.regulations.gov/v4/attachments/0900006480dff8cd"}, "attributes": {"agencyNote": null, "authors": null, "docAbstract": "Attachment on USCIS-2006-0044-DRAFT-2404", "docOrder": 1, "fileFormats": [{"fileUrl": "https://downloads.regulations.gov/USCIS-2006-0044-1826/attachment_1.doc", "format": "doc", "size": 31744}], "modifyDate": "2007-03-28T14:28:43Z", "publication": null, "restrictReason": null, "restrictReasonType": null, "title": "Comment Submitted By Todd R. Ricker (Attachment)"}}]}