{"data": {"id": "USCIS-2006-0044-2886", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2886"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "The proposed fee increase is disappointing, particularly for a couple currently <br/>engaged in the adoption process. The transient nature of my military career <br/>makes it nearly impossible to engage in domestic adoption. Even if that were not <br/>the case, the current state of family law in the United States (permitting and <br/>sometimes encouraging birth parents to reclaim the children they gave up for <br/>adoption) creates an uncertainty that, in my opinion, makes domestic adoption <br/>untenable.<br/><br/>1. The information provided is insufficient to allow for full analysis and useful <br/>criticism.  For example, Section X of the proposal &quot;cherry-picks&quot; examples of <br/>significantly increased completion rates (comparing the current review to the FY08 <br/>review).  Only six forms and the waiver reviews are cited, despite the significant, <br/>nearly across-the-board fee increases. Table 11 claims that $72 is required from <br/>each I-600/600A petition to cover the cost of free services to asylum seekers and <br/>those individuals granted fee waivers. Other than the word of the agency, no <br/>information was provided to support these figures that appear unreasonable <br/>without explanation. Section I claimed that certain supporting documentation (the <br/>FY 2008/2009 Fee Review Supporting Documentation and Small Entity Analysis <br/>for Adjustment of the Immigration Benefit Application/Petition Fee Schedule) <br/>would be in the electronic docket, yet the electronic docket lists no such <br/>information. Only document USCIS-2006-0044-0001 (the notice of proposed <br/>rulemaking) is government information. The remainder is public comment. This <br/>failure to provide sufficient (and promised) factual detail and rationale interferes <br/>with my ability to comment meaningfully on this point. I am unable to compare the <br/>current completion rates with the previous completion rates and evaluate the <br/>claims made by the agency with regard to the impact of longer completion rates <br/>on most of the forms with proposed fee increases.<br/><br/>2. Based on the current completion rates, I have significant concerns regarding <br/>waste in the department. For instance, the completion rate for the I-600/600A is <br/>1.53 hours in the local office. The agency proposes to charge $670 for 1.53 hours. <br/>Even removing the costs not associated with the determination ($140 from Table <br/>10, plus $72 from Table 11), that leaves $458 for that hour and a half of work. If <br/>this a reasonable amount, then I work for the wrong federal agency. I note that in <br/>Section VI.A., the agency claims that 39% of the FY 2008/2009 IEFA costs are <br/>attributable to overhead. Recalling the agency?s definition of overhead (?the <br/>ongoing administrative expenses of a business which cannot be attributed to any <br/>specific business activity, but are still necessary for the business to function?), <br/>over a third of the costs cannot be attributed to any specific activity. This is an <br/>opportunity for profligate behavior. If such wild inefficiency were eliminated, fee <br/>increases might be more reasonable.<br/><br/>3. The legal authority for this action, 8 U.S.C. 1356(m), according to Section II, <br/>permits, but does not require, the proposed fees.  To quote the statute, ?[F]ees for <br/>providing adjudication and naturalization services *may* be set at a level that will <br/>ensure recovery of the full costs of providing all such services, including the costs <br/>of similar services provided without charge to asylum applicants or other <br/>immigrants. Such fees *may* also be set at a level that will recover any additional <br/>costs associated with the administration of the fees collected.? Emphasis added. <br/>It appears that the federal government is providing essential government services <br/>on a fee basis and using the justification that these forms are all ?voluntary.? See <br/>Section XII.B. Voting is voluntary, yet poll taxes are illegal, even for ballots printed <br/>in multiple languages, despite the fact that all naturalized citizens are required to <br/>pass a civics test in English to become citizens. Making a family whole and <br/>insuring that all members of that family are citizens is no less critical to this <br/>nation?s well-being than insuring that non-English speakers are able to vote.<br/><br/>4. While I concur in large part with the proposal to limit fee waivers to only a few <br/>forms, I believe the number of forms is too limited. Companies seeking to admit a <br/>foreign employee or individuals seeking status based on substantial investments <br/>are rational limitations, but limitations on many other situations are unreasonable. <br/>While I understand the drive to avoid having immigrants become ?public charges,? I <br/>find great irony as I think of the words on the Statue of Liberty: ?Give me your <br/>tired, your poor, your huddled masses yearning to breathe free, the wretched <br/>refuse of your teeming shore. Send these, the homeless, tempest-tost [sic] to <br/>me...?<br/><br/>5. While not caused by the agency or the federal government, international <br/>adoptions are a lengthy process. Couples seeking foreign adoptions must often <br/>file additional forms and have additional fingerprints taken as the existing time <br/>frames are unreasonable for some countries. These ?renewals? have been reviewed <br/>once already, and thus should not be as time-consuming as an initial application. <br/>The agency should give consideration to decreasing the fees for such renewals.<br/><br/>Thank you for your consideration of these comments, and I hope that the factual <br/>basis for the proposed rule is made available so that future comments may be <br/>more meaningful.<br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "090000648021f25a", "lastName": null, "legacyId": null, "modifyDate": "2007-04-04T01:08:41Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-04-03T04:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-04-03T02:14:52Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted by David Bargatze", "trackingNbr": "8021f25a", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2886/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-2886/attachments"}}}}}