{"data": {"id": "USCIS-2006-0044-0211", "type": "comments", "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0211"}, "attributes": {"commentOn": "09000064801f94cf", "commentOnDocumentId": "USCIS-2006-0044-0001", "duplicateComments": 0, "address1": null, "address2": null, "agencyId": "USCIS", "city": null, "category": null, "comment": "Re USCIS-2006-0044<br/>USCIS (formerly INS) has no real wish to modernize -- they simply want to <br/>preserve the status quo.  My wife, an Irish citizen who first entered this country 43 <br/>years ago, was given a &quot;permanent&quot; green card.<br/>In 1996, she was told that she must get a new card -- the excuse at that time <br/>being &quot;we need a card which is computer readable&quot;.  We spent most of a day at <br/>the then-INS office in Seattle, seeing multiple examples of inefficiency.  And we <br/>had to pay what we then considered an exorbitant set of fees ? something like <br/>$90! (Compare that to today&#39;s fees of $260 for a renewal!)  Won&#39;t try to detail the <br/>inefficiencies we saw, because today, ten years later, we saw most of the same <br/>things at USCIS Seattle -- which, while it has a fancy new building, seems to have <br/>the same employees and culture!<br/>Today, we walked into the USCIS office in Seattle, and the first thing my wife had <br/>to do was fill out an &quot;applicant worksheet&quot;, which asked for EACH and EVERY <br/>item of the questions she had already answered on her mailed-in application for <br/>renewal of her &quot;green card&quot;.  How many pieces of paper would eliminating <br/>the ?applicant worksheet? save each year?! How much would this result in cost <br/>savings? God forbid that USCIS employees should be required to match <br/>applications with appointment paperwork!  This would require that your records be <br/>computerized -- and I predict that, ten years from now (when my wife will be <br/>expected to pay a fee 300% higher than today&#39;s absolutely exorbitant fees), that <br/>still won&#39;t have happened!  And, TEN YEARS after we paid for a new card to <br/>be ?computer-readable?, we saw a system which is still paper-based!<br/>We saw several examples of out-and-out rudeness by your employees, plus a <br/>defensiveness that shouldn&#39;t be there.  Whenever someone questioned a <br/>procedure or method, the immediate response was &quot;it&#39;s not my fault&quot;.  Nobody <br/>said it was, folks -- but it IS the fault of the system!<br/>As to director Gonzales&#39; statement that &quot;I need these fees to give the service that <br/>the immigration community expects...&quot; maybe the service is not necessary!  <br/>Make the green card permanent, as it was originally!<br/>An extraneous comment -- given two months, I could render the USCIS services <br/>to applicants much more effective -- and do it with half the employees who were <br/>wandering around USCIS Seattle!  (Oops ? I know it?s not politically correct to <br/>suggest that civil service positions be questioned, or eliminated!)<br/>Dave Bartholomew<br/>CAPT, USN (Ret)<br/>SailorBart@aol.com<br/><br/>", "country": null, "displayProperties": null, "docAbstract": null, "docketId": "USCIS-2006-0044", "documentType": "Public Submission", "email": null, "fax": null, "field1": null, "field2": null, "fileFormats": null, "firstName": null, "govAgency": null, "govAgencyType": null, "objectId": "09000064801fc47a", "lastName": null, "legacyId": null, "modifyDate": "2007-02-07T16:25:28Z", "organization": null, "originalDocumentId": "", "pageCount": 0, "phone": null, "postedDate": "2007-02-07T05:00:00Z", "postmarkDate": null, "reasonWithdrawn": null, "receiveDate": "2007-02-07T02:46:38Z", "restrictReason": null, "restrictReasonType": null, "stateProvinceRegion": null, "submitterRep": null, "submitterRepAddress": null, "submitterRepCityState": null, "subtype": null, "title": "Comment Submitted By Dave Bartholomew", "trackingNbr": "801fc47a", "withdrawn": false, "zip": null, "openForComment": false}, "relationships": {"attachments": {"data": [], "links": {"self": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0211/relationships/attachments", "related": "https://api.regulations.gov/v4/comments/USCIS-2006-0044-0211/attachments"}}}}}